{
    "https://community.upwork.com/t5/forums/recentpostspage": {
        "https://community.upwork.com/t5/Freelancers/Personalized-link-to-invite-existing-clients/m-p/861585": {
            "title": "Personalized link to invite existing clients",
            "post_date": "Jan 20, 2021  03:22:43 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Dushan P": [
                    "/t5/user/viewprofilepage/user-id/4002963",
                    "Jul 9, 2019"
                ]
            },
            "messages": {
                "Dushan P": "Hi!Can you please give me a link to invite clients to UpWork with a benefit of 0% commission when hired by them?Best regards,Dushan"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/New-to-Upwork/Adding-Portfolio-Items-not-working/m-p/861584": {
            "title": "Adding Portfolio Items not working",
            "post_date": "Jan 20, 2021  03:18:11 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Deborah V": [
                    "/t5/user/viewprofilepage/user-id/7300959",
                    "Jan 20, 2021"
                ]
            },
            "messages": {
                "Deborah V": "I can't seem to add any portfolio item because of a bug that asks me if I want to leave the page every time I try to go from the \"select template\" to the \"add details\" section. I have tried on three different browsers (firefox, brave and edge) and get the dialog on all of them."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Dispute-Arbitration/m-p/861583#M531268": {
            "title": "Re: Dispute/Arbitration",
            "post_date": "Jan 20, 2021  03:12:55 PM",
            "edit_date": "Jan 20, 2021  10:13:24 AM",
            "contributors": {
                "Will L": [
                    "/t5/user/viewprofilepage/user-id/40642",
                    "Jul 9, 2015"
                ],
                "George P": [
                    "/t5/user/viewprofilepage/user-id/6624070",
                    "Oct 1, 2020"
                ],
                "Tonya P": [
                    "/t5/user/viewprofilepage/user-id/67769",
                    "Nov 26, 2015"
                ]
            },
            "messages": {
                "Will L": "George P.As you may know, the process and procedures of arbitration are in some important ways very, very different than what a formal court case would involve. Going to law school may not be an advantage - the lawyer-arbitrators I know have told me many of their fellow lawyers would make terrible arbitrators.If your client is a lawyer and has been an arbitrator himself, he has likely done whatever he could throughout his dealings with you to set up his side of things for success in a potential arbitration.Of course, some lawyers are not as smart as they think they are, so he might be what the English call \"clever\" rather than actually being smart. And the facts of the case in non-legalese might clearly work in your favor - this is what a good arbitrator will sort out for you.But if it's not worth your time and money to go through even a winning arbitration process,you might as well move on.And consider using hourly projects in the future. The client can limit their potential cost by limiting your allowable work time and you are experienced enough to give the client a reasonable expectation of work time required. Hourly clients have no way to force you to use arbitration to resolve their request for a refund, as you've seen can happen with fixed price contracts.Good luck!",
                "George P": "Thank you for the pertinent feedback here, Will.Up until now, I have never been involved with the arbitration process between me and a client here on Upwork for the past 3+ years.I'm sure client has done everything in his abilities toset himself up for success. Even though I think a rational, objective arbitrator would need to perform serious mental gymnastics to see & agree with his point of view.Now, it's definitely not worth my time and money to initiate an arbitration process myself. I over-delivered by measurable metrics and got paid. I would love to just move on, as you suggest, but seems I have no choice if the client decides to escalate into arbitration.Anyways - I do appreciate your advice and I think hourly contracts would provide more security moving forward.All the best!",
                "Tonya P": "Hi there everyone,I've never asked for advice from this community yet, but I've seen plenty of great answers from very knowledgeable people. I hope someone could provide some quality advice, as I truly would appreciate that.I tried not to be too lengthy here, but I also think this issue needs a bit of context.The issue that I currently face:I got contracted for $1,000 to do a Do-It-With-You consulting work package to help an insurance broker and ex. FINRA arbitrator ( the fact that he is an arbitrator is very relevant ) leverage LinkedIn as a platform, and learn to generate leads through a non-paid marketing approach.The job post & scope of work were as follows:**Edited for Community Guidelines**I delivered a 26-page guide + workbook, which also included the flow chart - and a total of 3.5hrs of 1-on-1 screen share video meetings vs. the 1HR agreed upon ( out of my generosity, because I truly believe in going above & beyond for my clients ), to make sure the set-up & consulting work will be concluded successfully.Client was seemingly happy when the work was done, the 2 funded milestones were approved & released at this stage, and I even offered BONUS support for another 14 days + a monthly check-in for the next 90 days to make sure the lead generation system I helped him set-up & coached on will work successfully for him.However, within 48hrs later, I wake up to an open dispute from this client, where he request a full refund because apparently, I have never done my job. He's an ex. FINRA arbitrator himself, and is trying very hard to reach and make his case.BUT not only did I over-deliver ( deliverables required + 3.5X more time than initially agreed upon ) - he's making false accusations ( which by the way blatantly contradict his own job post + our consulting time is video documented and proves his false claims ), he's also wanting to keep me responsible for things completely out of my control - such as a temporary hold on his account with the software tool I recommended ( most likely he did not follow the best practices recommended by me ), or the fact that he doesn't own anything.I DO NOT own that software company I recommended, I do NOT own & control LinkedIn's choices for client's profile either, and most marketing agencies & freelancers have built their entire business on other people's platforms. It was well communicated from the outset, yet he's trying to make his case for a refund with silly points like this.In this case - we couldn't get to an agreement in the mediation phase, and our mediation specialist suggests we escalate to arbitration.I know I'm 100% within the scope of work & I delivered successfully, client seems to have a very 'litigious' attitude & practices lots of legal threats and intimidation tactics - but by no means I want to waste my time & money on an arbitration process where I can still lose money, even if I win, due to the arbitration fees.My question, in this case, is - can I refuse the proposed agreements by our mediation specialist, and then also refuse to participate in the arbitration process? Or am I obligated to participate & pay arbitration fees if we did NOT reach a mutual agreement in the mediation phase?I'm 99.9% sure arbitration would go in my favor - however, I do not want to waste money & time on the process, and have my Upwork account on temporary hold until the issue is being solved - but I also can't let a 'bully' client use intimidation tactics to obtain a refund, in the eventuality of 0.01% he'd win the arbitration just because he used to be a FINRA arbitrator himself and may know the 'ins & outs' of winning cases that are not even favorable to him.I am NOT a lawyer or arbitrator, but I think we've all heard about judicial cases won not on true merit, but on the ability of the lawyers to get what they want. I'm thinking this client is an ex arbitrator and would be very persuasive to make his case - even though it would have to do impossible mental gymnastics in my opinion.Looking forward to hearing your opinions on what options am I looking at, and what course of action would you suggest in this scenario.Thanks a lot!GeorgeOnce mediation is unsuccessful, each party must decide whether they will invest in arbitration or walk away. If the client pays the fee for arbitration and you do not, your Upwork 'career' will be over. So, the question is more--do you wait to see if the client pays for arbitration or put up the money yourself first and see if the client will also?It seems like you over-delivered in an effort to provide good service to a bad client. They have taken your knowledge and now don't wish to pay because you can't make them popular on LI.🙄Look at your writtenor recorded communications. This is what can be most easily proven and defended. Pre-contractual negotiations are what is relevant when it comes to offer and acceptance. What was the actual bargain struck? Evaluate just the facts one by one. What did you promise, what was delivered. After you've done that, you'll be better able to decide whether you want to invest in arbitration."
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/New-to-Upwork/Profile-Picture-Not-Approved/m-p/861582#M126970": {
            "title": "Re: Profile Picture Not Approved",
            "post_date": "Jan 20, 2021  03:06:24 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Tyra I": [
                    "/t5/user/viewprofilepage/user-id/7300580",
                    "Jan 20, 2021"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ]
            },
            "messages": {
                "Tyra I": "My profile photo can't be approved. I have tried clearing cache and uploading different photos.However, I am pretty sure that it isn't approved because of my glasses?Is there any way I can get my photo approved.",
                "Bojan S": "Hi Tyra,Please try to resize the image to 250x250dpi and crop it to include only your head and shoulders. Let us know if you have any other questions.Thank you!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/New-to-Upwork/How-can-I-know-that-my-profile-is-approved/m-p/861581#M126969": {
            "title": "Re: Account Activation",
            "post_date": "Jan 20, 2021  03:05:01 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Nikola S": [
                    "/t5/user/viewprofilepage/user-id/6019505",
                    "Jul 2, 2020"
                ],
                "Skerdi K": [
                    "/t5/user/viewprofilepage/user-id/7300495",
                    "Jan 20, 2021"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ]
            },
            "messages": {
                "Nikola S": "HiKerem,Thank you for reaching out to us. I checkedand can confirm that your profile is alreadyapproved. Welcometo Upwork. For help getting started, check our Freelancer Guide. It covers everything from finding great projects that fit your skills to increasing your rate and getting stellar feedback.",
                "Skerdi K": "Is my profile approved?",
                "Bojan S": "HiSkerdi,Your account has been accepted. To help you get started, please check out these threads Getting Started on Upwork and Resource Corner. There you’ll find some excellent topics and learn more about Upwork.Good luck and happy working!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/New-to-Upwork/Bank-account/m-p/861580#M126968": {
            "title": "Re: Bank account",
            "post_date": "Jan 20, 2021  03:04:14 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Felicitas K": [
                    "/t5/user/viewprofilepage/user-id/7300519",
                    "Jan 20, 2021"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ]
            },
            "messages": {
                "Felicitas K": "I have not received the two amounts to my bank account to confirm my account.",
                "Bojan S": "HiFelicitas,Please note that once you add your bank account information it can take 3-5 days for the deposits to show up in your bank account.Thank you!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Identity-Verified-badge-soon-required-for-all-earning/m-p/861579#M56027": {
            "title": "Re: Identity Verification",
            "post_date": "Jan 20, 2021  03:02:13 PM",
            "edit_date": "May 29, 2020  04:40:20 AM",
            "contributors": {
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Jose Mari C": [
                    "/t5/user/viewprofilepage/user-id/5718582",
                    "May 23, 2020"
                ],
                "Ellijen Fenella C": [
                    "/t5/user/viewprofilepage/user-id/4133380",
                    "Aug 5, 2019"
                ],
                "Elijah M": [
                    "/t5/user/viewprofilepage/user-id/5999612",
                    "Jun 30, 2020"
                ],
                "Miryam N": [
                    "/t5/user/viewprofilepage/user-id/6891769",
                    "Nov 17, 2020"
                ],
                "Saidul I": [
                    "/t5/user/viewprofilepage/user-id/4550595",
                    "Oct 30, 2019"
                ],
                "Ashok B": [
                    "/t5/user/viewprofilepage/user-id/4905345",
                    "Jan 16, 2020"
                ]
            },
            "messages": {
                "Bojan S": "Hi Adrian,Feel free to upload the main side of your ID that have your name on it. If our team needs any additional information, they will reach out to you directly and guide you further thought this process.Make sure not tocrop, rotate, touch up, adjust colors, or alter the images in any way.Thank you!",
                "Jose Mari C": "Can someone help me regarding my status here on Upwork? I spoke to a Customer Support yesterday here on Upwork and he already approved my ID document verification and Visual verification. But when I checked my account a while ago, I was shocked that ID document verification is on review again. Though I saw yesterday that it was successfully completed already.",
                "Ellijen Fenella C": "Hi! Im new to Upwork and I've been trying to upload my gov't-issued ID for the Identity verification but the system has been down for the most part today. Im given until the 20th to verify. What shoud I do? I'd greatly appreciate a reply. Thanks!",
                "Elijah M": "Hi, BojanIt doesn't still happen. Always the Upwork Help page showed.I clicked the My Request list, but that page redirected and went to the Upwork Help page.",
                "Miryam N": "Hi, it has just been solved!I tried another time and when the help support page pops up you have to stay there and a chat window will appear and an agent will start talking to you then redirect you to a google meet room to verify your IDHope it helps !",
                "Saidul I": "",
                "Ashok B": "NO"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/New-to-Upwork/My-company-needs-W9-from-Upwork-for-the-money-we-have-paid-to/m-p/861578#M126967": {
            "title": "Re: My company needs W9 from Upwork for the money we have paid to Upwork",
            "post_date": "Jan 20, 2021  03:01:43 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Shirley Y": [
                    "/t5/user/viewprofilepage/user-id/7300903",
                    "Jan 20, 2021"
                ]
            },
            "messages": {
                "Shirley Y": "Hello,We also need a W9 for services that we're paying for. Is this something you can help with?Thanks!Shirley"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/How-to-Delete-Account/m-p/861577#M531267": {
            "title": "Re: Hi Shahzad, If you close",
            "post_date": "Jan 20, 2021  02:58:50 PM",
            "edit_date": "May 16, 2016  09:44:38 AM",
            "contributors": {
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Danita W": [
                    "/t5/user/viewprofilepage/user-id/7300889",
                    "Jan 20, 2021"
                ],
                "Youcef B": [
                    "/t5/user/viewprofilepage/user-id/14378",
                    "Nov 23, 2014"
                ],
                "Robert L": [
                    "/t5/user/viewprofilepage/user-id/83578",
                    "Apr 10, 2016"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Ashok S": [
                    "/t5/user/viewprofilepage/user-id/91261",
                    "May 10, 2016"
                ],
                "Vandana E": [
                    "/t5/user/viewprofilepage/user-id/217228",
                    "Oct 21, 2016"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Lyn M": [
                    "/t5/user/viewprofilepage/user-id/3625502",
                    "Apr 21, 2019"
                ]
            },
            "messages": {
                "Goran V": "Hi Nikunj,Your account is now closed, thank you.",
                "Danita W": "I would like to close my account.",
                "Youcef B": "Deleting my Odesk Account",
                "Robert L": "I wonder HOW you did that??I have never worked on such a lousy interface/ dashboard!!",
                "Valeria K": "Hi Robert,I am sorry you are having troubles using Upwork. Please, let us or customer support know if you need help with anything. If you wish to close your account you should find this linkin Settings> My Info.",
                "Ashok S": "Since a week. I am unable to delete my upwork account.getting message :Thank you for using Upwork.At this time we are unable to close your account. You have one or more open proposals. Please visit your Proposalspage and close your proposals.Please note: For security purposes, you will not be able to change your username, or open a new account with the same email address.Please delete it. ITS: **Edited for Community Guidelines**",
                "Vandana E": "Valerie,I want to delete my account as I have a job now,Kindly guide me.Regards,Vandana.",
                "Vladimir G": "HiVandana,Congrats on your new job. Please note that you can set yourself as unavailable and don't have to close your account. If you still wish to proceed with closing your account, please go to Settings > click the Close My Account link on the right side of the page.",
                "Lyn M": "I want to delete my accountMy email is:.**Edited for Community Guidelines**"
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/Freelancers/Access-denied-for-every-post-I-try-to-view/m-p/861576#M531266": {
            "title": "Re: Access denied for every post I try to view",
            "post_date": "Jan 20, 2021  02:55:55 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Olawale Abdullatee A": [
                    "/t5/user/viewprofilepage/user-id/6958529",
                    "Nov 26, 2020"
                ],
                "Caleb A": [
                    "/t5/user/viewprofilepage/user-id/7296539",
                    "Jan 20, 2021"
                ]
            },
            "messages": {
                "Goran V": "Thank you for the confirmation, Alice.One of our team members will reach out to you via ticket as soon as possible and assist you further with your account.",
                "Olawale Abdullatee A": "",
                "Caleb A": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Device-Authorization-Issue/m-p/861575#M531265": {
            "title": "Re: Device Authorization Issue",
            "post_date": "Jan 20, 2021  02:54:10 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Jehanzeb S": [
                    "/t5/user/viewprofilepage/user-id/5769369",
                    "May 30, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Jehanzeb S": "HiI cannot open my settings or withdraw any amount from my Upwork account.. Can anyone assist with the possible solution?Much appreciated.BR.",
                "Andrea G": "HiJehanzeb,It looks like you've added an extra layer of security to your account by setting up an authenticator app to confirm that it's you. Please use the code from the app you downloaded when setting this up. If you need any further assistance please let us know!Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Device-Authorization-Issue/m-p/861574#M531264": {
            "title": "Re: Device Authorization Issue",
            "post_date": "Jan 20, 2021  02:52:27 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Jehanzeb S": [
                    "/t5/user/viewprofilepage/user-id/5769369",
                    "May 30, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Jehanzeb S": "HiI cannot open my settings or withdraw any amount from my Upwork account.. Can anyone assist with the possible solution?Much appreciated.BR.",
                "Andrea G": "HiJehanzeb,It looks like you've added an extra layer of security to your account by setting up an authenticator app to confirm that it's you. Please use the code from the app you downloaded when setting this up. If you need any further assistance please let us know!Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/removing-an-attachment-on-an-archived-proposal/m-p/861573#M531263": {
            "title": "Re: removing an attachment on an archived proposal",
            "post_date": "Jan 20, 2021  02:48:59 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Eddie R": [
                    "/t5/user/viewprofilepage/user-id/7300551",
                    "Jan 20, 2021"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ]
            },
            "messages": {
                "Eddie R": "I have an attachment on an archived proposal that I would no longer like to be available--can you remove it please?I can send you the information as needed rather than post it here.Thank you,Eddie",
                "Preston H": "If I understand you correctly... are you saying you want to remove an attachment from a proposal that you sent to a potential client?If you sent a proposal, then any attachments you sent were part of your proposal sent to a potential client, n an attempt to get hired for a specific job.The proposal and the attachment belong to the client that you sent them to. You can't edit them."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/New-to-Upwork/UPWORK-SHOWING-OLD-MESSAGES/m-p/861572#M126966": {
            "title": "Re: bug",
            "post_date": "Jan 20, 2021  02:47:52 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Ismail J": [
                    "/t5/user/viewprofilepage/user-id/7288004",
                    "Jan 19, 2021"
                ]
            },
            "messages": {
                "Andrea G": "HiIsmail,Could you please try clearing your cache and cookies or logging in using a different browser to see if the issue persists?Thanks!",
                "Ismail J": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/removing-an-attachment-on-an-archived-proposal/m-p/861571#M531261": {
            "title": "Re: removing an attachment on an archived proposal",
            "post_date": "Jan 20, 2021  02:34:39 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Eddie R": [
                    "/t5/user/viewprofilepage/user-id/7300551",
                    "Jan 20, 2021"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ]
            },
            "messages": {
                "Eddie R": "I have an attachment on an archived proposal that I would no longer like to be available--can you remove it please?I can send you the information as needed rather than post it here.Thank you,Eddie",
                "Preston H": "If I understand you correctly... are you saying you want to remove an attachment from a proposal that you sent to a potential client?If you sent a proposal, then any attachments you sent were part of your proposal sent to a potential client, n an attempt to get hired for a specific job.The proposal and the attachment belong to the client that you sent them to. You can't edit them."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/A-test-they-say/m-p/861570#M531260": {
            "title": "Re: A test they say ?!",
            "post_date": "Jan 20, 2021  02:28:54 PM",
            "edit_date": "Jan 20, 2021  02:30:03 PM",
            "contributors": {
                "Will L": [
                    "/t5/user/viewprofilepage/user-id/40642",
                    "Jul 9, 2015"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Deborah P": [
                    "/t5/user/viewprofilepage/user-id/4679463",
                    "Nov 24, 2019"
                ],
                "Wahiba A": [
                    "/t5/user/viewprofilepage/user-id/7128673",
                    "Dec 25, 2020"
                ]
            },
            "messages": {
                "Will L": "Deborah P.,I can't think of anything stranger in Upwork's rules than allowing clients to add milestones to active contracts without the agreement of the freelancer.It is a recipe for abuse by a certain type of client.It is also contrary to the whole concept of what a \"contract\" between two parties should be.",
                "Vladimir G": "Hi Deborah,I'm sorry to hear about your experience on the contract in question. Please note that afreelancer isn't required to work on Milestones they didn't agree to as outlined in thesection 2 of theOptional Service Contract Terms. The client needs to get freelancer's consent before adding a new Milestone. If the freelancer doesn't accept the added Milestone they can reject it by terminating the contract.I'll forward your feedback to our team, feel free to follow up if you need further assistance.",
                "Deborah P": "Hi Deborah,I'm sorry to hear about your experience on the contract in question. Please note that afreelancer isn't required to work on Milestones they didn't agree to as outlined in thesection 2 of theOptional Service Contract Terms. The client needs to get freelancer's consent before adding a new Milestone. If the freelancer doesn't accept the added Milestone they can reject it by terminating the contract.I'll forward your feedback to our team, feel free to follow up if you need further assistance.Hello Vladimir, thanks for coming back. Something weird happened: the contract has been put on hold for about 12 hours, then it has been reactivated and the milestone with the instructions conflicting with TOS and that were never agreed with me is still there as it was, as nothing happened. The client has created a new misleading job post, same as the previous one that had been cancelled. He is operating as if nothing happened. I therefore reported his message including the illegal instructions for the 2nd milestone.Has something been lost during the process?",
                "Wahiba A": "Thank you Vladimir for your professionalism and your responsiveness, appreciate it "
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/ID-Verification/m-p/861569#M531259": {
            "title": "Re: ID Verification",
            "post_date": "Jan 20, 2021  02:28:27 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Abdelrahman E": [
                    "/t5/user/viewprofilepage/user-id/7298789",
                    "Jan 20, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Tzvetomir T": [
                    "/t5/user/viewprofilepage/user-id/6730433",
                    "Oct 21, 2020"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Ankur K": [
                    "/t5/user/viewprofilepage/user-id/3220722",
                    "Jan 26, 2019"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Margaret Marie Z": [
                    "/t5/user/viewprofilepage/user-id/4264110",
                    "Aug 31, 2019"
                ],
                "Julian Esteban P": [
                    "/t5/user/viewprofilepage/user-id/5256533",
                    "Mar 23, 2020"
                ]
            },
            "messages": {
                "Abdelrahman E": "HiI had an account in Upwork and it has suspended and it was verified and I open a new one so I need to close the suspended account and verify my new account, please contact me soon",
                "Andrea G": "HiAbdelrahman,",
                "Tzvetomir T": "",
                "Goran V": "HiTzvetomir,To complete your pending verification go to Settings > Identity Verification and click on the green button on your end. Thank you.",
                "Ankur K": "Hello, Dear Avery ..!Yesterday, I creatd my upwork account as a freelancerI came from India to study in university of Italy.I have the italian Residence permit, visa and Indian Passport.Using these documents I am going to complete the id verfication when you want.Is it possible for me to complete the verification?If you kindly tell me about it, I will be pleased to know this information.I am a newbie on this platform and request you to kindly help me. I have heard about Upwork.com from my friends and I have good skills in web development.Duly, I want to work on this platform.Please help meYours thankfullyAnkur Kumar",
                "Bojan S": "HiAnkur,I checked and it doesn't look like you are required to completeany verification process at the moment. The team will let you know if there is a need for any verification process in the future. You can check this help article for more information about Verification processes on Upwork and required document for those.Thank you.",
                "Margaret Marie Z": "I'm having trouble uploading my dl ID it says the name does not match my profile and it does. Now its locked me out and I need to speak to customer service. Ahhhhhhhhhhhh!",
                "Julian Esteban P": "I am from Colombia. I have some troubles in approving my ID card. They always say 'We're reviewing your documents and will get back to you within 1 business day' and after a few hours, I need to upload ID card again.(I think I am failed)I have tried several times but no result yet. The front side of my ID card has no date but back side has got it. Is this problem? Please help me."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Device-Authorization-Issue/m-p/861568#M531258": {
            "title": "Re: Device Authorization Issue",
            "post_date": "Jan 20, 2021  02:25:45 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Jehanzeb S": [
                    "/t5/user/viewprofilepage/user-id/5769369",
                    "May 30, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Jehanzeb S": "HiI cannot open my settings or withdraw any amount from my Upwork account.. Can anyone assist with the possible solution?Much appreciated.BR.",
                "Andrea G": "HiJehanzeb,It looks like you've added an extra layer of security to your account by setting up an authenticator app to confirm that it's you. Please use the code from the app you downloaded when setting this up. If you need any further assistance please let us know!Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Identity-Verified-badge-soon-required-for-all-earning/m-p/861567#M56025": {
            "title": "Re: Identity Verified badge soon required for all earning freelancers",
            "post_date": "Jan 20, 2021  02:25:26 PM",
            "edit_date": "Jun 19, 2019  05:19:50 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Swaraj M": [
                    "/t5/user/viewprofilepage/user-id/100570",
                    "Jul 18, 2016"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Akif A": [
                    "/t5/user/viewprofilepage/user-id/6061644",
                    "Jul 8, 2020"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "GEOFFREY P": [
                    "/t5/user/viewprofilepage/user-id/7300485",
                    "Jan 20, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Michael C": [
                    "/t5/user/viewprofilepage/user-id/5040301",
                    "Feb 12, 2020"
                ]
            },
            "messages": {
                "Lena E": "Earlier this year we launched the Identity Verified badge which we expanded to all earning freelancers. We have a professional marketplace of freelancers and this badge is designed to instill confidence in clients that freelancers here on Upwork are who they say they are. To date, more than 44,000 freelancers have received their ID Verified badge, helping them to build trust with clients.As part of our commitment to maintaining a professional online global freelance marketplace that is safe and fraud-free, we’re requiring every earning freelancer on Upwork to verify their identity to get the badge. This will be rolled out in a phased approach to enable a seamless experience for our freelancers. We will begin requiring the Identity Verified badge for newly earning freelancers in July and start rolling out to existing freelancers starting in August.We’re letting freelancers know now, to give them ample time to review the process and obtain the necessary documents. Those who already have the option to be verified don’t have to wait to complete their verification. They can go ahead and get the badge now by going to User Settings > Identity Verification. Identity Verification process:Freelancers receive the Identity Verification badge after completing a two-part verification process. We’ve improved the process so that freelancers are generally able to complete their verification within 10 minutes, though in some cases it can take up to 1-2 days. To get the badge, eligible freelancers have to successfully pass two stages:Depending on the freelancers’ location and what country they’re from, we ask for the following types of government ID:Access to your information is reserved exclusively for Upwork agents who have passed strict background checks and our third party vendor’s automated checks. Clients can see that you have undergone the verification process from the badge only. What to expectFreelancers will be notified via email and shown an in-product message when they’re required to complete their identity verification. At that time they will have seven days to complete the process, after which they cannot submit proposals and withdraw earnings until they’ve verified. This process will not affect active contracts. Verifying identities is just one part of our efforts to maintain trust within our community. As the landscape evolves, we adapt our methods to stay one step ahead. This also means that we may periodically ask freelancers to reverify their identity to ensure the validity of their accounts.We appreciate all the feedback and issues that have been shared in the forums so that we can quickly improve and implement this process. If you have any questions, please share here! ",
                "Swaraj M": "LOL Tried uploading a clear scanned face and back of my passport - \"...picture may be too blurry\".Tried uploading my clear scanned green card - \"...picture may be too blurry\".Tried uploading a clear scanned Voter's ID - \"...picture may be too blurry\".Uploaded the same to my PayPal account (since it's required by law) and works within a few.",
                "Avery O": "Hi Swaraj,I'm sorry to learn about your experience when you were trying to upload your IDs for verification. I can see that the team has reached out to you through Ticket #25855521, and has shared why the system is unable to accept your ID for verification. Kindly refer to the ticket for more information on what IDs you can use for verification. If you have other questions, feel free to update the same ticket thread and the team will assist you further.",
                "Akif A": "Hi Avery ID Verification is ok. I cannot do Visual Verification. Not working.",
                "Aleksandar D": "Hi Akif,I'm sorry to hear about that. Could you please let us know if you are getting an error message while trying to do the verification?Thank you.",
                "GEOFFREY P": "Having same issue and will not allow me to go into Verification portion says im locked out?",
                "Andrea G": "HiGeoffrey,Someone from our team will reach out to you via support ticket in order to assist you further.Thanks!",
                "Michael C": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Device-Authorization-Issue/m-p/861566#M531257": {
            "title": "Re: Device Authorization Issue",
            "post_date": "Jan 20, 2021  02:22:50 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Jehanzeb S": [
                    "/t5/user/viewprofilepage/user-id/5769369",
                    "May 30, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Jehanzeb S": "HiI cannot open my settings or withdraw any amount from my Upwork account.. Can anyone assist with the possible solution?Much appreciated.BR.",
                "Andrea G": "HiJehanzeb,It looks like you've added an extra layer of security to your account by setting up an authenticator app to confirm that it's you. Please use the code from the app you downloaded when setting this up. If you need any further assistance please let us know!Thanks!"
            },
            "moderated": false
        }
    },
    "https://community.upwork.com/t5/Announcements/bd-p/news": {
        "https://community.upwork.com/t5/Announcements/Welcome-to-the-Upwork-Community/td-p/1": {
            "title": "Welcome to the Upwork Community!",
            "post_date": "Oct 29, 2014  11:55:27 AM",
            "edit_date": "Jun 20, 2018  10:10:25 AM",
            "contributors": {
                "Garnor M": [
                    "/t5/user/viewprofilepage/user-id/7",
                    "Oct 28, 2014"
                ],
                "Ray C": [
                    "/t5/user/viewprofilepage/user-id/699",
                    "Apr 10, 2009"
                ],
                "SOBUZ H": [
                    "/t5/user/viewprofilepage/user-id/21990",
                    "Mar 19, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Umair M": [
                    "/t5/user/viewprofilepage/user-id/22381",
                    "Mar 24, 2015"
                ],
                "Rogers K": [
                    "/t5/user/viewprofilepage/user-id/83215",
                    "Apr 7, 2016"
                ],
                "Sami S": [
                    "/t5/user/viewprofilepage/user-id/23611",
                    "Apr 14, 2015"
                ],
                "Karen H": [
                    "/t5/user/viewprofilepage/user-id/46658",
                    "Aug 25, 2015"
                ],
                "Ram P": [
                    "/t5/user/viewprofilepage/user-id/25390",
                    "May 5, 2015"
                ]
            },
            "messages": {
                "Garnor M": "Welcome to the Upwork Community! This is the place to learn and connect with others who love the way they work. You'll also find a wealth of resources and knowledge to get the most out of Upwork, whether you're a client, freelancer or just visiting.We know there's a lot here, so we've created this brief guide to help you find the information you're looking for, and to clarify where you should post your questions.Before posting:Join the conversation:Discussion Forums:You can find a listing of our discussion categories on the Community home page. We invite you to read and participate in any of the threads available on our forums. Starting or joining a conversation is as simple as clicking \"New Message\" or \"Reply.\"Official Upwork: Stay up to date on all things UpworkAnnouncements - Product announcements and company news from Upwork.Community Discussions: Kick off a conversation with the CommunityFreelancers - Discussions about freelancing and Upwork features, policiesandquestions related tofreelancing on the Upwork platform.Clients - Discussions about hiring and managing work as a client and Upwork features, policies and questions related to hiring as a client on the Upwork platform.Coffee Break - Open conversations unrelated to Upwork.Job Skill Discussions: Have something to share for others in your \"world?\" Join for conversations about topics in your field.Groups: Groups are spaces for more targeted conversations (regional groups, customer events). Groups feature a forum-style conversation, a membership and invitation system and the standard community features like Kudos and Subscriptions.Groups can be either open or closed. All groups require users to be a community member before joining, but for a closed group, a community member must be approved by a Group Admin before gaining access to the group.Interested in participating? Click \"Join Group\" (for an open group) or \"Ask to Join Group\" (for a closed group) to get started.If you still aren't sure where to post:If you have any questions or suggestions, don't hesitate to leave us comments below.Thanks!",
                "Ray C": "What is Lithium and why is it asking for my password when I click \"Forum\" from my oDesk page?",
                "SOBUZ H": "Hi,I'm new to odesk. My profile is 100% completed. But my account has been suspended.Please tell me what i should do for this.",
                "Valeria K": "Hi Sobuz,I have followed up with the Team about your profile review and they will get back to you as soon as possible. Meanwhile, I would recommend you not use all capital letters in your profile name and only capitalize first letters.Thank you!",
                "Umair M": "hi,i have same problem, i have complete my profile but when i press resubmit, then appears an error that you cannot create or submit your profile",
                "Rogers K": "Hello Umair,Had the same problem, what you do check upwork support team sent you a message in your inbox, read the text then reply to that very text accordingly. Make sure that you include what was indentified missing on your profile.RegardsRogers",
                "Sami S": "Respected Ma'am,As I am new here, and i have completed my profile and its gone for reviewing since last week and still i have not got my confirmation. Please review my profile as soon as possible as I am curious to start working here.Thankyou!Abdul Sami.",
                "Karen H": "HI,I'm trying to get registered, but am having a hard time turning my driver's license and recent bill into a JPEG instead of a PDF. Is there any other way to submit this information so that I can complete registration?Thank you,Karen",
                "Ram P": "Hi, Valeria KPlz. help me to find new job in odeskthis is a hubmly request to you.......Thanks You"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Upwork-Community-Guidelines/td-p/3": {
            "title": "Upwork Community Guidelines",
            "post_date": "Oct 29, 2014  02:50:36 PM",
            "edit_date": "Jul 30, 2018  06:22:09 PM",
            "contributors": {},
            "messages": {},
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Identity-Verified-badge-soon-required-for-all-earning/td-p/609136": {
            "title": "Identity Verified badge soon required for all earning freelancers",
            "post_date": "Jun 19, 2019  11:46:36 AM",
            "edit_date": "Jun 19, 2019  05:19:50 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Swaraj M": [
                    "/t5/user/viewprofilepage/user-id/100570",
                    "Jul 18, 2016"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Akif A": [
                    "/t5/user/viewprofilepage/user-id/6061644",
                    "Jul 8, 2020"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "GEOFFREY P": [
                    "/t5/user/viewprofilepage/user-id/7300485",
                    "Jan 20, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Michael C": [
                    "/t5/user/viewprofilepage/user-id/5040301",
                    "Feb 12, 2020"
                ]
            },
            "messages": {
                "Lena E": "Earlier this year we launched the Identity Verified badge which we expanded to all earning freelancers. We have a professional marketplace of freelancers and this badge is designed to instill confidence in clients that freelancers here on Upwork are who they say they are. To date, more than 44,000 freelancers have received their ID Verified badge, helping them to build trust with clients.As part of our commitment to maintaining a professional online global freelance marketplace that is safe and fraud-free, we’re requiring every earning freelancer on Upwork to verify their identity to get the badge. This will be rolled out in a phased approach to enable a seamless experience for our freelancers. We will begin requiring the Identity Verified badge for newly earning freelancers in July and start rolling out to existing freelancers starting in August.We’re letting freelancers know now, to give them ample time to review the process and obtain the necessary documents. Those who already have the option to be verified don’t have to wait to complete their verification. They can go ahead and get the badge now by going to User Settings > Identity Verification. Identity Verification process:Freelancers receive the Identity Verification badge after completing a two-part verification process. We’ve improved the process so that freelancers are generally able to complete their verification within 10 minutes, though in some cases it can take up to 1-2 days. To get the badge, eligible freelancers have to successfully pass two stages:Depending on the freelancers’ location and what country they’re from, we ask for the following types of government ID:Access to your information is reserved exclusively for Upwork agents who have passed strict background checks and our third party vendor’s automated checks. Clients can see that you have undergone the verification process from the badge only. What to expectFreelancers will be notified via email and shown an in-product message when they’re required to complete their identity verification. At that time they will have seven days to complete the process, after which they cannot submit proposals and withdraw earnings until they’ve verified. This process will not affect active contracts. Verifying identities is just one part of our efforts to maintain trust within our community. As the landscape evolves, we adapt our methods to stay one step ahead. This also means that we may periodically ask freelancers to reverify their identity to ensure the validity of their accounts.We appreciate all the feedback and issues that have been shared in the forums so that we can quickly improve and implement this process. If you have any questions, please share here! ",
                "Swaraj M": "LOL Tried uploading a clear scanned face and back of my passport - \"...picture may be too blurry\".Tried uploading my clear scanned green card - \"...picture may be too blurry\".Tried uploading a clear scanned Voter's ID - \"...picture may be too blurry\".Uploaded the same to my PayPal account (since it's required by law) and works within a few.",
                "Avery O": "Hi Swaraj,I'm sorry to learn about your experience when you were trying to upload your IDs for verification. I can see that the team has reached out to you through Ticket #25855521, and has shared why the system is unable to accept your ID for verification. Kindly refer to the ticket for more information on what IDs you can use for verification. If you have other questions, feel free to update the same ticket thread and the team will assist you further.",
                "Akif A": "Hi Avery ID Verification is ok. I cannot do Visual Verification. Not working.",
                "Aleksandar D": "Hi Akif,I'm sorry to hear about that. Could you please let us know if you are getting an error message while trying to do the verification?Thank you.",
                "GEOFFREY P": "Having same issue and will not allow me to go into Verification portion says im locked out?",
                "Andrea G": "HiGeoffrey,Someone from our team will reach out to you via support ticket in order to assist you further.Thanks!",
                "Michael C": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Location-Selection-Expanding-to-UK-Clients/td-p/520548": {
            "title": "Location Selection Expanding to UK Clients",
            "post_date": "Sep 6, 2018  07:11:47 AM",
            "edit_date": "Sep 6, 2018  09:50:43 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Arsalan A": [
                    "/t5/user/viewprofilepage/user-id/60887",
                    "Oct 1, 2015"
                ],
                "Joanne Marie P": [
                    "/t5/user/viewprofilepage/user-id/1440201",
                    "Nov 26, 2017"
                ],
                "Gosia B": [
                    "/t5/user/viewprofilepage/user-id/6587219",
                    "Sep 25, 2020"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ]
            },
            "messages": {
                "Lena E": "We are excited to announce that next week we are expanding our location selection features to now include clients in the United Kingdom. Last year, we rolled out a set of location features in the U.S. that allowed clients who are interested in only hiring freelancers within their country the ability to set their freelancer search and job post accordingly. We found that giving clients this additional option brought in more new clients without taking away opportunities from our global community (freelancers’ earnings all over are growing steadily). Because this functionality was well-received by our clients and freelancers in the U.S., we’ve decided to build them out in the U.K. as well. New clients in the United Kingdom (England, Scotland, Wales, and Northern Ireland), will now be able to post jobs targeted to freelancers in the U.K. Clients in U.K, here’s how it’ll work: U.K. clients who prefer to hire within their country will have the option of setting their freelancer search and job post visibility to freelancers in the U.K. only. And, only freelancers with a U.K. location in their profile will see these jobs and if verified, will be able to submit proposals for them. Clients can always change their mind or choose to invite a freelancer outside of the U.K. to these job posts.Freelancers in U.K., what this means for you:You’ll start seeing jobs with a U.K. location requirementOn your job search, you’ll be able to filter for jobs with this requirement. These jobs will show up in your results, indicated like this:You may be asked to verify your location the first time you submit a proposal for a project with a location requirement. Your city is now displayed on your profile to U.K. clientsOn profiles, your location will now be listed as a city instead of a country. A map will also display pointing to the center of the city. Let us know if you have any questions.",
                "Petra R": "We are excited to announce that next week we are expanding our location selection features to now include clients in the United Kingdom. Guess what? I am not \"excited!\"I won't outline my feelings about this, as I fail to find polite words.I assume the heavy handed, deliberately and willingly discriminatory practice of making it the default with no true choice will also be included just as it is for US clients?Apparently this is no longer the case, so the above is no longer valid. Thanks for clarifying Valeria! (Maybe best to delete these 4 posts to not confuse others with my outdated outrage  )",
                "Valeria K": "Hi Petra, I suspect your clients were referring to an older version of the job posting flow. The job post flow was updated several months ago when we were updating our site to become mobile friendly. Please, see this thread and screenshots Preston posted of the options shown to US clients.",
                "Arsalan A": "It seems to old post, But can anyone do for search engine location only for pakistan clients for me please?",
                "Joanne Marie P": "Hi Arsalan,If you're referring to location selection for jobs posted, this is currently being offered to US and UK jobs.We recognize that sometimes clients need a freelancer located in the same country. Their projects may require localized knowledge, the possibility of on-site coordination, specific compliance needs, or other factors that make working with someone within their country an easier way to get started on Upwork.We currently support some level of location filtering for all clients by specifying their requirements in the job description and/or setting location as Preferred Qualification, but freelancers from outside the country may still submit proposals.",
                "Gosia B": "HI there!May I ask why I need a British Passport to be able to apply for jobs? The majority of foreigners live in the UK without a British Passport. I've got a Polish passport and the Indefinite Leave to Remain in UK and frankly right now having a British Passport isn't of much use when travelling as quite a few countries hold restrictions on people travelling from the UK, not to mention the ones actually having British passport. The fact that I don't have one shouldn't be a thing disqualifying me from applying for any job/project through your site as I have lived in London for almost 12 years and I have never had the need or the want for a British passport.",
                "Vladimir G": "Hi Gosia,I understand your concern but would like to clarify that you cancomplete the verification processeven if you don'thave a UK passport. Please submit a UK driving licence instead or do follow up here if you don't have a license and we'll assist you further."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Frequently-Asked-Questions-on-TOS-changes-regarding-information/td-p/756278": {
            "title": "Frequently Asked Questions on TOS changes regarding information sharing and interviews",
            "post_date": "May 28, 2020  10:35:34 AM",
            "edit_date": "Jun 4, 2020  02:37:41 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Jay D": [
                    "/t5/user/viewprofilepage/user-id/5468252",
                    "Apr 19, 2020"
                ],
                "Alex T": [
                    "/t5/user/viewprofilepage/user-id/1415856",
                    "Nov 19, 2017"
                ],
                "Adam P": [
                    "/t5/user/viewprofilepage/user-id/40069",
                    "Jul 3, 2015"
                ],
                "Andrei H": [
                    "/t5/user/viewprofilepage/user-id/666026",
                    "May 1, 2017"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Nichola L": [
                    "/t5/user/viewprofilepage/user-id/21621",
                    "Mar 13, 2015"
                ],
                "Maria T": [
                    "/t5/user/viewprofilepage/user-id/65903",
                    "Nov 12, 2015"
                ]
            },
            "messages": {
                "Lena E": "As noted in our original postwe are making changes to our Terms of Service (TOS) regarding communicating on and outside of Upwork.We understand that not sharing contact information prior to starting a contract is a very real change for how both freelancers and clients use the Upwork platform. Many of you in the Community have shared your concerns in our previous thread which amassed a significant amount of comments burying many of your questions and our replies.We have created this thread to better highlight and answer your specific questions. We are actively exploring opportunities to improve our product features, tools, communications, and education to better meet user needs.UPDATE 6/4/20:On May 26, 2020, we announced upcoming changes to our Terms of Service that will require users to conduct all pre-contract conversations through the Upwork platform.We understand that many of you have questions and concerns about this change, and we want to let you know we have heard you. We also want to clarify the new requirements, which will go into effect on June 26.We know at times it is necessary for a freelancer or client to provide an email address so the other party can gain access to critical systems (for example, an ad analytics account, code repository, etc.). This access allows a freelancer to review a project prior to a contract so they can determine if they have the needed skills, how many hours it will take, etc.Because the Terms of Service changes are about preventing off-platform communication (rather than blocking freelancers from reviewing projects in advance), we are making the following exception:Users may share email addresses for the sole purpose of providing access to a system that contains information about the project. If the system can be accessed without sharing an email address (such as via a link), it should be shared that way.If an email address is provided, it should not be used for any communications, including discussions about the project, until a contract is in place. Off-platform communication creates a risk of scam, fraud, other harmful behaviors, and can lead to circumvention, which is a violation of our Terms of Service.As always, email addresses cannot be requested or shared in a profile, proposal, invite, or job post.For more information, please see:Other helpful articles:",
                "Jay D": "I have asked this on previous threads but must have been missed.Sometimes just a screenshare isn't enough. We need to give/gain access (mouse/keyboard control) to the other person like TemViewer / AnyDesk does, so that we/they can perform some actions on the other device - a use case would be to ask a freelancer to demonstrate that they have understood the process and can operate a private software as required. Having an access would be unavoidable in such case - a screen sharing is not enough!",
                "Alex T": "Ok old thread closed. Now we have a new on. So now we need to duplicate all 100 pages of questions here? I left couple of questions in the closed thread. What to do?",
                "Adam P": "",
                "Andrei H": "",
                "Vladimir G": "HiAndrei,Thanks for your question. In case of existing clients, you may use any communication methods you choose to discuss new engagements. However, when communications (and work) stay on our platform we can better track, verify, and help address any issues that emerge.",
                "Nichola L": "My impression was that Maria was not asking for specific information. I think we would all like to know how it is - given assurances of privacy - that someone is allowed to enter stealthily into a chat room. The link does not appear to cover that, or if it does, I have missed it.Of course if you are not allowed to answer the question about stealth visits in general terms, then there is no more to be said. Just one more doubt to add to the debit column.",
                "Maria T": "My impression was that Maria was not asking for specific information. I think we would all like to know how it is - given assurances of privacy - that someone is allowed to enter stealthily into a chat room. The link does not appear to cover that, or if it does, I have missed it.Of course if you are not allowed to answer the question about stealth visits in general terms, then there is no more to be said. Just one more doubt to add to the debit column.Thanks for the clarification of my comment Nichola!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Goodbye-beta-hello-Project-Catalog-now-available-globally/td-p/858605": {
            "title": "Goodbye beta, hello Project Catalog™—now available globally!",
            "post_date": "Jan 13, 2021  08:52:10 PM",
            "edit_date": "Jan 13, 2021  08:52:46 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Nick G": [
                    "/t5/user/viewprofilepage/user-id/20875",
                    "Mar 2, 2015"
                ],
                "Joshua O": [
                    "/t5/user/viewprofilepage/user-id/6572790",
                    "Sep 22, 2020"
                ],
                "Haroon A": [
                    "/t5/user/viewprofilepage/user-id/7264430",
                    "Jan 15, 2021"
                ],
                "Nicolas S": [
                    "/t5/user/viewprofilepage/user-id/91353",
                    "May 11, 2016"
                ],
                "Steven T": [
                    "/t5/user/viewprofilepage/user-id/62011",
                    "Oct 12, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Christine A": [
                    "/t5/user/viewprofilepage/user-id/89860",
                    "May 4, 2016"
                ]
            },
            "messages": {
                "Lena E": "Goodbye beta, hello Project Catalog™—now available globally!Over the past few months, many of you have helped us test and refine our newest Upwork offering: Project Catalog.Through your contributions, feedback, and support, we’re thrilled to announce that Project Catalog is now officially live for the entire Upwork community—talent and clients alike.If you’re not familiar with Project Catalog (or just want a refresher), here’s a quick introduction:Project Catalog is where the work you love finds you. Build and sell your own project offerings based on the type of work you want more of. Each project will be listed on Project Catalog, ready for clients to purchase for a fixed price in just a few clicks. Once a client purchases, they’ll fill out any requirements you’ve requested, and you’ll be set to get to work.It’s an easy way to get more eyes on your offering and land new projects quickly—all while putting you in the driver’s seat. That means you and your clients can get started right away, and with confidence.Check out this video to learn how clients will discover and purchase your projects.Stay tuned for more exciting rolloutsProject Catalog is just the beginning of a series of exciting new ways to land clients on Upwork, adding to Talent Marketplace, the current platform you already know and love.But no matter how you choose to use Upwork to grow your independent work, know that we’re dedicated to helping you build the strong and profitable relationships that are the foundation of a growing business.We want to thank you for your hard work and the contributions you make to creating a thriving community on Upwork.Happy New Year—may it be your most rewarding one yet!",
                "Nick G": "So basically, just copying Fiverr.",
                "Joshua O": "Exactly, and I am not a big fan of that system to be honest. It turns professionals into \"order takers\" and I loved this platform because of the system of allowing everyone negotitate each project differently. Having a flat rate is uncomfortable because as a designer, someone could place an order asking for stuff that takes more work and skill than you imagined.",
                "Haroon A": "",
                "Nicolas S": "I do not like this model/ idea, I think is very damaging in the long term for the general freelance community, specially for those of us who offer very bespoke solutions to our clients.I only hope the conventional upwork method (>client post > freelancer aplies to the job) won't go away.",
                "Steven T": "Yep. I tried to think what I would put in this catalog but couldn't get past the idea that I had to put a price on something that's specific to every project. I was either going to have to price it for the most expensive version possible, a price that nobody would pay, or give some sort of average price and then have people buy the project to do something that should cost more.Like if I offered a browser game, expecting a single screen 2D game and they buy the project and expect a 3D multiplayer persistent universe adventure game for that price. That's a browser game, right?",
                "Valeria K": "Thanks for sharing your experience, Steven. You can consider using pricing tiers to create three different variations of a project based on scope, such as included work, pricing, and time required. Pricing tiers would allow you to create different levels of service for this browser game, showing prices for each so you can set client expectations.You can describe exactly what would be deliveredat each price.",
                "Christine A": "Hi Nicholas and Joshua,But it IS going to force us to change how we work.The project catalogues will take away business from any freelancer who chooses not to use this feature, because fewer clients will post projects for us to bid on.I've decided to try it out because I feel like I have no choice, but I'm pretty sure that it won't work for me; if I have no advantage in being able to craft a tailor-made proposal and address a client's unique needs, then nobody is going to hire me over a cheaper freelancer.What worries me most is that Upwork is actually vetting project catalogue listings and rejecting them for things like images being low quality, or text that contains typos. Meanwhile, profiles in the regular marketplace continue to be auto-accepted no matter how terrible they are. So if clients look at the catalogue and see much higher-quality results as compared to doing a normal invitation-type search, then they're going to lean towards using the project catalogues."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/More-Connects-to-win-more-of-the-work-you-love/td-p/837593": {
            "title": "More Connects to win more of the work you love",
            "post_date": "Nov 23, 2020  03:07:58 PM",
            "edit_date": "Dec 13, 2020  11:49:06 AM",
            "contributors": {
                "Katrina B": [
                    "/t5/user/viewprofilepage/user-id/6843",
                    "Sep 3, 2013"
                ],
                "Jose M": [
                    "/t5/user/viewprofilepage/user-id/6908852",
                    "Nov 19, 2020"
                ],
                "Osman A": [
                    "/t5/user/viewprofilepage/user-id/6940079",
                    "Nov 24, 2020"
                ],
                "Pankaj T": [
                    "/t5/user/viewprofilepage/user-id/1200877",
                    "Sep 26, 2017"
                ],
                "Sajib I": [
                    "/t5/user/viewprofilepage/user-id/4389467",
                    "Sep 26, 2019"
                ],
                "Mikko R": [
                    "/t5/user/viewprofilepage/user-id/71254",
                    "Dec 26, 2015"
                ],
                "Nayemul A": [
                    "/t5/user/viewprofilepage/user-id/6982823",
                    "Nov 30, 2020"
                ],
                "Valentyna I": [
                    "/t5/user/viewprofilepage/user-id/6984229",
                    "Nov 30, 2020"
                ],
                "Benjamin M": [
                    "/t5/user/viewprofilepage/user-id/7049698",
                    "Dec 10, 2020"
                ]
            },
            "messages": {
                "Katrina B": "UPDATE: This is already live. You’ll see these free Connects added to your account at the start of your next billing cycle. You can find this date on your Memberships and Connects page under User Settings.If you take the Upwork Readiness test the 40 Connects will be automatically added to your account.In December, we’re upgrading Connects to provide you free monthly Connects and bonus Connects for interviews you win. You’re doing amazing things on Upwork, and more Connects means more chances to do the work you love.We’ve seen a huge surge in client activity, and our work marketplace is full of opportunities for all the incredible talent on our platform. We can’t wait to watch you use these Connects to win your share of these opportunities, form stronger relationships with clients, and grow your career on Upwork.We introduced paid Connects to keep spam from crowding out your proposals and help you win the jobs you want. But we want to ensure connecting with clients is exciting and affordable, so we’re changing our program to provide you with the Connects you need to build deeper relationships and unlock the best opportunities.Here’s exactly what you can expect:New TalentReceive 40 free Connects with an additional 40 free Connects for passing the Upwork Readiness Test.Freelancer Basic PlanReceive10 free Connects per month (according to billing cycle)Freelancer Plus PlanReceive 80 Connects per month (70 + 10 free Connects)(according to billing cycle)Connects Rollover LimitsThe Basic and Plus roll over limit is now 200 ConnectsInterview Requests (NEW)Each interview request you(freelancers and agencies) receive and respond to from a submitted proposal earns 10 free Connects(maximum of 50 Connects per 7-day period)In December, you’ll see these free Connects added to your account at the start of your next billing cycle. You can find this date on your Memberships and Connects page under User Settings. You’ll also receive an email when your Connects are available for use.These changes will create more opportunities for everyone in our community, and we’re continuing to explore other ways to show our appreciation for everything you do. Your success is our success, and we’re proud to provide a home where you can do the work you love, form lucrative relationships, and build an amazing independent business.Learn more about how Connects work here.",
                "Jose M": "I finally see a meaningful attitude. The more proposals you have, the better the chances of the contracers being successful.In my opinion, 10 credits is very LITTLE, in the past they gave 60.Most good jobs require 6 credits, believe it or not you depend on freelancers, even though they are constantly being renewed, that's it and that's it!The more proposal there is, the more percentage of work delivered and the more successful it will be, the higher your commission will be. If you want to increase revenue, bet on advertising for example, but guarantee PF the viability for freelancers, only then will the contracteres (the money men) have reason to use your platform.",
                "Osman A": "",
                "Pankaj T": "I totally agree with you, Mr. Jose. 10 Free connects are too little.",
                "Sajib I": "Very few connections for new freelancers . I want the upwork team to add some more free connections . Mr. Pankaj",
                "Mikko R": "Sajib, just mentioning that most starting freelancers don't yet understand that to build a business you have to spend some of your resources, either time or money.What's the cost of 6 Connects compared to a good project that you get? Peanuts, right?So, no need to worry about the price of Connects or how many you get for free.If you know your ideal clients and you also know what makes them tick, all you need is 6 or less Connects to get one project. ;-)",
                "Nayemul A": "",
                "Valentyna I": "I completely agree. How quickly the activity ended on Upwork. Free connections ended and it was not possible to make money on new ones.",
                "Benjamin M": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Job-size-will-now-be-factored-into-your-JSS/td-p/697918": {
            "title": "Job size will now be factored into your JSS",
            "post_date": "Feb 3, 2020  04:55:55 AM",
            "edit_date": "Mar 1, 2020  08:58:54 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Lukas M": [
                    "/t5/user/viewprofilepage/user-id/747633",
                    "May 31, 2017"
                ],
                "Michael P": [
                    "/t5/user/viewprofilepage/user-id/4341602",
                    "Sep 16, 2019"
                ],
                "Yasir K": [
                    "/t5/user/viewprofilepage/user-id/342929",
                    "Dec 20, 2016"
                ],
                "OLIVIER R": [
                    "/t5/user/viewprofilepage/user-id/1067138",
                    "Aug 25, 2017"
                ],
                "Lucio Ricardo M": [
                    "/t5/user/viewprofilepage/user-id/2088510",
                    "May 16, 2018"
                ],
                "Brian F": [
                    "/t5/user/viewprofilepage/user-id/6367",
                    "Jun 4, 2013"
                ],
                "Danyal S": [
                    "/t5/user/viewprofilepage/user-id/198633",
                    "Oct 8, 2016"
                ],
                "NAND KISHORE P": [
                    "/t5/user/viewprofilepage/user-id/87282",
                    "Apr 27, 2016"
                ],
                "Ales H": [
                    "/t5/user/viewprofilepage/user-id/3029017",
                    "Dec 14, 2018"
                ]
            },
            "messages": {
                "Lena E": "UPDATE: The JSS Metric has been updated to reflect the changes that were announced below. As of today, March 1st, all Job Success Scores are now displaying the updated value. We will soon update JSS metrics to reflect job value in the calculation. Today, a one-week $20 job typically carries the same weight as a one-week $1,000 job in JSS. Soon, JSS will be weighted by job earnings. For example, a one-week $1,000 job will be weighted more than a one-week $20 job. JSS will also exclude contracts with $0 earned and positive feedback. All other JSS policies will remain unchanged.What does this mean?We are making this change so a freelancer’s Job Success Scorewill display a more comprehensive representation of their freelancer work.We understand not all jobs are equal.We know higher budget contracts require more work and freelancers who complete these more complex contracts successfully should get credit for them. Just as longer-term contracts hold more weight in JSS calculations than shorter ones, we believe contract value should also hold significance in the calculation. By giving these jobs more weight, these jobs will have a greater influence on a JSS.Many freelancers will see an increase in their scores if they’ve successfully completed higher budget contracts in the past. At the same time, a small percentage of freelancers may lose their JSS, see a drop in their scores, or lose their Top Rated badge. Today, we are emailing freelancers whose JSS will see a decline of 5% or more, to let them know they will be affected. Freelancers that see a drop in their score can improve their JSS by completing more jobs with positive feedback, as it works today. Larger budget contracts with positive feedback will result in a higher increase in JSS, however, all great feedback contributes to JSS and whether you work on large or small contracts you can still reach 100% JSS.This change will take effect in March, at which time all Job Success Scores will be updated retroactively. We know many of you will have questions about this update. We won’t be able to discuss your individual score or outcomes of specific contracts. We have listed some anticipated questions below, let us know if you have any additional questions.FAQS:Can I know what my new JSS is now before this launches?We will not be able to provide you with your updated score until the JSS calculation refreshes at launch, in March.Does this mean if I don’t get big contracts I’ll never be able to get a JSS of 100%?Receiving stellar feedback on smaller budget jobs can still get you to a JSS of 100%. We are only changing the impact of jobs based on earnings. This means that strong client feedback on a higher-budget job could boost your score more than a lower-budget job. All other aspects of JSS will remain the same.How will I know if it affects me?The majority of freelancers will be affected positively by this change and will see an increase in their scores. We are sending out emails to those who will likely see a drop in their score once the new JSS calculation goes into effect in March.Can this affect me positively, will my JSS go up?Yes! The vast majority of freelancers on the platform will see an increase or very little change in their scores. This is because you may have worked on one or more higher paying contracts in the past, and because you received great feedback that great feedback is being weighted more.Can I lose my JSS?A small percentage of freelancers may lose their JSS. This is because they had one or more jobs with no earnings. Positive feedback on contracts with no earnings will not be factored into JSS once we move to the new calculation. As a result, some freelancers won’t have enough outcomes to be eligible for a JSS until they successfully complete more jobs. Nearly all freelancers have scores after completing eight projects.How does weighting work specifically?To ensure fairness and avoid manipulation, we don’t share the specifics about how we calculate the Job Success Score. Thanks for your understanding.So if I take a bigger job and get negative feedback that counts more than positive feedback on smaller jobs?Yes. A job with higher earnings will always impact your Job Success Score (JSS) more than a smaller job. For example, feedback on a $1,000 job carries more weight on your JSS compared to a $20 job. However, receiving poor feedback on a job with more earnings can be balanced out by doing well on a job of the same size in the future or on a number of smaller jobs.Can I lose my Top Rated badge?Yes, a small percentage of freelancers who see a decline in their JSS may drop below 90% and lose their Top Rated badge. This is because they received less-than-positive public or private feedback on one or more of their higher-paying contracts. Feedback on contracts with higher earnings will affect JSS more after this new change.",
                "Lukas M": "Pretty much all freelancers are very unhappy with the JSS and this step is no improvement. Just look up the JSS article of upwork, 6000+ down votes, 4000 upvotes. Lenghty discussions in forums what the heck is going on with JSS scores. The JSS isnt communicated transparently to freelancers and you are making things worse actually, because by the time people learn how it works, to correct bad JSS now requires huge jobs.What about letting clients fix their private feedback? because private feedback isn't private if it drops your public JSS.This is situation is disappointing for many freelancers.",
                "Michael P": "Jss scores are really awful. Any **Edited for Community Guidelines** can say whatever they want. One client threatened me, another wanted free work. One was a 21 year old who knows nothing. Did you know a person can be sued for a bad review if it harms them. My clients don't need long term relationships with me. The work I do is almost always just once and that's it. I am penalized from that? Odd figuring. I am at 69 percent and have almost given up. The success score really means how much money we can make on you and if you don't make enough, let's just make it miserable to get any work. One of the clients also recently **Edited for Community Guidelines** I met him locally. The beloved clients are **Edited for Community Guidelines**. **Edited for Community Guidelines** were treated nicer.",
                "Yasir K": "Upwork, give all privileges to the client. I wrote to Upwork support that I have proof that my client gave me a review which I didn't deserve but they didn't help me. There should be some mechanism that can check whether the client gives the result on the basis of the work or not. I'm talking about the worst cases. Sometimes Client gives review and ratings on the basis of their mood, which is very harsh.",
                "OLIVIER R": "Upwork forget who is the client >>> It's the freelancer .... 20 %of fees, paid connects for jobs- real or fake, protection ...and they doesn't care their clients. Finally, they will paid the bill... and it will be probably painfull.",
                "Lucio Ricardo M": "I have also such kind of \"gem\" clients. $50 milestones, you complete it then they disappear. He promised to catch up in Saturday. Today is monday and he has not reported. if before COVID-19 exceptional state he missed catch up dates, i don't know what to expect these times... and surely the day when he is able to come back online he will want more work for this milestone. Some clients think that we don't have bills and earning expectancies. But be for more money, harder to get and to retain clients. May upwork bias jobs into more-paying ones, instead of doing it only by the JSS scoring. Or, ¿¿isn't that feasible that higheer earnings jobs gets to us??",
                "Brian F": "I have also such kind of \"gem\" clients. $50 milestones, you complete it then they disappear. He promised to catch up in Saturday. Today is monday and he has not reported. if before COVID-19 exceptional state he missed catch up dates, i don't know what to expect these times... and surely the day when he is able to come back online he will want more work for this milestone. Some clients think that we don't have bills and earning expectancies. But be for more money, harder to get and to retain clients. May upwork bias jobs into more-paying ones, instead of doing it only by the JSS scoring. Or, ¿¿isn't that feasible that higheer earnings jobs gets to us??Don't ever do fixed-price. No real protections. Ever since they got rid of up-front payments from it, I have almost universally refused to do fixed-price. Aways go hourly, with the limits you can still set a clear budget.",
                "Danyal S": "As long as the milestone is created, its' still safe. Even if the client disappears, just request the milestone and you will get the amount in 14 days. Happened to me multiple times, I just get the milestone created so that I can ask upwork in case of dispute or get the money directly once the client disappears.",
                "NAND KISHORE P": "The Upwork making things worse...I am really not happy. They have already downgraded my score and am not able bid for those job required 90% success score. I also experienced fake jobs being posted on Upwork. We are loosing our connects by biding for these jobs every month.",
                "Ales H": "I totaly agree! I made 28 jobs and 10k+ earned, i didnt get feedback for 5 of them (should we beg our clients for feedback???). For 23 jobs i got 5 stars feedback and for 1 job i got 3.8 stars...I have 3 jobs still in progress. There wasnt a single job which i wouldnt successfuly finish! I was top rated with 100% SUCCESS RATE, now i suddenly dropped to 85%...WTF?! I mean \"SUCCESS\" should really be ment as SUCCESS!And about fake jobs... There are a lot of fake jobs. Clients should somehow obligate to really assign a job, before actually posting it."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-Identity-Verification-Badge-available-soon-for-Top-Rated/td-p/553146": {
            "title": "New Identity Verification Badge available soon for Top Rated Freelancers",
            "post_date": "Jan 16, 2019  09:43:32 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Md Ashifur R": [
                    "/t5/user/viewprofilepage/user-id/21574",
                    "Mar 12, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Muhammad R": [
                    "/t5/user/viewprofilepage/user-id/551184",
                    "Mar 13, 2017"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ]
            },
            "messages": {
                "Lena E": "We will soon be releasing a new Identity Verified badge for Top Rated freelancers. This badge will display on Top Rated freelancers’ profiles after they have gone through the identity verification flow.Many of you have already completed some form of identity verification on Upwork, whether through a video call or by submitting your identity documents. However, clients cannot see this information and are not aware when a freelancer takes steps to verify their identity on Upwork.With this new badge, freelancers now have the ability to proactively verify their identity, and showcase the verification publicly on their profiles. Some Top Rated freelancers may have already verified their identity with Upwork in the past and may see a verified badge on their profile once this feature launches.We will start by rolling this out to Top Rated freelancers over the next few months. When you become eligible, we will notify you when you log in to complete the verification process by going to your Settings and selecting Identity Verification. As part of the verification process you will be asked to upload an official government-issued ID and complete a short video call with us. Once you’ve completed the verification process, the “Verified Identity” check mark will be shown beside your profile photo and name. The badge will display with hover-over text, letting clients know that you’ve verified your identity with Upwork. Although this badge will only be available to Top Rated freelancers for now, we do plan to expand the program in the future and will update you when this is available. As freelancers, you’ve built your reputation on Upwork through feedback, showing a strong work history on your profile, and through the stellar work product you deliver. We’re hoping that this new Identity Verified badge will help you further establish confidence and credibility with clients and better promote your freelance business. You can find more information in our Help Center article.If you have any questions or comments, let us know.",
                "Md Ashifur R": "Recently I've noticed that Upwork has a new feature for Top Rated freelancers. From Upwork Support page I got all the information about that feature called ''ID Verification Badge''. Top Rated freelancers are eligible to get a verifiedbadge next to their Upwork name which is really awesome.Source: https://support.upwork.com/hc/en-us/articles/360010609234-ID-Verification-BadgeI was asked to verify my identity few days ago and I successfully verified my identity but I didn't get the verified badge nor do I have the option to get the badge in my user settings now!Source: https://support.upwork.com/hc/article_attachments/360020068333/verify-identity.pngIt was clearly written in FAQs thatonly Top Rated freelancers will become eligible to earn the “Identity Verified” badge for now.You can see that FAQ image below.Source: Upwork Support Page FAQsI'm a Top Rated freelancer and few days ago I verified my identity so I think I'm eligible for this badge but Iain't sure howto get the badge! The FAQs answers are confusing!Could anyone clarify this issue in more detail? Thanks in advance!",
                "Valeria K": "Hi Md Ashifur,Thanks for your question. To start, we are slowly rolling it out to Top Rated freelancers over the next few months. When you become eligible, we’ll notify you when you log into our site.",
                "Muhammad R": "Hi Valeria.I have an issue while starting verification process .When i start the verification process The following window comes.\"We can not complete you request now.we are experiencing an unexpected spike in traffic. Please help .Thanks",
                "Avery O": "Hi Muhammad,As Valeria has noted, we are slowly rolling it out to Top Rated freelancers over the next few months. When you become eligible, we’ll notify you that you need to complete this verification process when you log into our site.",
                "Vladimir G": "Apologies for the late replyMuhammad. Couldyou please clear your cache and cookies, try using a different browser and let us know if you were able to access your account and complete the verification process?",
                "Goran V": "HiMuhammad,Could you please confirm what type of browsers have you used? Thank you."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-talent-badges-are-now-available/td-p/778142": {
            "title": "New talent badges are now available!",
            "post_date": "Jul 6, 2020  07:07:16 AM",
            "edit_date": "Aug 20, 2020  09:18:54 AM",
            "contributors": {
                "Iliana M": [
                    "/t5/user/viewprofilepage/user-id/1678078",
                    "Jan 30, 2018"
                ],
                "Kelly B": [
                    "/t5/user/viewprofilepage/user-id/71799",
                    "Jan 1, 2016"
                ],
                "Pandora H": [
                    "/t5/user/viewprofilepage/user-id/1567",
                    "May 11, 2010"
                ],
                "Jennifer M": [
                    "/t5/user/viewprofilepage/user-id/28061",
                    "May 17, 2015"
                ],
                "Sanjay V": [
                    "/t5/user/viewprofilepage/user-id/1733635",
                    "Feb 13, 2018"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Kristin D": [
                    "/t5/user/viewprofilepage/user-id/4849660",
                    "Jan 5, 2020"
                ],
                "Michael U": [
                    "/t5/user/viewprofilepage/user-id/1284899",
                    "Oct 17, 2017"
                ]
            },
            "messages": {
                "Iliana M": "Earlier this year, we shared some of our upcoming plans to highlight top talent on Upwork. We understood that you are looking for more ways to stand out and want better access to high-value opportunities with quality clients. As we continue to attract more businesses seeking flexible talent solutions, we have also heard their need to more quickly find talent they can trust for complex, strategic, and long-term work. To further our continued efforts towards this vision, we're excited to announce two new talent badges: Top Rated Plus and Expert-Vetted.TOP RATED PLUSWhat is Top Rated Plus?Top Rated Plus is a new status for talent that has a proven track record of excelling on large or long-term contracts on Upwork. On average their contracts last 7 months. These professionals and agencies are highlighted because they have delighted clients on large contracts. Businesses frequently seek talent for large projects or longer-term relationships, and trust talent with this proven experience on Upwork. Right now Top Rated Plus talent has earned more than $100K on average through Upwork, four times as much as Top Rated talent.What are the benefits?What are the requirements to become a Top Rated Plus freelancer?What are the requirements to be Top Rated Plus as an agency?TimingEXPERT-VETTEDWhat is Expert-Vetted Talent?Expert-Vetted Talent is a new status for talent that has deep experience in their field, on or off Upwork. Upwork invites this talent to participate in a rigorous pre-screening process. We chose to highlight these professionals because businesses frequently seek talent with a strong combination of expertise and soft skills, and they trust talent that has been pre-screened by professionals in the relevant field. This talent will get prioritized for clients on Upwork’s Enterprise and Business plans, whose average project value is over $8,000.What are the benefits?Our team is hard at work to further enhance the Expert-Vetted experience, so expect more exciting updates on the horizon including opportunities to engage with this exclusive community of professionals like you and other ways to more easily access high-value work.What are the requirements to become an Expert-Vetted freelancer or agency?This opportunity is available by invitation only. Keep your eyes peeled for an invitation in your email inbox or when you log into Upwork. Once we are able to offer this opportunity to more people, we will provide an update here.If you are invited to participate, you will need to pass a rigorous pre-screening process which may include a portfolio review, coding tests, interviews, or other steps relevant to your area of expertise. Agencies participate in a similar process to assess the agency’s expertise.Our initial focus is Design & Creative; Web, Mobile, and Software Development; and Sales & Marketing.How is this different from previous programs, like Upwork Premium?Expert-Vetted replaces previous programs for expert-level talent. We’ve done extensive research with businesses seeking expert-level talent on Upwork for large projects and created new criteria in line with current client expectations. If you’ve previously taken an assessment for Upwork Premium or Upwork Pro, thank you! We have your results on file and will take them into consideration as we grow the program and extend additional invitations. Your results also continue to be available to our Talent Services teams which take them into consideration when sending invitations to jobs.TimingRISING TALENT & TOP RATEDFreelancers who are currently Rising Talent or Top Rated will continue to keep those badges and benefits. Expert-Vetted and Top Rated Plus are not replacing Rising Talent or Top Rated.When you earn Expert-Vetted or Top Rated Plus status, your new badge is only visible to Upwork's Enterprise and Business clients—as well as select Plus clients for Top Rated Plus. All other clients will see your Rising Talent or Top Rated badge if you have one.See the chart below to learn which badge clients see when they look at your profile, depending on the client type.---We care deeply about helping you succeed on Upwork. There is plenty more to come! We will continue to invest in our talent badges and other solutions. We'd love to hear your thoughts on how these new statuses impact your work and other ways we can help you achieve your goals.Thanks!Iliana MontaukProduct Manager",
                "Kelly B": "I have a question, and this issue has been raised before. I have a long term client. More than two years. She hired me for an initial project and left a great review for that, but for the next project she's never been able to leave a review, because she'd have to close out the contract and start a new one to do that, which seems silly and is a waste of her time. Is there any way those kinds of contracts will ever apply?",
                "Pandora H": "I have a question, and this issue has been raised before. I have a long term client. More than two years. She hired me for an initial project and left a great review for that, but for the next project she's never been able to leave a review, because she'd have to close out the contract and start a new one to do that, which seems silly and is a waste of her time. Is there any way those kinds of contracts will ever apply?I have a similiar question, which is what if our contracts last a really long time (I am in one going over a year now).",
                "Jennifer M": "I have a question, and this issue has been raised before. I have a long term client. More than two years. She hired me for an initial project and left a great review for that, but for the next project she's never been able to leave a review, because she'd have to close out the contract and start a new one to do that, which seems silly and is a waste of her time. Is there any way those kinds of contracts will ever apply?I have a similiar question, which is what if our contracts last a really long time (I am in one going over a year now).Same question here too.",
                "Sanjay V": "I'm having the same question. However, the client hasn't left any feedback as he's usually busy and we've resumed working again and this time too for the long term. Does this count or would I have to ask him for a review. I wonder if the contract with the same client has started again makes me eligible.Let me know.",
                "Valeria K": "Kelly, Jennifer and Pandora, I'm checking with the team to confirm if a long-term contract needs to be completed and closed in order for it to count toward the Top Rated Plus status or not. I'll get back to you once I have more information about that. UPDATE: Yes, active long-term contracts do count.Also, we have a solution in the works that should address the issue you're bringing up with long-term active contracts that don't receive feedback until they are closed.And... all three of you have the Top Rated Plus badge. We'll be sending out emails to notify freelancers who receive the badge shortly.",
                "Kristin D": "Thanks all for raising this question. It was my understanding a project needed to be closed to receive a referral and rating; since goal is serving client's needs long term this is can work against us in ratings. It would be a good feature fix. I would like to be considered top rated badge as well. Thank you!Warm regards,Kristin",
                "Michael U": "Hi Valeria,I think that what you told us here is not what the support of Upwork understand well.I have a chat with the support agent recently and he told me that the contract need to be closed and feedback received so it can be evaluated for Top Rated Plus badge.Can you clarify here please? I'm attaching my chat with support below:**Edited for Community Guidelines**"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-To-Do-List-collaborative-tool/td-p/832559": {
            "title": "New To-Do List collaborative tool",
            "post_date": "Nov 10, 2020  06:47:10 AM",
            "edit_date": "Nov 15, 2020  04:10:24 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Jody P": [
                    "/t5/user/viewprofilepage/user-id/964811",
                    "Aug 1, 2017"
                ],
                "Timothy S": [
                    "/t5/user/viewprofilepage/user-id/214619",
                    "Oct 19, 2016"
                ],
                "Douglas Michael M": [
                    "/t5/user/viewprofilepage/user-id/28462",
                    "May 22, 2015"
                ],
                "Mekail R": [
                    "/t5/user/viewprofilepage/user-id/5482261",
                    "Apr 21, 2020"
                ],
                "Nghiem B": [
                    "/t5/user/viewprofilepage/user-id/222334",
                    "Oct 25, 2016"
                ],
                "Alicia G": [
                    "/t5/user/viewprofilepage/user-id/4922616",
                    "Jan 20, 2020"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "Mary L": [
                    "/t5/user/viewprofilepage/user-id/7282602",
                    "Jan 18, 2021"
                ]
            },
            "messages": {
                "Lena E": "Today, we are starting to test out a new collaborative tool, To-do lists, with freelancers and clients.To-do lists can serve as a collaborative space to organize your contract’s work. Clients and freelancers will be able to create to-dos, assign an owner, add a short note, and set a due date.We hope the due dates and notes in this tool will be helpful when managing projects and deadlines. You can toggle to view the full list or only tasks assigned to you, so this tool could also function as a way to organize your own tasks for a contract in an easy to access spot.Use the tool however you’d like. It’s completely optional and the deadlines are not monitored by Upwork and do not replace your contract terms agreed upon when starting the contract.You can access the to-do list from your contract workroom. We have released this to some customers today and will expand to more very soon.Tell us how you like it and what improvements you'd suggest with the feedback.",
                "Jody P": "Hi Lena,Thank you for that update and new feature - it looks very promising.I plan to start testing it out today, so I will gladly let you know how it goes.Best regards,Jody PM",
                "Timothy S": "Thank you, Lena.At the time of this message, I see this as an option for certain clients when I log into Upwork via my browser only.Is this something we can expect to see within the desktop app, as well?It also would be nice to have the ability to thread comments related to a \"to-do\" with that \"to-do\". That way, clients and freelancers won't have to scroll through messages linearlly to find where that comment was from that particular \"to-do\" item from last month, or several months ago.Adding a comment to a \"to-do\" item could post to both the main chat and on the \"to-do\" item to enable a conversation on the \"to-do\" that is also tracked in the main thread (similar to threads in other communication tools).Tim",
                "Douglas Michael M": "I can see this being useful for documenting \"deadlines\" for clients on jobs that require a certain amount of back-and-forth.",
                "Mekail R": "Thank you for that update.",
                "Nghiem B": "I have been looking for this feature for a while. Great work.",
                "Alicia G": "I'm a huge fan of to-do lists and I was excited to use one on my last project. I am starting a new contract today and would love to use it again, but it isn't available...or am I missing it somewhere?",
                "Aleksandar D": "Hi Alicia,We are currently testing this option out with a select group of users. We will let you know if we expand the option!Thank you.",
                "Mary L": "I really love the new to-do's tab. It's helpful to keep up with login u/p for each client's task assigned to my hourly freelancers. Instead of scrolling through messages, everything is right there. When I say client, I mean my client-- not me as an Upwork client.1) It would be cool to have a \"star\" capability. So, if a freelancer marks a task as complete, s/he still knows where to find the login info for future tasks. Also, if there is a set a branding standards or client-specific protocols, they can be marked with a \"star\".2) Far down the roadmap: I could see how this feature could fold into a team project through \"rooms\" so those grouped together can see what each freelancer is working on.Questions:1) Can the freelancer still see the completed tasks like I can?2) Are the deadlines tracked to their performance? Sometimes I have less urgent tasks that I set for a 48-hour deadline but it's not a critical, hard deadline. I don't want the freelancer to be penalized if s/he goes over a soft deadline per a message that I sent.I notice how the messaging system is more reliable compared to past years. Great job!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Testing-video-chat-profile-verification/td-p/257712": {
            "title": "Testing video chat profile verification",
            "post_date": "Oct 6, 2016  02:32:02 PM",
            "edit_date": "Nov 16, 2016  09:33:17 AM",
            "contributors": {
                "Garnor M": [
                    "/t5/user/viewprofilepage/user-id/11",
                    "Oct 29, 2014"
                ],
                "Wassim T": [
                    "/t5/user/viewprofilepage/user-id/28977",
                    "May 29, 2015"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Dmytro A": [
                    "/t5/user/viewprofilepage/user-id/229657",
                    "Oct 31, 2016"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Ro M": [
                    "/t5/user/viewprofilepage/user-id/253687",
                    "Nov 16, 2016"
                ],
                "Blake M": [
                    "/t5/user/viewprofilepage/user-id/505209",
                    "Feb 24, 2017"
                ],
                "Salma K": [
                    "/t5/user/viewprofilepage/user-id/242618",
                    "Nov 8, 2016"
                ],
                "Mohammad Moneer B": [
                    "/t5/user/viewprofilepage/user-id/1100602",
                    "Sep 3, 2017"
                ],
                "Rene K": [
                    "/t5/user/viewprofilepage/user-id/9865",
                    "Jul 10, 2014"
                ]
            },
            "messages": {
                "Garnor M": "We recently began testing a new method for verifying freelancer’s profile details. Unfortunately, sometimes we see fraudulent profiles, and to prevent this, on occasion we need to verify the information a freelancer has included in their profile. With this new program, some freelancers may be asked to join a brief video chat with an Upwork representative. During this video call, which should take less than 3 minutes, our representative will ask a few questions to confirm some of the information entered by the freelancer on his/her profile. If you are selected for this test, the request to join a video chat will be sent to you via email. Simply follow the instructions outlined in that message to join our representative for the call.This program is still being tested, so we're not expanding it to all freelancers or clients at this time. We're evaluating this program as part of our ongoing efforts to protect all our users and better ensure Upwork is the trusted environment for freelancers and clients to connect and collaborate. ",
                "Wassim T": "This is amazing Garnor. Thank you!Can I have a suggestion please? Is it possible toextend the program to confirm the information about spoken languages freelancers list under their profile? That would be really amazing. I see a lot of contractors who come to the forum and write their first threads with weird and crazy English sentences. They often have \"English: Excellent\"under their profiles.I know there's tests out there to verify this information, but honestly speaking the tests are not enough because sometimes it's easy to cheat, but if there's a way that an Upwork representativecan SPEAK to them while they're being verified, this gives enough information for Upwork to decide whether their statements are correct or not, and adjust that piece of informationaccordingly.Imagine how amazingly the platform will improveif clients knowin advance that peoplewho bid on their jobs and list excellent English skills in their profiles are really excellent English speakers.Best regards,Wassim",
                "Vladimir G": "HiWassim,Thank you for sharing this suggestion. While I can see some positive results from confirming users' info in this way, I don't expect our team will consider making this improvement in the near future, for a number of factors that come into play when testing a specific skill. Duolingo tests include a video featureand are far more adequate than any other manual assessmentof users' skills. Our team will keep working to ensure users provide honest and accurate information in their profiles.",
                "Dmytro A": "Good day! Please verify my page.",
                "Valeria K": "Hi Dmytro,Please, refer to the notification that was sent to you earlier today for instructions and links you need to complete your profile verification. You can find that notification in your email inbox or on this page under my requests.",
                "Ro M": "This sounds nice. May I suggest you also check out this thread and consider imposing more serious sanctions (such aswithholding payments) to freelancers that create fake profiles and/or state fake credentials. I'd also suggest focusing on automatic means of assesing freelancer profiles as 3 minutes of video chat seems like a lot of resources.",
                "Blake M": " Ro, Withholding payment, without the recipients consent, of wages for services performed is a very BAD idea. This could, and probably would, violate local, state and federal wage laws. Failing to pay these wages is a crime known as wage theft and I would be shocked if Upwork actually engaged in such activity. A lot of states allow employees who have not been paid the wages they are due to file wage claim complaints with state work commision(s) who can then, at their discretion, begin serious investigations. No this would not be a good idea. Some other method really needs to be considered. Blake M.",
                "Salma K": "Blake,I totally agree.I think UpWork is waiting for an action lawsuit.",
                "Mohammad Moneer B": "I definitely agree.Upwork is pushing it.It is bad management to launch such an initiative when they have so many means of verification other than this. It is intrusive, to say the least.",
                "Rene K": "It is bad management to launch such an initiative when they have so many means of verification other than this. It is intrusive, to say the least.Don't do it. You should never do something you're not comfortablewith. Don't feel having a video chat? Don't do it. Leave your account suspended and go someplace else where they don't have videocalls for identity verification.Upwork is not meant to please everyone and there are many other online platforms for freelancers on the Internet.Easy peasy."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Indian-TDS-Tax-Withholding-on-Upwork-Earnings/td-p/810470": {
            "title": "Indian TDS Tax Withholding on Upwork Earnings",
            "post_date": "Sep 14, 2020  03:04:55 PM",
            "edit_date": "Sep 14, 2020  03:08:09 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Mohammad A": [
                    "/t5/user/viewprofilepage/user-id/5934699",
                    "Jun 22, 2020"
                ],
                "Biju J": [
                    "/t5/user/viewprofilepage/user-id/23185",
                    "Apr 7, 2015"
                ],
                "Abinadab A": [
                    "/t5/user/viewprofilepage/user-id/166178",
                    "Sep 26, 2016"
                ],
                "Isabelle Anne A": [
                    "/t5/user/viewprofilepage/user-id/9401",
                    "May 19, 2014"
                ],
                "Harsh P": [
                    "/t5/user/viewprofilepage/user-id/25653",
                    "May 6, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Shivranjan K": [
                    "/t5/user/viewprofilepage/user-id/474783",
                    "Feb 13, 2017"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ]
            },
            "messages": {
                "Lena E": "Starting October 1st, Upwork will begin withholding Tax Deducted at Source, TDS, from payments to freelancers and agencies located in India as part of a new tax law enforced by the Indian government.As part of our continued efforts to remain compliant with tax laws in India, we are asking that our customers in India provide their Income Tax Identification number in the “Tax Info” section under “Settings”. For purposes of TDS withholding, the Indian government will accept either a Permanent Account Number (PAN) or an Aadhaar number. Please be sure to use the correct format for your PAN or Aadhaar number as defined by the Indian government:For those freelancers and agencies that have provided a PAN or an Aadhaar number:We are required to withhold 0.75% of all your payments, starting with the first dollar you earn as of October 1, 2020, and forward it to the Indian government. The rate is scheduled to increase to 1% on April 1, 2021.For those freelancers and agencies that have not provided a PAN or an Aadhaar number:We will be required to withhold 5% of all your Upwork earnings and forward it to the Indian government. You will be able to claim a tax credit or refund from the Indian government should you pay more taxes than required.You will need to add a PAN or Aadhaar number in order to keep the withholding tax at .75% of your earnings. Click here to Add Income Tax Identification.To learn more about Indian TDS, click here.Let us know if you have any questions.",
                "Mohammad A": "New rule of withholding TDS for indians is going to start from Oct.1.So now freelancer earning will be like 20% upwork commission, 0.75% TDS, $1.5/10 connects, $0.99 per withdrawal to local bank, this is so ufair upwork should reduce the commission fee they have imposed, or should provide free monthly connects.",
                "Biju J": "It is totally unfair charging TDS on the amount upwork takes as service charge.TDS should be charged only on the amount the contractor receive. That is our earing.",
                "Abinadab A": "The dead hand of the tax man.",
                "Isabelle Anne A": "The dead hand of the tax man.Yeah. This plus the 10%-20% fees, fees for membership, withdrawals, etc. It's just charges on top of more charges.",
                "Harsh P": "Take everything whatever we are earning... 20% Fees!Paid Connects to send Proposals!Withdrawal Fees!and now TDS withholds!Seems like in near future only paid membership to create an account on Upwork!!",
                "Valeria K": "Hi Harsh and others,Thanks for your feedback.Upwork fees help to cover the costs of acquiring new clients and providing services like payment protection, customer support, and platform infrastructure. Regarding, the tax announced here, we are required to forward any tax we collect from our users to the Indian government.",
                "Shivranjan K": "Then upwork must decrease service fee from 20% to 10%. It's so unfair if this continues people will surely look at a different platform.",
                "Bojan S": "HiShivranjan,Freelancers are charged a sliding fee based on their lifetime billings with each client (across all contracts they've ever had with that client's company). Once they have earned $500 with one client their fee will be reduced to 10%. To learn more about our freelancer's fees check out this guide.Thank you!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Join-our-Early-Access-Program-for-Project-Catalog/td-p/819351": {
            "title": "Join our Early Access Program for Project Catalog",
            "post_date": "Oct 7, 2020  08:49:50 PM",
            "edit_date": "Jan 15, 2021  08:48:06 AM",
            "contributors": {},
            "messages": {},
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-Upwork-Android-App-Available-Now/td-p/584565": {
            "title": "New Upwork Android App Available Now",
            "post_date": "Apr 9, 2019  07:17:30 AM",
            "edit_date": "Apr 9, 2019  07:24:40 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Syed Ebad H": [
                    "/t5/user/viewprofilepage/user-id/3158067",
                    "Jan 14, 2019"
                ],
                "Jacqueline P": [
                    "/t5/user/viewprofilepage/user-id/3236056",
                    "Jan 28, 2019"
                ],
                "Muhammad G": [
                    "/t5/user/viewprofilepage/user-id/3485903",
                    "Mar 22, 2019"
                ],
                "Nikola S": [
                    "/t5/user/viewprofilepage/user-id/6019505",
                    "Jul 2, 2020"
                ],
                "Slaven K": [
                    "/t5/user/viewprofilepage/user-id/359600",
                    "Dec 27, 2016"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ]
            },
            "messages": {
                "Lena E": "A new version of Upwork's Android app is now available in the Google Play store under the name “Upwork for Freelancers”. Just like the iOS app, our new Android app allows freelancers to access nearly all of Upwork.com while on the go. Freelancers will be able to do things like:The new Android app “Upwork for Freelancers” is for freelancers and agencies only. The current Upwork Android app called \"Upwork,\" has not been updated but is still available to download. If you use a client account to hire on Upwork, then we ask that you keep the current app.If you only use Upwork as a freelancer, you can download the new \"Upwork for Freelancers\" app and delete the old app.Let us know if you have any questions or feedback!",
                "Syed Ebad H": "I'm unable to find this on Play Store. Play store showing \"Item not found\". Can you tell me how can I fix this?",
                "Jacqueline P": "Hi Syed,Can you please check your Android OS version? The new Android app requires Android 6 or newer.- Jackie",
                "Muhammad G": "",
                "Nikola S": "HiMuhammad,I am sorry for the late response. Could you please trydownloading the newAndroid app here.Let us know if you need further assistance.",
                "Slaven K": "The app looks nice, though I have a request. Can you please keep our saved searches somewhere handy. While you have improved yourrecommended jobs engine, I still find better results for me via search.SlavenPS. Unrelated to this particular post, can you add an autosaved feature while writing a proposal. It is annoying when, after 20 minutes of writing, I accidentally click on the side of the proposal window, and it all vanishes.",
                "Valeria K": "Hi Wassim,I merged your post to this thread to keep all feedback in the same place and will be sharing it with the team.Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Diversity-certifications-available-on-US-profiles/td-p/825536": {
            "title": "Diversity certifications available on US profiles",
            "post_date": "Oct 23, 2020  10:26:02 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Nichola L": [
                    "/t5/user/viewprofilepage/user-id/21621",
                    "Mar 13, 2015"
                ],
                "Michael S": [
                    "/t5/user/viewprofilepage/user-id/4493721",
                    "Oct 17, 2019"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Maria T": [
                    "/t5/user/viewprofilepage/user-id/65903",
                    "Nov 12, 2015"
                ],
                "Christine A": [
                    "/t5/user/viewprofilepage/user-id/89860",
                    "May 4, 2016"
                ],
                "Demetrius M": [
                    "/t5/user/viewprofilepage/user-id/6813664",
                    "Nov 4, 2020"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "Alexander B": [
                    "/t5/user/viewprofilepage/user-id/598935",
                    "Mar 30, 2017"
                ]
            },
            "messages": {
                "Lena E": "Today we are excited to announce the release of Diversity certifications on profiles. U.S.-based freelancers and agencies with registered businesses that have earned certification can now provide their diversity certification information and details to be displayed on their profiles. These certifications are available for the following businesses:Our goal is to create a more inclusive platform by providing underrepresented groups access to economic opportunities. To start, this certification will only show to Enterprise and Business clients as we monitor the impact. These clients have indicated they are most interested in seeking out diverse businesses and often have diversity and inclusion initiatives as part of their hiring practices.How does it work?Talent will now see a “Diversity certification” section on their profile (right rail for agencies and left rail for freelancers)They can select which type of diversity business they have:They’ll be asked to enter their certification information, including legal business name, certification number, expiration date, etc.Once certification details have been entered, talent will see the indicator on their profile as “self-reported”. Upwork is currently working with certifying bodies in the U.S. only.Note: A diverse business may qualify for more than one certification.",
                "Nichola L": "Apart from this very uninclusive veering away from its 'global' image - how much more \"excitement\" is Upwork going to subject us to? So pleased that everyone on Upwork is \"excited\" but the word is becoming seriously devalued.",
                "Michael S": "I'm sure there will be much more excitement coming for us.",
                "Petra R": "Another smack in the face of non-US freelancers.Our goal is to create a more inclusive platform inclusive... as long as it's US.",
                "Maria T": "**bleep** that you only think of the US when you do something.Except for the \"American veterans\", of the rest, there are also in the rest of the world.Upwork is supposed to be international, but it seems like only look at its belly button.",
                "Christine A": "Is this feature only going to appear if clients limit their search to the \"US only\" market? Or, will clients all over the world only see American freelancers when they search for a diversity hire?",
                "Demetrius M": "Thanks for the information Lena! Question for you. When I attempt to add a diversity certification, and I select the option saying \"I don't have a certification\" the \"No problem. We can help you get certified!\"message comes up with a link saying \"Learn more about how to get certified\". This link, pasted below, takes me to a page that says \"You're not authorized to access this page\". Is this an error, or just temporary with an update to the page coming soon?https://support.upwork.com/hc/en-us/articles/360055866253",
                "Aleksandar D": "Hi Demetrius,Thanks for taking the time to report this to us! I shared the issue with the help article with our team so that it can be fixed.Thank you.",
                "Alexander B": "Well, not everyone on this site is a freelancer. There's no telling what % work for or are associated with an agency. I also don't consider the companies who have freelancer profiles as freelancers either. (As an example, one employee at a company will have an Upwork account to help generate leads for their web design agency, or their marketing agency, etc.)"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Direct-Contracts-now-support-hourly-jobs/td-p/826499": {
            "title": "Direct Contracts now support hourly jobs",
            "post_date": "Oct 26, 2020  10:14:21 AM",
            "edit_date": "Oct 26, 2020  10:16:47 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Alexander B": [
                    "/t5/user/viewprofilepage/user-id/598935",
                    "Mar 30, 2017"
                ],
                "Joanne Marie P": [
                    "/t5/user/viewprofilepage/user-id/1440201",
                    "Nov 26, 2017"
                ],
                "Russell T": [
                    "/t5/user/viewprofilepage/user-id/42530",
                    "Jul 25, 2015"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Harriet E": [
                    "/t5/user/viewprofilepage/user-id/7268429",
                    "Jan 16, 2021"
                ],
                "Nikola S": [
                    "/t5/user/viewprofilepage/user-id/6019505",
                    "Jul 2, 2020"
                ]
            },
            "messages": {
                "Lena E": "We have expanded Direct Contracts to support hourly jobs. As previously announced, Direct Contracts allow freelancers to invoice and manage contracts on the Upwork platform without their clients having to create an Upwork account. This was previously only available for fixed-price contracts and with this expansion, freelancers will now be able to generate contracts that require an hourly breakdown of their work on a recurring basis. Direct Contracts make it easy to manage and collect payment from non-Upwork clients. Clients won’t have to create an Upwork account or pay any additional fees. All of the contract management and payment is sent to the client via email, keeping the experience easy for them to use. And with Upwork Escrow and dispute assistance, freelancers can work confidently with their clients who are not on Upwork.Here’s how it works for hourly:Freelancers can create a Direct Contract through their Upwork account from the main navigation bar, by clicking on the paper airplane icon (beside the bell). Setting up a Direct Hourly Contract takes 3 easy steps. The freelancer will enter the contract details, their hourly rate and the total number of hours they’ll per week, review the contract, and send.Once they’ve created a contract, the client will receive an email with the contract details to approve. The client will also be required to deposit funds before the contract starts. This way freelancers can be assured in knowing they have payment protection, as the funds are already secured before they begin the contract. The amount required is based on one week’s work total, which is calculated by multiplying the hourly rate and the estimated max hours. Once the contract has been accepted and funds deposited, freelancers will see the prompt for them to begin logging hours. With Direct Hourly Contracts, there is no Time Tracker, hours are logged manually each week and must be entered by Sunday of that workweek.Monday, following the completion of the previous work week, opens the review period for clients. Clients will be able to review and approve the logged hours until Friday. On Friday, freelancers are paid for the previous week’s work that has been approved by the client. This timeframe is the same as Upwork’s faster payout option, which allows freelancers to receive funds five days earlier than marketplace jobs. This is because we are eliminating the security hold on these payments. You can learn more about Direct Contracts here. You can also find more details in the FAQs we provided below.How is my payment for hourly work protected with Direct Contracts?After you and your client agree to create a contract and set a weekly rate and time limit, we’ll estimate the weekly total and require your client to deposit that amount into Upwork’s secure escrow account. Once your client funds the deposit, we will notify you and you can confidently begin work knowing your payment is secure. Note: Payment protection does not cover additional work hours beyond the set weekly limit or expenses.How does Upwork calculate the security deposit and weekly charge to the client?We calculate the security deposit by simply multiplying your rate against the weekly limit that has been set by you and your client. For example, if your rate is $10/hr and your weekly limit is set to 40 hours, we will set the deposit as $400 (or $10/hr x 40 hours). The weekly charge is determined after the work week. We set the weekly charge based on how many hours were invoiced in the previous week.When does my client get charged each week?We will charge your client for the previous week each Monday.When do I get paid for my work?Once your hours have been submitted for invoice, payment will be reflected in your Upwork balance the following Friday as long as your client doesn’t dispute the hours. ",
                "Alexander B": "I usually use hourly contracts in place of the fixed price contracts because I like the protection offered with hourly contracts.So for example, a client will hire me (my hourly rate being $90/hr) to write an email for $125. I will bill them, roughly, for about 1 hour and 25 minutes, whatever it takes to reach $125 when you're working at $90/hr. Even though the weekly limit is 40 hours, or 10 hours, I'm not going to bill them that much.Is it possible that the freelancer can set the amount the client should fund in escrow? I imaigne this would be pretty easy to implement.",
                "Joanne Marie P": "Hi Alexander,For Direct Contracts, the freelancer sets up the weekly limit before sending the contract to the client. To start, we calculate the deposit by simply multiplying your rate against the weekly limit that has been set. For example, if your rate is $10/hr and your weekly limit is set to 40 hours, we will set the deposit as $400 (or $10/hr x 40 hours). After the first week, the weekly charge depends on how many hours were invoiced in the previous week. Thanks for your feedback. I'll be sure to share it with the rest of the team.",
                "Russell T": "That is the way I have been encouraging Upwork to escrow out typical standard hourly Upwork contracts..(as non-payment/lack of funds have been on the rise lately).any plans on moving that system over the the normal UpWork side?",
                "Bojan S": "Thank you so much for sharing your valuable feedback with us,Russell.I'll be sure to share your suggestion with our team.",
                "Harriet E": "Hi,can I use Time Tracker with Direct Contracts (per hour)? I want to work transparently so that the customer can be sure about the hours.",
                "Nikola S": "HiHarriet,Thanks for your question. The Time Tracker feature is not an option with Direct Contracts. With hourly Direct Contracts, you and the client agree to a weekly limit on hours. Before releasing payment, the client can also review the manual hours invoice so they can reach out to the freelancer with any questions and, if needed, file a dispute.Regarding your second question. To start, we calculate the deposit by simply multiplying your rate against the weekly limit that has been set. For example, if your rate is $10/hr and your weekly limit is set to 40 hours, we will set the deposit as $400 (or $10/hr x 40 hours). After the first week, the weekly charge depends on how many hours were invoiced in the previous week.Let us know if you have further questions."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-Upwork-Skill-Certifications/td-p/805295": {
            "title": "New Upwork Skill Certifications",
            "post_date": "Sep 2, 2020  12:30:19 PM",
            "edit_date": "Sep 3, 2020  11:38:51 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Wendy C": [
                    "/t5/user/viewprofilepage/user-id/46561",
                    "Aug 24, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Waqas A": [
                    "/t5/user/viewprofilepage/user-id/6461553",
                    "Sep 4, 2020"
                ],
                "Nikola S": [
                    "/t5/user/viewprofilepage/user-id/6019505",
                    "Jul 2, 2020"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/783032",
                    "Jun 12, 2017"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Viacheslav K": [
                    "/t5/user/viewprofilepage/user-id/48484",
                    "Sep 9, 2015"
                ]
            },
            "messages": {
                "Lena E": "As you may have seen in previous Community posts and initiatives earlier this year, we’re committed to helping expert talent stand out on Upwork. In January, we announced our plans to highlight top talent and welcomed your feedback. Last month we announced two new talent badges, Top Rated Plus and Expert-Vetted. Continuing on this path we are excited to share our new Upwork Skills Certifications.We have launched a new initiative to help freelancers showcase their expertise by earning an Upwork Skill Certification. These skill certifications highlight talent that has demonstrated competency in their field by passing a rigorous skill assessment or sample work review, evaluated by domain experts in their field.Currently, Upwork Skill Certifications are available for certain skills in the Web & Mobile Software Development (WMSD) and Design & Creative fields. For WMSD, certification is a two-step process that takes 2 to 3 hours. Participants must achieve a passing score on two timed and proctored coding tests. Design & Creative talent must achieve a passing score on their Upwork portfolio, which is evaluated by a panel of third-party domain experts. You can learn more about Upwork Skill Certifications here. Given the intricacy of having skills assessed, these certifications are exclusively invite-only at this time.Upwork Skill Certifications will display on your Upwork profile in the certifications area.Here is an example of a Microsoft certification on a profile. Upwork Skills Certifications will appear in a similar format but with an Upwork badge for the specialized certification.Upwork Skill Certifications are currently available in 10 software development languages and 16 design and creative skills.Upwork Skill Certifications in Web & Mobile Software Development test for individual proficiency in a particular language or technology. Assessment methodology varies by skill, using a combination of timed, proctored tests and in some cases, technical interviews.Upwork Skill Certifications in Design & Creative test for an individual’s or agency’s demonstrated competency in current design best practices. A panel of 2 or more domain experts evaluates a freelancer or agency Upwork portfolio based upon several dimensions depending upon the skill.We plan to grow the program and offer the skill assessments to more talent and in additional skill areas. You do not need to have earned a talent tier such as Top Rated or Expert-Vetted to receive an invitation. These are signals of having expertise in your field and do increase your chances of being invited, though. For the best chance of being invited, achieve and maintain a solid reputation, complete identity verification, maintain a complete and up-to-date profile that is not set to private, and have an active Upwork account in good standing.",
                "Wendy C": "Lena, this is great for tech type jobs ... but how do you (Upwork) plan on 'judging' creatives?Serious question....",
                "Valeria K": "",
                "Waqas A": "Hello Upwork Community.I am offering Bookkeeping and Accounting services at Upwork,How do I can get Upwork Skill Certification.ThanksWaqas",
                "Nikola S": "HiWaqas,Thanks for your question. We currently have 10 skill certifications in the Web & Mobile Software Development and 16 in Design & Creative categories. We hope to expand skill certifications to other categories in the future. You can find more information in this help article.",
                "Bojan S": "Hey Valeria. Happy new Year!I have a question.How does one get a certification? Do you need to get a Certificate let's say for example from adobe and add the code, Or can you get tested on Upwork?Thanks for your time.Best Regards!",
                "Andrea G": "HiBojan,Thanks for your question. At this time you cannot request to be invited for Upwork Skill Certifications. For the best chance of being invited in the future, we suggest freelancers achieve a solid reputation, keep a complete and up-to-date profile that is not set to private, and maintain an active Upwork account in good standing.If you're asking about Certifications you already have to add to your profile, you can learn how to do that here.Thanks!",
                "Viacheslav K": "Neat!Question, I did do a test before for the Talent Cloud. Wouldn't that be enough to get the certificaion?"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Specialized-Profiles-Soon-Available-in-All-Categories/td-p/578260": {
            "title": "Specialized Profiles Soon Available in All Categories",
            "post_date": "Mar 26, 2019  10:13:22 AM",
            "edit_date": "Dec 20, 2019  08:44:36 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Maksym S": [
                    "/t5/user/viewprofilepage/user-id/96218",
                    "Jun 13, 2016"
                ],
                "Jess C": [
                    "/t5/user/viewprofilepage/user-id/19842",
                    "Feb 18, 2015"
                ],
                "Nicholas K": [
                    "/t5/user/viewprofilepage/user-id/91275",
                    "May 11, 2016"
                ],
                "Wilson E": [
                    "/t5/user/viewprofilepage/user-id/44836",
                    "Aug 7, 2015"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Simon M": [
                    "/t5/user/viewprofilepage/user-id/3488346",
                    "Mar 23, 2019"
                ],
                "Badr E": [
                    "/t5/user/viewprofilepage/user-id/99550",
                    "Jul 11, 2016"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ]
            },
            "messages": {
                "Lena E": "Specialized profiles are now being expanded to all categories. Starting today, freelancers from all categories will gradually begin to see the option to create a specialized profile. As we roll this out to all freelancers over the next couple of weeks, freelancers will see a pop-up when they login that will notify them of this feature and of how to complete their specialized profile. As you may recall in our announcement last year, specialized profiles give freelancers the ability to market and highlight their expertise in specific skill sets through separate profiles for each skill. For example, a freelancer may work as a graphic designer and also a web developer, but it can be complicated to make one profile highlight completely different skills. With specialized profiles, freelancers can create tailored profiles with specific overviews, relevant work histories, and portfolio items to showcase their experience. They can also market themselves at a rate applicable for that specific skill. The specialized profiles appear as tabs on the general profile page.For more information on specialized profiles, check out this video with Zak, a product manager at Upwork.*Update 11/25:We’ve recently added a couple of new settings to Specialized profiles. You’ll be able to access them under Settings> Profile Settings or simply by clicking Manage Specialized Profiles link on your Find Work> Profile page.Change Order of Specialized profiles:You’ll be able to change the order in which Specialized profiles show on your profile by clicking on the icon in the right upper corner of the Specialized profiles box.Change Specialty:You’ll also see a Switch Specialty option for each Specialized profile. That will allow you to change the Specialty of a Specialized profile.Please, see the screenshot below for more information:Update 12/19: Now freelancers who are creating Specialized Profiles or editing an existing Specialized Profile will be able to add skills in an \"Other Skills\" field. They won't be limited only by the skills related to that Specialty.",
                "Maksym S": "this is awesome, hope this will help to improve the relevance of search results for the clients as now it not the ideal",
                "Jess C": "When will we have the option to turn the pop up OFF if we have no use for this \"feature?\" I have asked multiple times and have been ignored for months. It's getting old.",
                "Nicholas K": "When will we have the option to turn the pop up OFF if we have no use for this \"feature?\" I have asked multiple times and have been ignored for months. It's getting old.I am also not interested in this new feature, at least for the time being and I can not understand why the popup cannot be turned off or at least minimised. However, it looks like we have to get used to this new \"Profile\" page with the \"advertisement\" on the top since for some reason Upwork wants us to not forget about this new \"option\" !",
                "Wilson E": "Hi there!There should be a way to manually select the profile we wish to use when summiting a proposal because as you can see here, the system is not working properly. I have a specialized profile for exhibitbooth design, but when summiting a proposal Upwork decides to use my GraphicDesign profile, clearly not the best fit.Why not allow us to use the profile we wish instead?PS: Please do something with your customer support team, last two times I tried to use, they were useless.",
                "Goran V": "Hi WIlson,Thank you for your feedback, I will share this with our product managers.",
                "Simon M": "",
                "Badr E": "Tried it, and for a 1 full month i got only few hires. but when i removed the specializedprofiles, i now got back to my normal hires and clients are responsding to my proposals. So it's not working for me. Please don't make it a must for all freelancers to have specialized profiles.",
                "Avery O": "Hi Badr,Thank you for sharing your thoughts about this program, and I'm sorry to know that the Specialized Profiles didn't work out for you. Please know that this is an optional addition to your present profile, and is not compulsory. If you feel that the general profile works best for you, you may continue using that."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Direct-Contracts-now-live-for-all-freelancers/td-p/733448": {
            "title": "Direct Contracts now live for all freelancers",
            "post_date": "Apr 23, 2020  09:01:35 AM",
            "edit_date": "Apr 23, 2020  11:17:26 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Sanja D": [
                    "/t5/user/viewprofilepage/user-id/7885",
                    "Dec 18, 2013"
                ],
                "Abinadab A": [
                    "/t5/user/viewprofilepage/user-id/166178",
                    "Sep 26, 2016"
                ],
                "Jason A": [
                    "/t5/user/viewprofilepage/user-id/22097",
                    "Mar 20, 2015"
                ],
                "Rafsun S": [
                    "/t5/user/viewprofilepage/user-id/1723641",
                    "Feb 10, 2018"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Amr N": [
                    "/t5/user/viewprofilepage/user-id/5442940",
                    "Apr 16, 2020"
                ],
                "Humayun M": [
                    "/t5/user/viewprofilepage/user-id/4899334",
                    "Jan 15, 2020"
                ]
            },
            "messages": {
                "Lena E": "To help grow and support your freelance business on and off Upwork, we are releasing Direct Contracts to all Upwork freelancers today (previously announced as a BETA here). With this new release, we have also expanded the functionality to now include multiple milestones.Direct Contracts allows you to enter into fixed-price contracts with non-Upwork clients, offering access to Upwork's safety and security features with greater flexibility for your business. Freelancers can access their Direct Contracts by clicking on the new paper airplane icon next to notifications or directly here.Here’s how it works:On the Direct Contracts page, freelancers will see the option to start a new Direct Contract and a list of all existing Direct Contracts along with the status of that contract. The steps to start a new Direct Contract are very simple:1.Enter your client’s details2.Add either a single amount or create milestones with each amount3.Review and send the contract4.An email is sent to your client to beginYour client will receive an email notifying them of your detailed proposal, along with some guidance on how the product works.Just like your other fixed-price contracts on Upwork, your client deposits project funds in escrow before the contract starts. You will see the status of the milestone listed below each one, so you will know when to begin working. When you’ve completed the contract or each milestone, you’ll request payment from your client. And with Direct Contracts, once they’ve accepted your request, the funds are released to you immediately, with no security period.As a freelancer, you’ll pay a processing fee of 3.4% of the total contract amount, but you won’t pay any freelancer service fees to Upwork. It’s easy for your clients because they won’t have to create an Upwork account or pay any additional fees. And with payment protection and dispute assistance, you can work confidently with your clients who are not on Upwork.Let us know if you have any questions.",
                "Sanja D": "I was just about to ask what's the deal with the paper plane, lol",
                "Abinadab A": "How will you handle chargebacks, since there is no client account to delete because of the chargeback.",
                "Jason A": "Hi Abinadab,Thanks for your question! We've put a process in place to allow for us to handle chargebacks in these specific instances. No need to do anything new on your end!",
                "Rafsun S": "Just found something new here which is \"Direct Contracts\"Can anyone please share a little bit more details about it? Thanks in advance.",
                "Petra R": "just found something new here which is \"Direct Contract\"Can anyone please share a little bit more details about it? Thanks in advance.Read here",
                "Amr N": "I found out a new feature called direct contractso I am asking if the direct contract jobs will improve my profile.",
                "Humayun M": "Hi there! I have a question regarding the new direct contract feature. How does the feedback system work? Do you get rated and is there an option to leave and receive feedback that affects your JSS?"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/No-feedback-contracts-no-longer-impact-Job-Success-Score-JSS/td-p/824751": {
            "title": "No feedback contracts no longer impact Job Success Score (JSS)",
            "post_date": "Oct 21, 2020  10:47:51 AM",
            "edit_date": "Nov 12, 2020  08:25:25 AM",
            "contributors": {
                "Jason M": [
                    "/t5/user/viewprofilepage/user-id/4994049",
                    "Feb 3, 2020"
                ],
                "Naheed M": [
                    "/t5/user/viewprofilepage/user-id/6609511",
                    "Sep 29, 2020"
                ],
                "Wendy C": [
                    "/t5/user/viewprofilepage/user-id/46561",
                    "Aug 24, 2015"
                ],
                "Tantowi Gilang P": [
                    "/t5/user/viewprofilepage/user-id/1795379",
                    "Feb 28, 2018"
                ],
                "Pearlene T": [
                    "/t5/user/viewprofilepage/user-id/6828733",
                    "Nov 6, 2020"
                ],
                "Marco C": [
                    "/t5/user/viewprofilepage/user-id/143156",
                    "Sep 8, 2016"
                ],
                "James Robert S": [
                    "/t5/user/viewprofilepage/user-id/3621996",
                    "Apr 20, 2019"
                ],
                "Daniel F": [
                    "/t5/user/viewprofilepage/user-id/5513612",
                    "Apr 24, 2020"
                ]
            },
            "messages": {
                "Jason M": "I am excited to announce a new change to the Job Success Score (JSS). We know that JSS is a hot topic. This post aims to provide transparency into the changes and answer any questions you might have.On November 8th, 2020, we updated the JSS calculation process to exclude contracts that ended without feedback. Before, if a freelancer or agency had a large number of contracts that ended without feedback, those contracts could have negatively impacted their JSS.What is JSS?Your JSS measures and reflects your Upwork clients’ satisfaction with the projects you complete for them. You can view your score on your My Stats page and learn more about JSS here.What does this mean?We removed projects where clients didn't leave feedback from consideration in the JSS calculation in November. This means that it will no longer negatively impact your JSS if a client does not leave feedback at the end of a project. Note that, as a result of this change, a small set of professionals no longer had enough outcomes with different clients to earn a JSS. To minimize this impact, we reduced the minimum number of distinct clients required to earn a JSS from 3 to 2.What’s the problem with including contracts that end without feedback in the JSS calculation?Picture a contract where a professional and a client work together, and at the end of it, the client does not leave feedback. Before the change, if the professional already had a high percentage of completed contracts without feedback, the professional’s JSS could have been negatively affected.The original design was based on a study that found clients who had negative experiences would often avoid filling out the feedback form altogether instead of giving negative reviews. More recent analysis suggests this may no longer be true. As a result, we are changing the calculation to reflect today’s reality.How does this change affect you?What’s next?This is just one of several changes we’re planning to implement in the coming months, so stay tuned!This post itself is in response to your feedback that you want to be informed when changes are made. Thanks to everyone who has offered feedback on JSS communication through our customer surveys and social media, through the Upwork Community, and directly to our team. Be on the lookout for more changes to JSS and other aspects of the Upwork experience in the near future.We are all looking forward to this next chapter together!",
                "Naheed M": "Hi Jason M,Thanks for sharing this valuable information. After hard labor when we finish the task, the excellent feedback we receive relaxes our exhausted nerves.Happy to know that receiving no feedback will no more affect the Job Score Success (JSS).Thanks a million.Best Regards",
                "Wendy C": "Edited: Nov.8th is when this change will occur. Check your emails from U ...Many kudos to Upwork, and in particular Lena, for conveying long-term freelancer reasoning behind the reasons for this change. When clients spend considerable money on their projects but fail to leave feedback speaks for itself why this change was needed and is greeted with Thank You!!!!Again THANK YOU!!!",
                "Tantowi Gilang P": "",
                "Pearlene T": "",
                "Marco C": "I don't agree with stoping milestones. In fact milestones are the way, that i'll at least garantee part of the payment when \"sneaky\" clients come along. But i definitly agree that fixed price/flat rate contracts should only be approved when the client deposit the first milestone. In my view that would help to keep part of the freelancers profit, it will assure that Upwork will keep their fee, and would also keep way freeloaders looking for free work.",
                "James Robert S": "Why not just do hourly then?",
                "Daniel F": "There are reasons. I am home with an autistic daughter that can demand my attention at any moment, even when I'm being surveilled. I work from when I wake up to when I go to sleep, but I deal with my life throughout the day as well. Also, I personally like to do as much research as I want for a project, and not worry about billable hours because I got into an article while the tracker app was turned on. Give me a job, I'll do it, and do it well. Pay me for the job, and I'm good.The only time I've needed a milestone was when the relationship with a client just wasn't working. I suggested she pay me a milestone for the work we had done to that point and go our separate ways, which we did. That parting was amicable, but it still reflects negatively to anyone that uses that score to judge me."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Dial-in-Numbers-Now-Available-in-Messages/td-p/787382": {
            "title": "Dial-in Numbers Now Available in Messages",
            "post_date": "Jul 22, 2020  01:27:35 PM",
            "edit_date": "Jan 13, 2021  04:10:24 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Abinadab A": [
                    "/t5/user/viewprofilepage/user-id/166178",
                    "Sep 26, 2016"
                ],
                "Vijayvithal J": [
                    "/t5/user/viewprofilepage/user-id/1311593",
                    "Oct 24, 2017"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Shannon P": [
                    "/t5/user/viewprofilepage/user-id/41684",
                    "Jul 16, 2015"
                ],
                "David S M": [
                    "/t5/user/viewprofilepage/user-id/1999021",
                    "Apr 24, 2018"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Latasha D": [
                    "/t5/user/viewprofilepage/user-id/6309671",
                    "Aug 12, 2020"
                ]
            },
            "messages": {
                "Lena E": "Update: We're removing this \"dial-in\" option as we are now offering dial-innumbers through Zoominstead.You can now initiate or join a call in Messages by using a dial-in phone number. These dial-in numbers will be helpful for users with internet connectivity issues or other issues that prevent them from making calls from the platform, by giving them an option to use their phones.How it works:To keep your information private, the user's phone number will not be shown to the call participants.The feature is available for all Upwork users. Numbers are available from the following countries.The current list of countries as of today are: USA, Finland, Netherlands, Kenya, Canada, Cayman Islands, Iceland, UK, Indonesia, Philippines, Czech Republic, Serbia, Belgium, Thailand, Israel, Uganda, Puerto Rico,Hong Kong, New Zealand, Columbia, Malaysia, Mexico, India, Singapore.If your country is not on the list, you can still use other numbers from the list.",
                "Abinadab A": "Great. You should also come up with a way to sign NDAs, such that the full NDA with contact info is visible to the other party only after a contract has started.Tough one, but it's the Pandora's box you opened.",
                "Vijayvithal J": "I noticed the dial in feature today while trying unsuccessfully to talk with a client via upwork messenger.Regretfully you do not have India in the list of supported countries... International calls are still expensive.I believe that a significant number of Upwork'ers are from India. Can you add support for Dial in from India.",
                "Vladimir G": "HiVijayvithal,I'm sorry to hear about the issues you've experienced with using the Call feature. Our team will reach out to you directly via a support ticket soon to help troubleshoot and identify the core issue. In the meantime, please check the tips shared in thisHelp articlein casethe issues you experienced are related topermissions issue with your camera and microphone settings.",
                "Shannon P": "Great, glad this is an option now.Will both the client and the freelancer need to use the phone call feature, or can one use their computer and the other use their phone? How does it work if one person needs to dial in and the other use their computer? For example, if a client calls me from their computer, but I have to dial in, will the call just hang up for them if it takes me more than 10 seconds to dial in? Will I need to dial in and then tell them to call back?Also, will this dial-in feature allow multiple people on the call?",
                "David S M": "I had a call scheduled with a client (the dial-in call through Upwork messages...the one in messages when you click on the phone icon and drop down to \"Phone call\", yeah that one). Anyway, I decided to use this with the client because the \"Upwork call\" doesn't work on my computer...audio and video does not work. And, why would I ever want to troubleshoot that while on a live call with a real client. That seems to be the only way to make an Upwork call, is with a real client. So we have the phone call scheduled and naturally the client and I both had issues (room not found the recorded voice said). Evidently, Upwork changes the phone call VIN number often...unsure how often...then neither of us could get a new number and PIN...just a scrambled greyed-out screen....I apologized to the client for the issues and asked if we could reschedule, we did, and the client was a no show, as I suspected. They must have gotten fed up with Upwork's bugs and ran! Thanks for driving your clients away, Upwork, that's special. I guess Upwork giveth and Upwork taketh away. But what about my time that's been wasted. And what do I do now going forward. I contacted Upwork support to help me fix the issues I'm having with both Upwork Call and Phone call. It's been 3 days since I first asked for help and, with the one exception of me figuring out a way to workaround the phone call greyed-out screen bug on my own, still neither Upwork Call or Phone call are fixed.",
                "Valeria K": "Hi David,I'm sorry to hear you've had a negative experience using the Dial-in option. I'm going to check on your ticket and follow up with the team regarding the status of the issue. We'll provide an update as soon as possible.Update: I discussed it with our engineers and they confirmed that this issue is already being addressed. Currently, you should be able to test if it works using the incognito window of your browser:- Open incognito mode in Chrome (as an example) - Select any room with 1 participant- Click on the call icon on the top right and select \"phone call\"- You will be able to see whether the page opens in incognito window",
                "Latasha D": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-Feature-Mid-Job-Feedback/td-p/796383": {
            "title": "New Feature Mid-Job Feedback",
            "post_date": "Aug 13, 2020  12:42:17 PM",
            "edit_date": "Aug 15, 2020  06:05:55 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "David M": [
                    "/t5/user/viewprofilepage/user-id/40932",
                    "Jul 12, 2015"
                ],
                "Lucio Ricardo M": [
                    "/t5/user/viewprofilepage/user-id/2088510",
                    "May 16, 2018"
                ],
                "Eve L": [
                    "/t5/user/viewprofilepage/user-id/487441",
                    "Feb 17, 2017"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Shahinur A": [
                    "/t5/user/viewprofilepage/user-id/6752886",
                    "Oct 25, 2020"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "Jamiu I": [
                    "/t5/user/viewprofilepage/user-id/2282483",
                    "Jul 3, 2018"
                ],
                "Mary W": [
                    "/t5/user/viewprofilepage/user-id/12679",
                    "Nov 10, 2014"
                ],
                "Slavko A": [
                    "/t5/user/viewprofilepage/user-id/4285212",
                    "Sep 5, 2019"
                ]
            },
            "messages": {
                "Lena E": "We are releasing a new feature that introduces mid-job feedback into contracts. Clients will soon be able to leave public feedback for freelancers while a contract is ongoing. This feedback helps freelancers share the progress of a job and have it reflected in their work history before a contract has ended.Why we made this change:Gathering feedback on a contract only when the contract ends leads to a delay in gathering feedback on longer-term contracts. We hear from our customers that contracts are being closed for the sole purpose of providing feedback. Freelancers want feedback reflected in their work history and request clients to end contracts to provide feedback. This desire for feedback has led to unnecessary closure of contracts, and we would like to address the issue by facilitating optional public feedback throughout the contract (rather than only at the end of the contract). We also believe that multiple public feedback touchpoints will better communicate the progress of long-term ongoing contracts and reduce the number of contracts that close with no public feedback. We're also considering how we can incorporate mid-contract feedback into Job Success Scores (JSS), but for now, this feedback will not factor into your JSS.How it works:Public feedback (not private feedback) will be able to be provided from the client to the freelancer without ending a contract. Assuming the eligibility criteria noted below are met, a client will proactively be able to provide this feedback, OR a freelancer will be able to request feedback from the client. When a freelancer requests feedback, clients will have 14 days to provide the feedback.If feedback is not provided within this timeframe, the request expires, and a freelancer can submit another request assuming the eligibility criteria continue to be met. (We’re gradually rolling feedback requests out to freelancers. All clients will have the option to leave mid-job feedback, but only select freelancers will see the request feedback button at this time.)Eligibility Criteria: Feedback can be requested by the freelancer or provided by the client if the following criteria are met:Here are details about the new experience from both freelancer and client views. Only public feedback is gathered from the client as part of this mid-contract feedback flow. When feedback is provided, it will be shown in a freelancer’s work history. There are no impacts to JSS since mid-job feedback does not impact JSS.NEW FEEDBACK TAB:All feedback provided on a given contract (mid-contract and end-of-contract feedback) will be shown in a new Feedback tab of the Contract Room for both clients and freelancers.Feedback will also be displayed in freelancers’ work history under the active contract.The new flow is detailed belowFreelancer View (currently only select freelancers): If eligibility criteria are met, freelancers have a “Request Feedback” option in the new Feedback tab of the Contract Room.Client View: Clicking “Request Feedback” triggers an email and Dash message to the client with a request for feedback.Client View: Clients fill out this form to provide mid-contract feedback. The form includes only public feedback and not private feedback.Client View: Alternatively, when eligibility criteria is met, clients can choose to proactively provide feedback by clicking the “Give Feedback” button in the Feedback tab or in the overflow menu of the Contract Room. Clicking this",
                "David M": "Thank you for listening Upwork - this is a brilliant idea.Please communicate it properly to the clients though.Could you include in your messaging a reminder about the concept of milestones?There are many clients who frequently post new jobs but hire the same freelancer repeatedly.This results in wasted time (and connects) in unsuccessful job applications.If that same client simply created a new milestone each time they had another job for their current preferred freelancer, it would benefit everyone concerned (except Upwork due to loss of connect income). With this new solution allowing for jobs to stay open longer, this could work, however there needs to be some impact into the JSS.One question: You stated this: We hear from our customers that contracts are being closed for the sole purpose of providing feedback The reason freelancers wanted the feedback so desperately was because of the messy and secretive JSS calculations. I'm sure if you did a poll amongst freelancers asking them how feedback or JSS works the results would be all over the place. Failure to implement this change without it actually affecting the JSS is not only a waste of time but an irritation to clients. Are the rules for this mid-job feedback going to be the same as the post-job feedback - i.e. will freelancers and clients still have the ability (based on their earnings/status/tier badge they've earned) to delete the public feedback which everyone needs to see to make an informed decision?I find it bizarre that the ability to hide public feedback even exists - what is the actual point of the system especially with so many clients offering guaranteed 5 star feedback for low paying jobs?Another issue which desperately needs fixing, is being able to see feedback sorted by rating (not simply highest or lowest). The reason I say this is for any profile (client or freelancer) with many jobs, to find the last job they were badly rated on is extremely tedious - sometimes 40 pages of feedback need to be scrolled through, clicking next, next, next ad-nauseum, only to find something poorly rated (less than 5 stars) but then the actual PUBLIC feedback has been hidden! How is this user friendly? Please fix it! Look at Amazon for an example - you can easily choose to see the 1 star or the 2 star or the 5 star with a single click. Surely it can't be that hard to implement? Employ someone on the platform and get it done at a 20% discount.I realize you're simply the messenger, so before too many more questions get posted which you don't have the answers to, could the brains behind this new feature please introduce themselves and get some public feedback from both clients and freelancers to assist with yet another weird \"beta\" testing live-software-release-without-telling-anyone-until-it's-too-late which it seems Upwork is growing rather accustomed to of late.Maybe you could come up with surveys which could be sent to those freelancers with the new uber badge and actually pay them for their advice (in real money, connects, kudos, a coffee mug, or even just a thank you) to take part in the continuous changes you're so intent on implementing.Why we made this change:Gathering feedback on a contract only when the contract ends leads to a delay in gathering feedback on longer-term contracts. We hear from our customers that contracts are being closed for the sole purpose of providing feedback. Freelancers want feedback reflected in their work history and request clients to end contracts to provide feedback. This desire for feedback has led to unnecessary closure of contracts, and we would like to address the issue by facilitating optional public feedback throughout the contract (rather than only at the end of the contract). We also believe that multiple public feedback touchpoints will better communicate the progress of long-term ongoing contracts and reduce the number of contracts that close with no public feedback. We're also considering how we can incorporate mid-contract feedback into Job Success Scores (JSS), but for now, this feedback will not factor into your JSS.",
                "Lucio Ricardo M": "I see other drawback. There are clients that want jobs with milestones for $50 but that it ends up lasting 4 days. then, if they catch you in a bad day, they could punish you with feedback.",
                "Eve L": "Will this kind of feedback count towards the requirement to have at least one positive feedback on a large contract within the last 12 months to maintain or get the TR+ badge?",
                "Vladimir G": "Hi Eve,Thanks for the question. In short, no. With mid-contract feedback, we want to provide the opportunity to share feedback without having to end a contract.To clarify the Top Rated Plus requirement you mentioned, it's actually at least one large project in the last 12 months without negative feedback.",
                "Shahinur A": "my client is unable to write feedback. He wrote to me \"I'm sorry I wasn't able to send my feedback because upwork will only let me do that when it's a 30-day contract.\" whats the solution ?",
                "Aleksandar D": "Hi Shahinur,In order to leave a Mid-Job Feedback, 30 days need to pass since the start of the contract. If there is no more work to be done on the contract you are referring to, you can ask your client to end the contract and leave the feedback that way.Thank you.",
                "Jamiu I": "We hear from our customers that contracts are being closed for the sole purpose of providing feedback. Freelancers want feedback reflected in their work history and request clients to end contracts to provide feedback. This change doesn't really make any difference for the freelancer if the feedback doesn't count towards the JSS.If a potential client sees an ongoing job, there is a sense in which they believe that the contract is going on well at the moment. So, what's the essence of getting feedback for an ongoing contract if the feedback will have no effect on JSS?I think you should conduct another research to know the real reasons why freelancers will want to have a mid-contract feedback. Compare reasons like: (1) to have it count towards JSS (2) to have it listed in Work history etc. That should help in knowing the most important reason which this new change should seek to address.",
                "Mary W": "I can see this going very wrong. Contracts can get screwed up = bad mid term feedback. Client and freelancer get on same page = great final feedback. I can also see the blackmail clients drooling over this option. Bless their hearts.",
                "Slavko A": "So the finall score will be :Mid-Job Feedback score 5.0Mid-Job Feedback score 4.8Mid-Job Feedback score 3.0Mid-Job Feedback score 4.2End contract Feedback score 5.0And job score wich will be JSS counted will beaverage value of all score : 4.4Or will be overstrength buy End contract Feedback score : 5.0???"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/New-Real-Time-Process-for-Freelancer-U-S-Location-Verification/td-p/379266": {
            "title": "New Real-Time Process for Freelancer U.S. Location Verification",
            "post_date": "Aug 1, 2017  12:55:04 PM",
            "edit_date": "Nov 9, 2017  11:12:17 AM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Scott B": [
                    "/t5/user/viewprofilepage/user-id/66882",
                    "Nov 20, 2015"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Tiffany S": [
                    "/t5/user/viewprofilepage/user-id/73341",
                    "Jan 15, 2016"
                ],
                "Asher F": [
                    "/t5/user/viewprofilepage/user-id/1289749",
                    "Oct 18, 2017"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Lisa A": [
                    "/t5/user/viewprofilepage/user-id/522084",
                    "Mar 3, 2017"
                ]
            },
            "messages": {
                "Lena E": "As previously announced here, we are testing out location specific job posts and currently allow clients in the U.S. to post jobs exclusively for U.S.-based freelancers. Some freelancers have been asked to verify their location before they submit their first proposal on these jobs, and we’ve heard feedback from some of you that the process for completing this step can be cumbersome. We’re happy to announce that we're replacing the bank account verification process with a new, simpler method for freelancers in the U.S. to verify their location in real-time, using a current state-issued ID, US passport or green card. The process is easy and immediate, with only two steps. Step 1: Confirm your name, Step 2: Upload an image of your state ID, US passport, or green card. That’s it.If you’re prompted to complete this verification, once you’ve followed the instructions and completed the requests you’ll see a confirmation message directly on the same Upwork page. See screenshots of the process below and let us know if you have any questions.Step 1:Step 2:Results:",
                "Scott B": "Hi Lena -Can someone speak to privacy and security around this? I assume UW is using a 3rd party to process this information and provide the validation. How is this data being transmitted to them? How is this data being stored and who has access to it? How would someone go about removing or updating this information if it is being stored?Obviously these ID's contan PII and as such there should be information readily available about how it will be used and protected.Thanks.",
                "Valeria K": "Scott,Yes, any data will be encrypted and securely processed by a third party company. Your image will not be stored by Upwork. Please note that if you don’t want to upload your ID you can still use Upwork to submit proposals for all other job posts except for those with a U.S.-location requirement. ",
                "Avery O": "Hi Scott,You may read more about our Privacy Policy here. Here's Section 7 regarding Securityof our Privacy Policy:\"Upwork takes commercially reasonable steps to help protect and secure the information it collects and stores about Upwork Users. All access to the Site is encrypted using industry-standard transport layer security technology (TLS). When you enter sensitive information (such as tax identification number), we encrypt the transmission of that information using secure socket layer technology (SSL). We also use HTTP strict transport security to add an additional layer of protection for our Upwork Users. But remember that no method of transmission over the Internet, or method of electronic storage, is 100% secure. Thus, while we strive to protect your personal data, Upwork cannot ensure and does not warrant the security of any information you transmit to us.\"",
                "Tiffany S": "Hi Scott,You may read more about our Privacy Policy here. Here's Section 7 regarding Securityof our Privacy Policy:\"Upwork takes commercially reasonable steps to help protect and secure the information it collects and stores about Upwork Users. All access to the Site is encrypted using industry-standard transport layer security technology (TLS). When you enter sensitive information (such as tax identification number), we encrypt the transmission of that information using secure socket layer technology (SSL). We also use HTTP strict transport security to add an additional layer of protection for our Upwork Users. But remember that no method of transmission over the Internet, or method of electronic storage, is 100% secure. Thus, while we strive to protect your personal data, Upwork cannot ensure and does not warrant the security of any information you transmit to us.\"But, if you're using a third-party company for verification, then it isn't Upwork's privacy policy and storage that's at issue.",
                "Asher F": "No Valeria,I think you must remove this requirement. You already have my IP address which shows exactly which location in US I am loggin in from. I just don't feel comfortable about my most personal information to be living somewhere on the webspace.",
                "Preston H": "re: \"You already have my IP address which shows exactly which location in US I am loggin in from.\"The IP address means nothing. People spoof these through a variety of methods.",
                "Petra R": "That's just fine, nobody is forcing you to do so, and the great news is that if you decide not to, you are no worse off than the million of us who don't even see the US-only jobs.",
                "Lisa A": "The suggestion to upload a passport or greencard is also ridiculous. Yea, I'm going to upload my passport to a site that uses third party software (no thanks). I don't trust that this information being uploaded is kept private. There has to be another way to verify location. Plus, it changes your name on your profile. I noticed that there aren't many people who have full names on their profiles, so, does that mean they've not uploaded drivers' licenses, etc?"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Faster-payouts-for-hourly-contracts/td-p/739876": {
            "title": "Faster payouts for hourly contracts",
            "post_date": "May 4, 2020  05:53:24 AM",
            "edit_date": "May 5, 2020  12:24:23 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Karen H": [
                    "/t5/user/viewprofilepage/user-id/24701",
                    "Apr 29, 2015"
                ],
                "Prem C": [
                    "/t5/user/viewprofilepage/user-id/5673",
                    "Dec 9, 2012"
                ],
                "Stacey R": [
                    "/t5/user/viewprofilepage/user-id/5592196",
                    "May 4, 2020"
                ],
                "Gopal G": [
                    "/t5/user/viewprofilepage/user-id/570082",
                    "Mar 20, 2017"
                ],
                "Joseph T": [
                    "/t5/user/viewprofilepage/user-id/5293801",
                    "Mar 27, 2020"
                ],
                "Moudud A": [
                    "/t5/user/viewprofilepage/user-id/570324",
                    "Mar 20, 2017"
                ],
                "Will L": [
                    "/t5/user/viewprofilepage/user-id/40642",
                    "Jul 9, 2015"
                ],
                "Heather H": [
                    "/t5/user/viewprofilepage/user-id/3081",
                    "May 9, 2011"
                ],
                "Jessica S": [
                    "/t5/user/viewprofilepage/user-id/68851",
                    "Dec 4, 2015"
                ]
            },
            "messages": {
                "Lena E": "We have heard from many in our community that you need your earnings faster, especially now. Today, we are happy to announce that all Top Rated freelancers and agencies working on hourly contracts are eligible to receive their funds five days earlier. This is because we are eliminating the security hold on their payouts.For Top Rated agencies and freelancers, the earnings for hours that you worked last week will be available to manually withdraw this Friday. You will see a notification under your bell icon and receive an email about the updated payment schedule for your hourly contracts for this week.Because this is for Top Rated agencies and freelancers, the early release of funds will depend on when you currently have the Top Rated badge. If you lose or earn the Top Rated status during this time, your payment schedule will be adjusted to include or exclude the security hold.How does it work?As long as your client’s billing method can be charged successfully and they don’t dispute your hours, we will apply their payment to your Upwork account five days earlier than before if you are Top Rated. You can then withdraw the money anytime you prefer by clicking here and choosing “Get Paid Now.” Note: If you have an automatic payment schedule set up, this will not adjust the schedule, so if you want your earnings sooner, you also can use “Get Paid Now.”Why are we only rolling this out to Top Rated freelancers and agencies?We know that many of the talent on Upwork would benefit from receiving their earnings faster. However, during these unprecedented times, changing our policies also creates a higher risk of fraud. Due to the potential risk, we are initially rolling this out to the marketplace’s most successful freelancers and agencies—those who are Top Rated. In the future, we will consider expanding this to other freelancers.Why do we have a 10-day wait in the first place?There is an inherent risk in payment processing, driven by the potential of fraudulent people, disputes, and chargebacks. We also need to give clients time to review their freelancer’s billed hours and project progress before payment is released. But in these unusual times, we understand how important it is for you to get payouts as quickly as possible. As a result, we are willing to take on additional risk and remove the security-hold period for Top Rated freelancers and agencies so you can get your money five days sooner.Will this be available only during COVID-19?While we plan to continue the practice after the COVID-19 pandemic ends, we will be monitoring the impacts of this change.Why is this only available for earnings on hourly contracts and not fixed-price contracts?With faster payments we decided to focus on the removal of security holds from hourly contracts first because the majority of contracts on Upwork are hourly. We understand faster payments will be a benefit for all contract types and we plan to explore making fixed-price payments faster in the future.Upwork is dedicated to our community, and all of our teams are focused on keeping independent professionals working. Please visit our Help Center article for more details and let us know if you have any additional questions.",
                "Karen H": "Thank you! You have my kudos.",
                "Prem C": "",
                "Stacey R": "",
                "Gopal G": "",
                "Joseph T": "",
                "Moudud A": "Its great...",
                "Will L": "Today Upwork sent out notice to Top Rated freelancers and agencies that \"we've eliminated our security hold...(so they) are eligible to receive their earnings five days faster.\"Thank you, Upwork!",
                "Heather H": "Only for hourly contracts, so it is a benefit for some top-rated and agencies, not all. Those of us that are top-rated but work in a niche that is mainly fixed price see no changes. Yay, I guess. I still never understood why there is an extra holding period when escrow is pre-funded.",
                "Jessica S": "Only for hourly contracts, so it is a benefit for some top-rated and agencies, not all. Those of us that are top-rated but work in a niche that is mainly fixed price see no changes. Yay, I guess. I still never understood why there is an extra holding period when escrow is pre-funded.Yep.. this is me. I only work on fixed rate contracts where the money can sit in escrow for weeks or longer and then yet another 5 days when the project is complete. I can't figure out why they won't release the funds earlier and am disappointed this was not included in this update."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/2020-TOS-Updates/td-p/849771": {
            "title": "2020 TOS Updates",
            "post_date": "Dec 21, 2020  01:12:07 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Jennifer M": [
                    "/t5/user/viewprofilepage/user-id/28061",
                    "May 17, 2015"
                ],
                "Jennifer S": [
                    "/t5/user/viewprofilepage/user-id/15216",
                    "Dec 5, 2014"
                ],
                "Tarpinder S": [
                    "/t5/user/viewprofilepage/user-id/10821",
                    "Oct 31, 2014"
                ],
                "Maria T": [
                    "/t5/user/viewprofilepage/user-id/65903",
                    "Nov 12, 2015"
                ],
                "Yury M": [
                    "/t5/user/viewprofilepage/user-id/90306",
                    "May 4, 2016"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ]
            },
            "messages": {
                "Lena E": "We’ve updated portions of our Terms of Service to incorporate recent changes to our service offerings and to clarify a few things, including our Dispute Assistance Program.Our updated Terms of Service were posted today and all updates will take effect today, December 21, 2020, for all users that continue to use the Upwork site or services, with the exception of the updated Fixed Price Service Contract Escrow Instructions, which apply to any fixed price service contracts entered into after today.What’s changed?We’ve updated the User Agreement, the Terms of Use, the Optional Service Contract Terms, and our Fixed Price Escrow Instructions for service contracts. The purpose of these changes is to incorporate service offerings that we’ve recently rolled out and to improve the clarity and readability of our Terms of Service. Here is a snapshot of the updates for you to be aware of.The biggest news is that, with the addition of Project Catalog, we have updated our Fixed Price Escrow Instructions by:The specific updates we’ve made to the Disputes Assistance Program process for Fixed Price service contracts include:We have also made updates to our resource article “Facts About Disputes”, to reflect these changes.We also made a few minor changes to other portions of the Terms of Service. Specifically:With the exception of the updated escrow instructions, these updated terms apply to all users who continue to use the Upwork site or services after the terms are posted today. The updated escrow instructions apply to any fixed-price service contracts entered into after the updated escrow instructions are posted today.Please review these updates carefully, and thank you for being a part of the Upwork Community.",
                "Jennifer M": "Hi Lena,Does this mean that clients can no longer request all money back on the contract by funding a new milestone? It sounds to me that they can't dispute after a milestone has been released for over 30 days, but what if it's been 45 days (for instance) after milestone 1 has been released, but the client funds a new milestone B. Can they now request dispute of the entire amount or only milestone B?",
                "Jennifer S": "Hi Jennifer,Great question. A client can request a refund on paid funds at any time, however it is up to you as the freelancer to authorize it. Filing a dispute does not mean paid funds will be automatically refunded. Technically speaking, if there are funds held in Escrow, the entire contract would be eligible for Dispute Assistance, which includes the option of Arbitration. The goal of Dispute Assistance would be to reach a mutual agreement between both parties. If an agreement cannot be reached, the contract could proceed to Arbitration in which a legal ruling would determine what happens to both the funds held in Escrow and previously paid.However, I think I understand what you are asking. Can a client fund a new milestone in an attempt to get a refund on past paid funds? While yes, funding a milestone makes the entire contract eligible for Dispute Assistance, we also have systems in place to identify abuse of the Dispute Assistance program. This scenario is rare and one that is usually very obvious and would be handled appropriately on an individual basis.Delayed milestones or additional work needed after 30 days from releasing the first milestone, happen all the time. The functionality of Escrow allows long term jobs to proceed at the cadence required for the specific project.",
                "Tarpinder S": "6.2 DISPUTE OF FUNDS RELEASED Section A: Dispute Mediation Deadline: Dispute Mediation must be initiated within 30 calendar days of the date that funds in Escrow have been released from Escrow to the Freelancer in order to be eligible for the Dispute Assistance Program under this Section 6.2. Any dispute over funds that have been releasedfrom Escrow more than 30 calendar days prior to the date the dispute is filed is no longer eligible for submission to the Dispute Assistance Program.Then why this, the above clearly statesany dispute over funds that have been releasedfrom Escrow more than 30 calendar days prior to the date the dispute is filed is no longer eligible for submission to the Dispute Assistance Program.",
                "Maria T": "6.2 DISPUTE OF FUNDS RELEASED Section A: Dispute Mediation Deadline: Dispute Mediation must be initiated within 30 calendar days of the date that funds in Escrow have been released from Escrow to the Freelancer in order to be eligible for the Dispute Assistance Program under this Section 6.2. Any dispute over funds that have been releasedfrom Escrow more than 30 calendar days prior to the date the dispute is filed is no longer eligible for submission to the Dispute Assistance Program.Then why this, the above clearly statesany dispute over funds that have been releasedfrom Escrow more than 30 calendar days prior to the date the dispute is filed is no longer eligible for submission to the Dispute Assistance Program.yeah, it's tricky and cleverly worded. Another reason I only work hourly. I just keep accumulating reasons for avoiding escrow at this point.Why Upwork doesn't write the TOS so that we can understand them?And no longer because of the language (something very important), but because I am sure that even many English speakers cannot understand what is being said.I do not understand anything, and specifically the points about disputes, mediations, etc ...",
                "Yury M": "It would be nice if you do english-russian translation soon.",
                "Valeria K": "Hi Yury,We already have the translation of the updated TOS in the works and will make it available to users according to this process as soon as possible."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Action-Needed-for-Freelancers-to-Update-PayPal-info/td-p/774526": {
            "title": "Action Needed for Freelancers to Update PayPal info",
            "post_date": "Jun 29, 2020  02:14:01 PM",
            "edit_date": "Jun 29, 2020  03:37:18 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Joseph D": [
                    "/t5/user/viewprofilepage/user-id/32672",
                    "Jun 22, 2015"
                ],
                "Tom L": [
                    "/t5/user/viewprofilepage/user-id/29111",
                    "May 30, 2015"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "Nikita A": [
                    "/t5/user/viewprofilepage/user-id/900846",
                    "Jul 17, 2017"
                ],
                "Gail S": [
                    "/t5/user/viewprofilepage/user-id/2801808",
                    "Oct 26, 2018"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ]
            },
            "messages": {
                "Lena E": "We recently updated our PayPal flow to ensure your PayPal accounts are more secure when receiving payments with Upwork. We are asking all freelancers that use PayPal to update their Upwork payment information before July 7th to avoid any payment interruptions.Updating your account is very simple, and will help ensure the safe transfer of your funds. We will be notifying all active freelancers with a PayPal withdrawal method through email and with an alert bar on your “Get Paid” page.To get started, you will need to reactivate your current PayPal account. You can do this by clicking the link to connect your PayPal from the alert bar or email. Alternatively, you can click the “reactivate” link displayed on your PayPal payment method on the Get Paid page. Note that when completing this connection to PayPal there is a 3-day security hold.Follow the steps below for guidance on how:1. Click reactivate under your current PayPal account or click \"connect your PayPal account to Upwork\" in the alert message shown on your \"Get Paid\" page.2. To Connect your PayPal to Upwork you will be prompted to re-add your PayPal account, click continue.3. You will then be prompted to re-add your PayPal by clicking Set Up4. This will redirect you to the PayPal login where you will then securely connect your PayPal account to Upwork.5. Log in with your PayPal email and password and allow Upwork access to your basic non-financial account information- your name, email, and address, account verification status and PayPal ID.6. You will then be redirected to Upwork and you’re all set!Freelancers will be required to update this information to use PayPal on Upwork. We will be notifying active freelancers via email, along with a pop-up displaying on your Get Paid page. You can find more details in the Help Center article. ",
                "Joseph D": "Updating your account is not simple if you have a different paypal address. This is silly. Just another comlication with no added security.",
                "Tom L": "Hi Joseph,I feel your pain, I have been on Upwork since 2008.Maybe you just have to legally change your name to work here nowWhen I started on Upwork, well oDesk in the good old days, I just signed up a Tom, not Thomas, which is my Paypal.That said, I did contact support this morning and asked to have my name on Upwork changed, they have all my ID requests from the 1000 times before.They have done it for me and my Paypal is good now.I don't often say it, but good job support team, thanks.",
                "Aleksandar D": "Hi all,Rest assured that we are currently reviewing and processing name mismatch errors as quickly as possible. Apologies for the delay. However, to avoid a name mismatch error, you must make sure that yourverified nameon Upwork matches the name on your PayPal account. If you haven't verified your name yet, to avoid further delay, be sure that your profile name matches the name on your PayPal account.Also, please note that when reconnecting your PayPal account you will not be able to withdraw to the account until after a 3-day hold. If you need your funds right away, we recommend that you do not reconnect until after you withdraw those funds.We understand this is an inconvenience so we will not deactivate accounts that have not been reconnected until July 7th, giving you time to plan your withdrawals around this 3-day hold.Thank you.",
                "Nikita A": "Hi Aleksandar.Thanks for quick fix this issue with mismatch in manual mode.Best wishes",
                "Gail S": "My Account has just been deactivated because 'names do not match'I have been on Upwork for 6 years with verifed ID etcPlease can someone help",
                "Vladimir G": "Hi Gail,I checked and can confirm you completed the process correctly.If you have received a name mismatch error when reconnecting your PayPal account, rest assured that we are currently reviewing and processing name mismatch errors as quickly as possible. To avoid a name mismatch error, you must make sure that yourverified nameon Upwork matches the name on your PayPal account. If you haven't verified your name yet, to avoid further delay, be sure that your profile name matches the name on your PayPal account.\""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Freelancers-can-propose-new-contracts-with-existing-clients/td-p/356690": {
            "title": "Freelancers can propose new contracts with existing clients",
            "post_date": "Jun 10, 2017  02:51:51 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Amanda F": [
                    "/t5/user/viewprofilepage/user-id/45058",
                    "Aug 8, 2015"
                ],
                "MD Rasel S": [
                    "/t5/user/viewprofilepage/user-id/82531",
                    "Apr 3, 2016"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Rolando Jr G": [
                    "/t5/user/viewprofilepage/user-id/871851",
                    "Jul 11, 2017"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Yurguen B": [
                    "/t5/user/viewprofilepage/user-id/792068",
                    "Jun 14, 2017"
                ],
                "Kim W": [
                    "/t5/user/viewprofilepage/user-id/69636",
                    "Dec 10, 2015"
                ]
            },
            "messages": {
                "Lena E": "A few months ago, we invited some of you to try a new function that lets freelancers suggest follow-up projects with clients you’ve worked with before. We heard some great feedback from users here in the forums and through other communication channels. You told us that although this was a good idea, you would rather propose a new contract on the Upwork site instead of through an email link as we were providing. You also wanted freelancers to have the ability to create a contract for hourly or fixed-price projects, which clients could simply review and approve. We thought this would be a good idea too, and would perhaps reduce the friction that we sometimes hear from clients and freelancers when trying to rehire for another job. So, in the coming weeks we’ll be releasing a new feature that gives freelancers the ability to propose a new contract with an existing client, straight from the My Jobs page. Freelancers, once you’ve discussed further opportunities and projects with your client and have agreed on starting a new contract, you can send them a proposed contract by clicking the “Propose New Contract” button from a contract in your My Jobs or All Contracts pages. The contract form allows freelancers to set up the contract as hourly or fixed price with proposed milestones. Clients can then simply accept, decline or edit the proposal which will then send an offer back to the freelancer.Thanks for your feedback, we hope you enjoy this new feature. Let us know if you have any questions. ",
                "Amanda F": "excellent feature!",
                "MD Rasel S": "Very helpful feature but still now features are not available.",
                "Vladimir G": "Hi MD Rasel,If you're referring to the feature from this announcement, it scheduledto be released in the next few weeks.",
                "Rolando Jr G": "Hello vladimir,My client has two active contracts with me, will he be able to merge the two contracts?because they have the same contract agreement, they only differ in hourly rate,or shall he end the previous contract?",
                "Valeria K": "Unfortunately, you won't be able to merge the two contracts, Rolando. You can have the client end one of the contracts and use the other one.",
                "Yurguen B": "Great! I was waiting for this and now I'm looking forward to it!",
                "Kim W": "Lena, there should be away to propose contracts to anyone that we Upwork message with and not just those that we have have worked with previously. I have found that after messaging with people in order to learn more about their project needs that the next step is to propose the terms of a contract. Being able to immediately propose contract terms to them in a way that they can easily accept would be a great additional feature.Thanks."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Payoneer-Prepaid-Mastercard-Concerns/td-p/774379": {
            "title": "Payoneer Prepaid Mastercard Concerns",
            "post_date": "Jun 29, 2020  09:50:26 AM",
            "edit_date": "Jun 26, 2020  10:40:05 AM",
            "contributors": {
                "Milorad M": [
                    "/t5/user/viewprofilepage/user-id/5966799",
                    "Jun 26, 2020"
                ],
                "Cesar P": [
                    "/t5/user/viewprofilepage/user-id/1627213",
                    "Jan 17, 2018"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Arcangela A": [
                    "/t5/user/viewprofilepage/user-id/16236",
                    "Dec 25, 2014"
                ],
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Jenny G": [
                    "/t5/user/viewprofilepage/user-id/28890",
                    "May 28, 2015"
                ],
                "Shirley H": [
                    "/t5/user/viewprofilepage/user-id/175018",
                    "Sep 29, 2016"
                ]
            },
            "messages": {
                "Milorad M": "Given the current information I have Payoneer service do not work nor withdrawing money is possible. This has been tested and confirmed.I'm here asking Upwork to tell us how they stand on the current Wirecard situation and how will that reflect on the entire platform considering the immense implications it has on the freelance businesses.Also, it would probably be smart to halt all auto-withdrawals from Upwork to Payoneer since noone actually knows what will happen and thus potentially save their own users hassles later on.",
                "Cesar P": "I'm on the same situation and they haven't even gave a time of how much this hold will take.",
                "Petra R": "Given the current information I have Payoneer service do not work.I've just this minute used the card on Amazon and so far haven't seen an issue?Just got the message that the payment didn't go through ",
                "Arcangela A": "Please Upwork, evaluate and activate other options. It is a good time to evaluate other payment methods.Thank you",
                "Valeria K": "Hi All,We're currently looking into this situation and will be providing an update once we have more information. I'll be back to update this thread as soon as possible.",
                "Jenny G": "",
                "Shirley H": "See other recent messages for answers."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/VAT-Charges-for-Belarus-Freelancers-and-Agencies/td-p/561065": {
            "title": "VAT Charges for Belarus Freelancers and Agencies",
            "post_date": "Feb 6, 2019  08:35:51 PM",
            "edit_date": "Feb 27, 2019  02:33:19 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Aleksandr S": [
                    "/t5/user/viewprofilepage/user-id/32167",
                    "Jun 22, 2015"
                ],
                "Igor L": [
                    "/t5/user/viewprofilepage/user-id/3313146",
                    "Feb 13, 2019"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Yuri H": [
                    "/t5/user/viewprofilepage/user-id/39020",
                    "Jun 26, 2015"
                ],
                "Anatoli B": [
                    "/t5/user/viewprofilepage/user-id/6835242",
                    "Nov 7, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Lena E": "Starting March 1st, Upwork will begin charging VAT on our fees to freelancers and agencies in Belarus. A Value Added Tax law was introduced in Belarus which applies to fees charged for electronic services from non-Belarusian businesses (like Upwork) to Belarusian consumers.If you are a freelancer or agency on Upwork who is operating as a separate legal entity in Belarus, Upwork will not charge you VAT. To confirm whether or not you are a legal entity, we will begin asking freelancers and agencies in Belarus to enter their Taxpayer Identification Number (TIN). We will be notifying all freelancers and agencies in Belarus via email. You will also see a notification when logging in.Here’s a simple example of how it would work, assuming the a 20% Upwork service fee:Your contract amount$100.00Upwork service fee (including VAT)Upwork’s service fee is $100 x 20% = $20 E-services VAT to be paid to the Belarus government by Upwork is $20 x 20% = $4Total fees including VAT is $20 + $4 = $24 -$24.00Take-home earnings after service fees and VAT$76.00In other words, considering the example above, the user will only be charged VAT on the $20 freelancer service fee, so 20% of $20 means they will be charged $4 for VAT. These amounts will appear on invoices and in your Transaction History and will be calculated in U.S. Dollars.If you have questions regarding your tax obligations, please consult your tax advisor. For more information on Upwork charging VAT, see this help article. For more information on VAT laws in Belarus, see here. Let us know if you have any additional questions. ",
                "Aleksandr S": "Not that I'm willing to pay more fees and taxes, but I hope you'll soon introduce similar rules for Russian freelancers as well.",
                "Igor L": "WIll upwork share personal info (login/name) withMinistry of Taxes and Duties of Belarus?",
                "Vladimir G": "HiAleksandr, thanks for raising this question,this is definitely on our immediate roadmap.Our team is working on updating the system and will be enabling VAT for customers located in Russia. We will be following up with an update once this goes live.",
                "Yuri H": "Not the best news. I have seen already deductions from my account.The Tax Law in Belarus is called “VAT by foreign companies supplyingcross-borderonline services to private consumers in the Republic of Belarus”. The foreign company is UpWork. Not me. Why the freelancers need to pay this tax? So, the correct example need to be:Contract amount - $100.00Upwork’s service fee is $100 x 20% = $20 E-services VAT to be paid to the Belarus government by UpWork is $20 x 20% = $4Total fees includingVATis $16 +$4= $20Take-home earnings after service fees and VAT - $80.00It kills the idea of remote working. You need to pay about a quarter of your income. That’s mean you work one week for nothing. Plus, some bank, wire transfer, debit cards fees… May be it will be more profitable to find clients in your own city or country.I work as a legal entity for about couple of years. I am not a private consumer. I have sole proprietorship or individual entrepreneurship (Индивидуальный предприниматель). I have tried to add my TIN (УНП) but it was declined. I don’t know why.",
                "Anatoli B": "I refuse to support the government of the Belarus that tries to remain in power by applying terror and violence after failing to win the elections by vote counting in August 2020. As this is my personal choice, I would like to deal with this myself. Can you exclude me from your VAT processing agreement?",
                "Andrea G": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Announcements/Fix-Push-Notification-Issues-on-the-Android-App-for-Freelancers/td-p/599189": {
            "title": "Fix Push Notification Issues on the Android App for Freelancers",
            "post_date": "May 23, 2019  08:34:40 AM",
            "edit_date": "May 24, 2019  10:53:02 PM",
            "contributors": {
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Rosalito U": [
                    "/t5/user/viewprofilepage/user-id/717908",
                    "May 21, 2017"
                ],
                "Manbeena B": [
                    "/t5/user/viewprofilepage/user-id/3811988",
                    "May 30, 2019"
                ],
                "Natalie H": [
                    "/t5/user/viewprofilepage/user-id/3947627",
                    "Jun 28, 2019"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Kirill P": [
                    "/t5/user/viewprofilepage/user-id/4184408",
                    "Aug 16, 2019"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Ivana S": [
                    "/t5/user/viewprofilepage/user-id/4252293",
                    "Aug 29, 2019"
                ],
                "Hasan Md. H": [
                    "/t5/user/viewprofilepage/user-id/4508712",
                    "Oct 21, 2019"
                ]
            },
            "messages": {
                "Lena E": "Since releasing Upwork’s Android app for freelancers and agencies in April 2019, our community has reported issues with receiving notifications for job invitations and new messages, or would only receive them once the app is launched. This is because some Android device manufacturers like Xiaomi, Oppo, One Plus, Vivo, Lenovo, Huawei, Samsung, and a few others, customize their operating systems (known as stock ROMs). When the app is cleared on such a device, it kills the app and its background services, which ultimately disables push notifications. If you’re experiencing issues with notifications, find your device brand below and try taking the following steps to manually enable the auto-launch feature for background services:SamsungHuaweiXiaomiOppoVivoLenovoOpen Settings and select Background app management. Allow the Upwork for Freelancers app to start up in the background.One plusPlease note: because this issue is specific to certain stock ROMs and is not a native Android feature, the terminology used by each manufacturer is different and the auto-launch settings page is located in different places for certain devices. If the problem still persists, please let us know by leaving a comment on this post so we can help you resolve it. As always, if you have any feedback or suggestions for how we can make Upwork’s new Android app for freelancers and agencies even better, please let us know by leaving a comment below.",
                "Rosalito U": "Thanks, Currently using OPPO. hopefully. This Helps.",
                "Manbeena B": "",
                "Natalie H": "",
                "Bojan S": "HiNatalie,I'll check this with our team and get back to you once we have more information. We appreciate your patience while we look into this.Edited to add:Could you please follow instruction shared hereand let us know if it helped.Thank you.",
                "Kirill P": "Hi Team!Hope this finds you well!Please integrate with Telegram for notifications and, maybe two-step verification alsoAll the best,Kirill",
                "Vladimir G": "Hi Kirill,We appreciate your suggestion. We aren't aware of any plans to integrate the app with other tools or services. If anything changes in this area, we'll make sure to inform the Community.",
                "Ivana S": "",
                "Hasan Md. H": "Thank you so much for the writing. "
            },
            "moderated": false
        }
    },
    "https://community.upwork.com/t5/Freelancers/bd-p/freelancers": {
        "https://community.upwork.com/t5/Freelancers/Upwork-New-Freelancer-Webinar-Earning-More-on-Upwork/td-p/523059": {
            "title": "Upwork New Freelancer Webinar:  Earning More on Upwork",
            "post_date": "Sep 17, 2018  08:50:29 AM",
            "edit_date": "Apr 2, 2020  03:02:39 PM",
            "contributors": {
                "Drew M": [
                    "/t5/user/viewprofilepage/user-id/76038",
                    "Feb 8, 2016"
                ],
                "Dianne M": [
                    "/t5/user/viewprofilepage/user-id/6625",
                    "Jul 25, 2013"
                ],
                "Garnor M": [
                    "/t5/user/viewprofilepage/user-id/11",
                    "Oct 29, 2014"
                ],
                "Vinayachandran B": [
                    "/t5/user/viewprofilepage/user-id/3260150",
                    "Feb 2, 2019"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Umair U": [
                    "/t5/user/viewprofilepage/user-id/5131425",
                    "Mar 1, 2020"
                ],
                "Mohammed K": [
                    "/t5/user/viewprofilepage/user-id/4786393",
                    "Dec 18, 2019"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ]
            },
            "messages": {
                "Drew M": "Jump start your business using Upworkwith a live, interactive webinar in 2020!Join us for one of our free webinars hosted by an Upwork Team Member. If you can't attend or want to view the recording, click on any of the links and register and you will be able to view the recording!This webinar is called:\"Earning More on Upwork.\" During this webinar, you'll:To register for our \"Earning More on Upwork\" webinar, click one of the links below:If you'd like to view a recording of the content with Closed Captions, you can find it here.Hope to see you there!",
                "Dianne M": "this is great Lillian!I truly kudos oDesk for this. This should help a lot of newbies.Are old-timers welcome to join too?",
                "Garnor M": "Absolutely Dianne, any and all freelancers are welcomed to join.",
                "Vinayachandran B": "Sorry, we were unable to save your application.why? can you help me",
                "Goran V": "HiVinayachandran,I checked your account and was not able to replicate the problem, please try clearing your cache and cookies or logging in with another browser. If you`re still having the same problem please send me a screenshot from your end via PM (click on my name). Thank you.",
                "Umair U": "Hi Goran,Can you please help me in some problem related to the contract?Thanks!Umair",
                "Mohammed K": "i am new here please help",
                "Avery O": "Hi Mohammed,How can our team help you today?"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Client-location-for-engineering-work/td-p/861516": {
            "title": "Client location for engineering work",
            "post_date": "Jan 20, 2021  11:37:50 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Matthew M": [
                    "/t5/user/viewprofilepage/user-id/7299889",
                    "Jan 20, 2021"
                ],
                "Mary W": [
                    "/t5/user/viewprofilepage/user-id/12679",
                    "Nov 10, 2014"
                ]
            },
            "messages": {
                "Matthew M": "Upwork should require the client to post what state they are in for engineering work. Professional engineers can only provide services in states which we are licensed (based on the client's location). Is there any way to ask for more information (like specific location) without submitting a proposal?",
                "Mary W": "You can ask in your proposal. You can also re-word your profile to make it clear that you are only licensed to work in Louisiana at this time. Take a look at other engineers' profiles and see what they say."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Personalized-link-to-invite-existing-clients/td-p/861585": {
            "title": "Personalized link to invite existing clients",
            "post_date": "Jan 20, 2021  03:22:43 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Dushan P": [
                    "/t5/user/viewprofilepage/user-id/4002963",
                    "Jul 9, 2019"
                ]
            },
            "messages": {
                "Dushan P": "Hi!Can you please give me a link to invite clients to UpWork with a benefit of 0% commission when hired by them?Best regards,Dushan"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Dispute-Arbitration/td-p/861222": {
            "title": "Dispute/Arbitration",
            "post_date": "Jan 19, 2021  11:45:03 PM",
            "edit_date": "Jan 19, 2021  11:58:37 PM",
            "contributors": {
                "George P": [
                    "/t5/user/viewprofilepage/user-id/6624070",
                    "Oct 1, 2020"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ],
                "Jennifer M": [
                    "/t5/user/viewprofilepage/user-id/28061",
                    "May 17, 2015"
                ]
            },
            "messages": {
                "George P": "Hi there everyone,I've never asked for advice from this community yet, but I've seen plenty of great answers from very knowledgeable people. I hope someone could provide some quality advice, as I truly would appreciate that.I tried not to be too lengthy here, but I also think this issue needs a bit of context.The issue that I currently face:I got contracted for $1,000 to do a Do-It-With-You consulting work package to help an insurance broker and ex. FINRA arbitrator ( the fact that he is an arbitrator is very relevant ) leverage LinkedIn as a platform, and learn to generate leads through a non-paid marketing approach.The job post & scope of work were as follows:**Edited for Community Guidelines**I delivered a 26-page guide + workbook, which also included the flow chart - and a total of 3.5hrs of 1-on-1 screen share video meetings vs. the 1HR agreed upon ( out of my generosity, because I truly believe in going above & beyond for my clients ), to make sure the set-up & consulting work will be concluded successfully.Client was seemingly happy when the work was done, the 2 funded milestones were approved & released at this stage, and I even offered BONUS support for another 14 days + a monthly check-in for the next 90 days to make sure the lead generation system I helped him set-up & coached on will work successfully for him.However, within 48hrs later, I wake up to an open dispute from this client, where he request a full refund because apparently, I have never done my job. He's an ex. FINRA arbitrator himself, and is trying very hard to reach and make his case.BUT not only did I over-deliver ( deliverables required + 3.5X more time than initially agreed upon ) - he's making false accusations ( which by the way blatantly contradict his own job post + our consulting time is video documented and proves his false claims ), he's also wanting to keep me responsible for things completely out of my control - such as a temporary hold on his account with the software tool I recommended ( most likely he did not follow the best practices recommended by me ), or the fact that he doesn't own anything.I DO NOT own that software company I recommended, I do NOT own & control LinkedIn's choices for client's profile either, and most marketing agencies & freelancers have built their entire business on other people's platforms. It was well communicated from the outset, yet he's trying to make his case for a refund with silly points like this.In this case - we couldn't get to an agreement in the mediation phase, and our mediation specialist suggests we escalate to arbitration.I know I'm 100% within the scope of work & I delivered successfully, client seems to have a very 'litigious' attitude & practices lots of legal threats and intimidation tactics - but by no means I want to waste my time & money on an arbitration process where I can still lose money, even if I win, due to the arbitration fees.My question, in this case, is - can I refuse the proposed agreements by our mediation specialist, and then also refuse to participate in the arbitration process? Or am I obligated to participate & pay arbitration fees if we did NOT reach a mutual agreement in the mediation phase?I'm 99.9% sure arbitration would go in my favor - however, I do not want to waste money & time on the process, and have my Upwork account on temporary hold until the issue is being solved - but I also can't let a 'bully' client use intimidation tactics to obtain a refund, in the eventuality of 0.01% he'd win the arbitration just because he used to be a FINRA arbitrator himself and may know the 'ins & outs' of winning cases that are not even favorable to him.I am NOT a lawyer or arbitrator, but I think we've all heard about judicial cases won not on true merit, but on the ability of the lawyers to get what they want. I'm thinking this client is an ex arbitrator and would be very persuasive to make his case - even though it would have to do impossible mental gymnastics in my opinion.Looking forward to hearing your opinions on what options am I looking at, and what course of action would you suggest in this scenario.Thanks a lot!George",
                "Petra R": "My question, in this case, is - can I refuse the proposed agreements by our mediation specialist, and then also refuse to participate in the arbitration process? Or am I obligated to participate & pay arbitration fees if we did NOT reach a mutual agreement in the mediation phase?You would be obliged to participate. (See the terms of service) If the client goes ahead with arbitration and you refuse, your account is suspended.That said, you get the chance to go for arbitration first, and once you do, it is entirely possible that the client, knowing that their bluff has been called, will decline, and you'd get to keep your money and your arbitration fee back.If you are that certain that you're in the right, don't back down.",
                "Preston H": "George:You made a tactical mistake.In the future, do not agree to a $1000 fixed-price contract with someone you don't know.As a freelancer AND as a client, it makes sense to start small.No more than about an hour's worth of work for the first fixed-price contract. The client needs to demonstrate that she can be trusted to use the fixed-price contract model correctly. After the client demonstrates that she can be trusted... Then you can use increasingly larger contracts with that client.If a client demonstrates that she doesn't use the fixed-price contract model correctly, worst case scenario would be that you can walk away from it without getting paid. Of course you don't want that to happen, but it is better to not get paid for an hour of work versus not getting paid work that took many days or weeks to do.",
                "Jennifer M": "George:You made a tactical mistake.In the future, do not agree to a $1000 fixed-price contract with someone you don't know.As a freelancer AND as a client, it makes sense to start small.No more than about an hour's worth of work for the first fixed-price contract. The client needs to demonstrate that she can be trusted to use the fixed-price contract model correctly. After the client demonstrates that she can be trusted... Then you can use increasingly larger contracts with that client.If a client demonstrates that she doesn't use the fixed-price contract model correctly, worst case scenario would be that you can walk away from it without getting paid. Of course you don't want that to happen, but it is better to not get paid for an hour of work versus not getting paid work that took many days or weeks to do.It doesn't matter how many small milestones you do when it gets to this point. The client can ask for the full contract money back. They will be asked why they released the milestone during arbitration, so it would be arguably difficult to explain why the client released when they weren't satisfied, but if it is a situation where the provider promised to do something in return for release, I would bet this would be taken into consideration.But again, it doesn't matter how many milestones there are. The client can ask for a full refund, so you don't really protect yourself unless the milestones are individually separate from each other. But when milestones build onto each other and the end product is no good, clients will ask for all their money back and it doesn't matter how many milestones were completed."
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/Freelancers/How-to-Delete-Account/td-p/73707": {
            "title": "How to Delete Account",
            "post_date": "Apr 6, 2015  09:02:41 PM",
            "edit_date": "Oct 30, 2014  06:56:46 AM",
            "contributors": {
                "Rachelle S": [
                    "/t5/user/viewprofilepage/user-id/23168",
                    "Apr 6, 2015"
                ],
                "Shahzad W": [
                    "/t5/user/viewprofilepage/user-id/8013",
                    "Jan 3, 2014"
                ],
                "Ayesha S": [
                    "/t5/user/viewprofilepage/user-id/1127",
                    "Nov 22, 2009"
                ],
                "Rahul M": [
                    "/t5/user/viewprofilepage/user-id/4069877",
                    "Jul 22, 2019"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Dismas B": [
                    "/t5/user/viewprofilepage/user-id/7249371",
                    "Jan 13, 2021"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Nikunj P": [
                    "/t5/user/viewprofilepage/user-id/7286765",
                    "Jan 18, 2021"
                ],
                "Joanne Marie P": [
                    "/t5/user/viewprofilepage/user-id/1440201",
                    "Nov 26, 2017"
                ]
            },
            "messages": {
                "Rachelle S": "",
                "Shahzad W": "",
                "Ayesha S": "",
                "Rahul M": "how to close my freelancer account",
                "Goran V": "Hi Rahul,Since you have an agency profile you won't be able to close your freelancer profile at the moment. If you would like to keep only your client profile, then your agency and freelancer profile can be closed. Thank you.",
                "Dismas B": "Please close my account too.",
                "Bojan S": "HiDismas,We've closed your account as per your request.Thank you!",
                "Nikunj P": "",
                "Joanne Marie P": "Hi Nikunj,Could you please share the details of the account you're referring to so I can check? You can send them to me via PM by clickng on my name. Thank you."
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/Freelancers/Access-denied-for-every-post-I-try-to-view/td-p/749365": {
            "title": "Access denied  for every post I try to view",
            "post_date": "May 18, 2020  01:11:31 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ],
                "Silky S": [
                    "/t5/user/viewprofilepage/user-id/5685434",
                    "May 18, 2020"
                ],
                "Alice Shani L": [
                    "/t5/user/viewprofilepage/user-id/1089388",
                    "Aug 30, 2017"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ]
            },
            "messages": {
                "Aleksandar D": "Hi Silky,I checked your account and can see that you have recently submitted it for the team's review. Please allow up to 48 hours for the review to be complete. Once you are all set, you should be able to start bidding for jobs in the Upwork marketplace.Thank you.",
                "Silky S": "Thanks for your message AleksandarWill i get email notification that my profile is active again?I got this email and tried to reactivate my profilePlease help me with reactivating my profile.",
                "Alice Shani L": "I'm having a similar issue.It did was some time ago that I last logged in, so now that I have - will my profile automatically go back to being active? Does it take some time to refresh?Would love to go back into looking on offers. Thanks.",
                "Goran V": "Hi Alice,Could you please share more details about the problem you`re experiencing? Thank you."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Device-Authorization-Issue/td-p/861537": {
            "title": "Device Authorization Issue",
            "post_date": "Jan 20, 2021  12:54:43 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Jehanzeb S": [
                    "/t5/user/viewprofilepage/user-id/5769369",
                    "May 30, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Jehanzeb S": "HiI cannot open my settings or withdraw any amount from my Upwork account.. Can anyone assist with the possible solution?Much appreciated.BR.",
                "Andrea G": "HiJehanzeb,It looks like you've added an extra layer of security to your account by setting up an authenticator app to confirm that it's you. Please use the code from the app you downloaded when setting this up. If you need any further assistance please let us know!Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/removing-an-attachment-on-an-archived-proposal/td-p/861556": {
            "title": "removing an attachment on an archived proposal",
            "post_date": "Jan 20, 2021  01:31:20 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Eddie R": [
                    "/t5/user/viewprofilepage/user-id/7300551",
                    "Jan 20, 2021"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ]
            },
            "messages": {
                "Eddie R": "I have an attachment on an archived proposal that I would no longer like to be available--can you remove it please?I can send you the information as needed rather than post it here.Thank you,Eddie",
                "Preston H": "If I understand you correctly... are you saying you want to remove an attachment from a proposal that you sent to a potential client?If you sent a proposal, then any attachments you sent were part of your proposal sent to a potential client, n an attempt to get hired for a specific job.The proposal and the attachment belong to the client that you sent them to. You can't edit them."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/A-test-they-say/td-p/860382": {
            "title": "A test they say ?!",
            "post_date": "Jan 18, 2021  09:39:56 AM",
            "edit_date": "Jan 18, 2021  04:32:11 PM",
            "contributors": {
                "Kamarudheen C": [
                    "/t5/user/viewprofilepage/user-id/7268752",
                    "Jan 16, 2021"
                ],
                "Wahiba A": [
                    "/t5/user/viewprofilepage/user-id/7128673",
                    "Dec 25, 2020"
                ],
                "Mikko R": [
                    "/t5/user/viewprofilepage/user-id/71254",
                    "Dec 26, 2015"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ],
                "Will L": [
                    "/t5/user/viewprofilepage/user-id/40642",
                    "Jul 9, 2015"
                ],
                "Deborah P": [
                    "/t5/user/viewprofilepage/user-id/4679463",
                    "Nov 24, 2019"
                ]
            },
            "messages": {
                "Kamarudheen C": "Exactly, I do see few job posts the same as that, as I'm a graphic designer, I will send my previous works to them, that will be no use for them, but in your case, that is not possible as every research is useful for your future projects.",
                "Wahiba A": "Most of my researches are confidential, it is not really an area where we can test things, because even if I deliver an incomplete research, the client can ask me for more deep details",
                "Mikko R": "Thank you Mikko for the clarification I doubted that there is something wrong with the situation ...Your sixth sense will develop pretty fast, I'm thinking.Don't worry, keep going.",
                "Preston H": "Wahiba:If YOU wanted a freelancer to work for you, then you would hire her using an official contract and you would pay her for her time.You can expect other people to do the same.If you have doubts about a client's behavioral, the put yourself in their shoes and consider what YOU would do.",
                "Will L": "Wahiba,In many areas on Upwork I'd expect few clients will hire a freelancer without some indication of their skills or experience and samples of previous work product.You can remove all identifying or other customer-specific information from some of the samples of your best work for previous clients, such that the resulting samples do not violate your existing NDAs. Or just create some dummy examples.If you have any doubts about your samples based on actual work, run the idea and samples by an attorney to ensure you are making sufficient changes to the documents so you are not violating your existing NDAs.These examples/samples will be usable for future proposals you submit on new projects, so they're worth their initial cost and effort.By no means should you agree to do a small unpaid \"test\" (a violation of Upwork's rules) or even a small paid \"test\" for a client you don't trust. If the client is a scammer, by doing even a small paid project through Upwork you'll be giving them leverage to make unfair demands of you under the threat of negative feedback, which they could exploit if they are scammers.",
                "Deborah P": "Wahiba,In many areas on Upwork I'd expect few clients will hire a freelancer without some indication of their skills or experience and samples of previous work product.You can remove all identifying or other customer-specific information from some of the samples of your best work for previous clients, such that the resulting samples do not violate your existing NDAs. Or just create some dummy examples.If you have any doubts about your samples based on actual work, run the idea and samples by an attorney to ensure you are making sufficient changes to the documents so you are not violating your existing NDAs.These examples/samples will be usable for future proposals you submit on new projects, so they're worth their initial cost and effort.By no means should you agree to do a small unpaid \"test\" (a violation of Upwork's rules) or even a small paid \"test\" for a client you don't trust. If the client is a scammer, by doing even a small paid project through Upwork you'll be giving them leverage to make unfair demands of you under the threat of negative feedback, which they could exploit if they are scammers.I am in a similar situation right now: I am in an active contract with a client who, after I delivedered the first and entirely legitimate milestone, positioned on me a 2nd milestone with instructions that are against the TOS and had not been agreed with me previously.All this has been duly flagged and I am awaiting for developments however, I wonder: wouldn't it be better if, as freelancers, we were allowed and required to approve individual milestones too, so that an open contract does not become an avenue for inappropriate requests?"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/ID-Verification/td-p/526332": {
            "title": "ID Verification",
            "post_date": "Sep 30, 2018  01:40:38 PM",
            "edit_date": "Sep 20, 2020  02:52:09 AM",
            "contributors": {
                "Mohammad Shohel R": [
                    "/t5/user/viewprofilepage/user-id/2674192",
                    "Sep 30, 2018"
                ],
                "Muhammad T": [
                    "/t5/user/viewprofilepage/user-id/6554739",
                    "Sep 20, 2020"
                ],
                "Nikola S": [
                    "/t5/user/viewprofilepage/user-id/6019505",
                    "Jul 2, 2020"
                ],
                "Rameez Z": [
                    "/t5/user/viewprofilepage/user-id/6877991",
                    "Nov 15, 2020"
                ],
                "Camilla H": [
                    "/t5/user/viewprofilepage/user-id/1181072",
                    "Sep 22, 2017"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ]
            },
            "messages": {
                "Mohammad Shohel R": "",
                "Muhammad T": "I want id varification by video chatt**Edited for Community Guidelines**",
                "Nikola S": "HiMuhammad,In order to complete this process please go to your Account - Settings - Identity verification. Click ontheStart Chat buttonand initiatea short video callwith our agent.",
                "Rameez Z": "I got an email after the direct contract payment from client that My account is on hold and i have to provide Government-issues ID and Bank/Utility Statements. But the problem is I only have Government issued ID but not any Bank/Utility statement because I have filled the form recently for opening a bank account and other bills doesn't generated on my name. They wrote in email that if i didn't provide it within 5 days my account will be suspended. I just want them to increaase the deadline so I could open a bank account and generate the bank statement . I want more than 5 days. Please",
                "Camilla H": "Hi,I've been asked to verify my ID and I've been trying all day to start a call through the button, but it just keeps saying that no one is available. How can I get in contact with someone?Best,Camilla",
                "Goran V": "Hi Camilla,Could you please try clearing your cache and cookies or logging in via Firefox to complete your verification? If you`re still experiencing any problems, please follow up directly on your ticket with number30210183. Thank you."
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/Freelancers/Showcase-your-past-experience-with-testimonials-FEEDBACK/td-p/666955": {
            "title": "Showcase your past experience with testimonials - FEEDBACK",
            "post_date": "Nov 9, 2019  06:59:15 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Joanne Marie P": [
                    "/t5/user/viewprofilepage/user-id/1440201",
                    "Nov 26, 2017"
                ],
                "Raghav B": [
                    "/t5/user/viewprofilepage/user-id/5708990",
                    "May 22, 2020"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Raafia J": [
                    "/t5/user/viewprofilepage/user-id/5655309",
                    "May 13, 2020"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Wilson E": [
                    "/t5/user/viewprofilepage/user-id/44836",
                    "Aug 7, 2015"
                ],
                "Ronak B": [
                    "/t5/user/viewprofilepage/user-id/3767728",
                    "May 21, 2019"
                ]
            },
            "messages": {
                "Joanne Marie P": "Hi Wilson,Thanks for sharing your feedback with us! We'll be sure to pass it on to our product team.",
                "Raghav B": "I got the testimonial from the client. It is still in under review. How much time it will take to show it on profile.",
                "Goran V": "Hi Raghav,While we are excited to share that the feature is proving to be very popular unfortunately we've received so many requests that it's taking us a while to review each one. As a result, please allow 10 business days for your request to be reviewed. We apologize for the delay, but please know we are still testing and optimizing this beta feature. Thanks!",
                "Raafia J": "I want to ask the same thing. Please anyone answer",
                "Bojan S": "Hi Raafia,The review of your request can last up to 10 business days. We apologize for the delay, but please know we are still testing and optimizing this beta feature.",
                "Vladimir G": "Thanks for sharing your sentiment about the feature we're testing, Wilson! As part of the test, somefreelancers will see the option to share great feedback they receive on contracts they complete on their LinkedIn network. This option will appear on some contracts on which feedback is yet to be submitted and isn't available for older reviews you've received.As Joanne confirmed, we'll share your feedback and suggestion with our Product team.I also merged your post with the main thread where this test is being discussed.",
                "Wilson E": "",
                "Ronak B": "Upwork Testimonial is not showing on my profile it shows the following(Client name } testimonial has been submitted and is pending Upwork approval."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Where-to-purchase-connects/td-p/607575": {
            "title": "Where to purchase connects?",
            "post_date": "Jun 16, 2019  06:14:32 AM",
            "edit_date": "Jun 24, 2020  03:13:05 AM",
            "contributors": {
                "Timofey G": [
                    "/t5/user/viewprofilepage/user-id/2661346",
                    "Sep 27, 2018"
                ],
                "Martina P": [
                    "/t5/user/viewprofilepage/user-id/2317801",
                    "Jul 11, 2018"
                ],
                "Jackson M": [
                    "/t5/user/viewprofilepage/user-id/4539402",
                    "Oct 27, 2019"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ],
                "Saurabh T": [
                    "/t5/user/viewprofilepage/user-id/5603200",
                    "May 6, 2020"
                ],
                "Kafia K": [
                    "/t5/user/viewprofilepage/user-id/1608023",
                    "Jan 13, 2018"
                ]
            },
            "messages": {
                "Timofey G": "A couple of months ago I've got an email from Upwork saying that from May there will be no free connects and freelancers must purchase them for $0.15 per each. It's middle of June now and I'm running out of my connects so I'd like to buy some but I can't find such option on the site.",
                "Martina P": "A couple of months ago I've got an email from Upwork saying that from May there will be no free connects and freelancers must purchase them for $0.15 per each. It's middle of June now and I'm running out of my connects so I'd like to buy some but I can't find such option on the site.If you don't see the purchase option on your connects page, you might not have been switched to the new system yet.",
                "Jackson M": "Hae martina p?am jackson.Guide me on how i ca n buy connects on upwork",
                "Goran V": "HiJackson,To purchase connects please go to Settings > Membership & Connects > Add Connects. To learn more about this check out this Help Article. If you have any additional questions, let me know. Thank you.",
                "Saurabh T": "",
                "Kafia K": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Contract-update-not-working/td-p/861529": {
            "title": "Contract update not working",
            "post_date": "Jan 20, 2021  12:18:41 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Luiz T": [
                    "/t5/user/viewprofilepage/user-id/5699873",
                    "May 20, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Luiz T": "Hi,I started a per hour base contract with a client. After some time, we decided to move to a milestone based project. I proposed the project and the client said he already accepted it, and even put money on the escrow for the first milestone, but our contract has not been updated. It has been more than one day now.Can anybody help us with that?",
                "Andrea G": "HiLuiz,Please know, it's not possible to change a contract's type. I can see you were able to create a new Fixed-Price contract with your client. Feel free to end your Hourly contract and continue working with the Fixed-Price one.Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Upwork-desktop-app-taking-incorrect-screenshot-on-Macbook-Air-M1/td-p/861538": {
            "title": "Upwork desktop app taking incorrect screenshot on Macbook Air M1",
            "post_date": "Jan 20, 2021  12:55:49 PM",
            "edit_date": "Unedited",
            "contributors": {
                "Arshad H": [
                    "/t5/user/viewprofilepage/user-id/7300330",
                    "Jan 20, 2021"
                ]
            },
            "messages": {
                "Arshad H": "Yes, it was a permission issue. Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/My-profile-is-no-longer-available/td-p/861409": {
            "title": "My profile is no longer available",
            "post_date": "Jan 20, 2021  07:13:43 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Isis G": [
                    "/t5/user/viewprofilepage/user-id/6270937",
                    "Aug 6, 2020"
                ]
            },
            "messages": {
                "Isis G": "Thank you very much! It worked to switch to another browser. Everything looks good now "
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Locked-private-Profile/td-p/405044": {
            "title": "Locked private Profile",
            "post_date": "Sep 24, 2017  01:11:22 AM",
            "edit_date": "Sep 24, 2017  01:16:35 AM",
            "contributors": {
                "Igor M": [
                    "/t5/user/viewprofilepage/user-id/135",
                    "Mar 20, 2007"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Arslan S": [
                    "/t5/user/viewprofilepage/user-id/999705",
                    "Aug 10, 2017"
                ],
                "Monika S": [
                    "/t5/user/viewprofilepage/user-id/2041428",
                    "May 3, 2018"
                ],
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Gitesh D": [
                    "/t5/user/viewprofilepage/user-id/56434",
                    "Sep 17, 2015"
                ]
            },
            "messages": {
                "Igor M": "I recieved email today about new program initiated by Upwork.Textfrom this email:\"Beginning September 2nd we’ll reduce competition for active freelancers — like you — by removing inactive freelancer profiles from search results.This was created to reward loyal freelancers who work and get paid through Upwork. In addition to increasing your visibility, this change will help protect clients and freelancers from off-platform work, which is against our Terms of Service.\"I'm totally agree with this initiative! But I want to ask Upwork: is it possible to show in top of search results freelancers with more hours worked through Upwork? That would reward freelancers who work many hours/years and is really loyal to this platform! Currently often happens so that new freelancers is in top of search results and many experienced freelancers is in the middle of search results list. That is not stimulating to work for years through this platform! In this case it is easier to open new freelancer account and get in the top of search rather than work hard for many years, earn reputation, gain top rated, etc...",
                "Vladimir G": "Hi Igor,Please note that the order the freelancers are displayed in search results depends on the filters a client choosesto use, . Also, freelancers are regularly rotated in search to allow equal exposure.",
                "Arslan S": "I just start earning again and complete one project butmy account is still locked to private plea",
                "Monika S": "HiMy account has been locked private.Kindly, solve this issue for me.RegardsMonika",
                "Avery O": "Hi Monika,Your profile has already been set to public as requested.If your profile is set to private again after 30-days, or sometimein the future, check out the options listed in the email notification or in the pop up on Find Work page to set it back to public.",
                "Gitesh D": "Dear Mates,My account is locked to private by Upwork. Can anyone please resolve this for me and make my profile public? I am going to start working on it or need an invitation to apply.Kind regards"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/complaint-about-client/td-p/861411": {
            "title": "complaint about client",
            "post_date": "Jan 20, 2021  07:21:12 AM",
            "edit_date": "Jan 20, 2021  07:34:20 AM",
            "contributors": {
                "Muhammad A": [
                    "/t5/user/viewprofilepage/user-id/7297904",
                    "Jan 20, 2021"
                ],
                "Preston H": [
                    "/t5/user/viewprofilepage/user-id/14531",
                    "Nov 24, 2014"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ]
            },
            "messages": {
                "Muhammad A": "HiHope you staying safe!!!I want to raise one query about my client. Hope you help me out with this.I have received a job invitation on 11th Jan 2021. Here is the job posted link for your reference**Edited forCommunity Guidelines**. I and the client had a conversation about the work requirementsand according to the client's requirements, he says you design only 3 Desktop Figma frame 1 2 and 3I will design all the frame according to the requirements when I finish the workMaxim says send me files I send the files so after he receiving the file he cancels the contract without telling me the issues.",
                "Preston H": "Muhammad:Clients are allowed to close (or \"cancel\") a contract at any time. There is nothing wrong with that. No rules have been violated.There is no cause for you to file a \"complaint\" about this client.If you have an hourly contract, then you are paid for all of the time that you log. A client may close the contract at any time. That is fine.If you have a fixed-price contract, then the client may release any remaining money in escrow and close the contract at any time. That is fine.You said that the client asked you to send him the files. And you sent him the files.You were supposed to send him the files. The files belong to the client.As long as the client has paid for your work as agreed, then those files belong to the client.",
                "Andrea G": "HiMuhammad,I can see this is a Fixed-Priced contract and your client has requested an Escrow Refund. Please know, you'll need to respond to the refund requestwithin seven days or the funds will be returned to the client automatically. You can dispute the refund request by navigating to your contract room and clicking on \"Respond to Request\".If your client reject the dispute, an Upwork dispute specialist will provide mediation assistance to both parties to try and resolve the matter.Thanks!",
                "Petra R": "Was it an hourly contract or a fixed rate contract?If hourly, did you track your time? If so, you get paid automaticallyIf fixed, did you get an email asking you to approve the return of Upwork funds? You can dispute that."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Direct-Local-Withdrawal-Funds-did-not-received/td-p/861509": {
            "title": "Direct Local Withdrawal Funds did not received",
            "post_date": "Jan 20, 2021  11:27:09 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Nabeel K": [
                    "/t5/user/viewprofilepage/user-id/7299813",
                    "Jan 20, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "Nabeel K": "Hey upwork community,I have a little concern as I have withdraw my funds (88$) via direct to local bank tarnsfer and its been more then 7 busniness days and my funds still does not reached in my account.I contacted my bank and they say that they didn't get any funds, so I think that the issue is from your side.Kinly resolve my issue as I am much worried avoid about this.Thanks.",
                "Andrea G": "HiNabeel,I'm sorry to hear you haven't received your funds yet. Please follow up with us if you still haven't received your funds after 8 business days have passed and we'll initiate a trace for you. Please keep in mind this does not include weekends and bank holidays in the U.S or in your country.Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Trouble-submitting-for-jobs/td-p/861495": {
            "title": "Trouble submitting for jobs",
            "post_date": "Jan 20, 2021  10:41:47 AM",
            "edit_date": "Unedited",
            "contributors": {
                "C Charles W": [
                    "/t5/user/viewprofilepage/user-id/7299504",
                    "Jan 20, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ]
            },
            "messages": {
                "C Charles W": "Is anyone having trouble submitting applications for work today? I have tried 4 times and the page hangs and doesn't really go anywhere - tried refreshing, tried restarting PC - anyone else.?",
                "Andrea G": "HiC Charles,Could you please try clearing your cache and cookies or logging in with a different browser to see if the issue persists?Thanks!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Earnings-by-client-total-fees-paid/td-p/855578": {
            "title": "Earnings by client - total fees paid",
            "post_date": "Jan 6, 2021  01:20:51 PM",
            "edit_date": "Jan 9, 2021  03:08:27 PM",
            "contributors": {
                "Daniela K": [
                    "/t5/user/viewprofilepage/user-id/24890",
                    "Apr 29, 2015"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Mark Z": [
                    "/t5/user/viewprofilepage/user-id/2804677",
                    "Oct 26, 2018"
                ],
                "Douglas C": [
                    "/t5/user/viewprofilepage/user-id/4204851",
                    "Aug 20, 2019"
                ],
                "Andrei T": [
                    "/t5/user/viewprofilepage/user-id/131093",
                    "Aug 30, 2016"
                ]
            },
            "messages": {
                "Daniela K": "Upwork used to offer a \"Earnings by Client\" report that showed the total amount billed for a given timeframe (e.g. January 1st - Dec 31st) and how much you paid in fees during the selected timeframe.Is there something similar that lists how much I made and how much I paid in fees without having to do the math myself?",
                "Andrea G": "HiDaniela,You can go to Reports > My Reports and customize a date range you'd like to see. However, this does not include fees. You can also use your Transaction Historywhich can be filtered and exported as a CSV file for further editing if needed.Thanks!",
                "Mark Z": "Please bring back the \"Earnings by Client\" report. It was so much easier and saved so much more time than dealing with \"Transaction History.\"With \"Earnings by Client\" we could calculate fees, net income, and gross income for any time period almost instantly. It was really helpful for tax purposes and calculating estimated taxes quarterly. The value this provides to freelancers is huge.",
                "Douglas C": "Honestly, why would Upwork remove a useful report like this? How am I supposed to calculate my 2020 income for tax purposes? There is no longer any way to do this.",
                "Andrei T": "Actually this is a question your accountant should be able to answer. Upwork provides you with all related documents on a weekly basis and they are not responsible for any further processing."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Unfair-feedback-and-unresponsive-customer/td-p/861381": {
            "title": "Unfair feedback and unresponsive customer",
            "post_date": "Jan 20, 2021  05:55:56 AM",
            "edit_date": "Jan 20, 2021  10:26:20 AM",
            "contributors": {
                "Vildan P": [
                    "/t5/user/viewprofilepage/user-id/5631237",
                    "May 10, 2020"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Martina P": [
                    "/t5/user/viewprofilepage/user-id/2317801",
                    "Jul 11, 2018"
                ],
                "Andrei T": [
                    "/t5/user/viewprofilepage/user-id/131093",
                    "Aug 30, 2016"
                ]
            },
            "messages": {
                "Vildan P": "Hello, the last project I worked on was suspended for 2 times. I did not continue to work because the job was suspended. They did not respond to my messages and ended the contract without saying anything. They did what I said to another devoloper friend of mine. Their scores are already very low at Upwork and their constant work has been suspended. They unfairly gave me a low score and my average dropped. I made a lot of effort and we were doing business with mutual satisfaction, but at the last moment they turned a corner like this. In this case, I am unfairly victimized and if your grievances are not remedied, I will close my account and never do business on Upwork again, because I do not trust.",
                "Andrea G": "HiVildan,I'm sorry to hear you feel this way and that you had a bad experience with this client. I can see you were able to submit a support ticket with our team. Please allow some time for our team to review and they will update your ticket with more information as soon as possible. You'll receive an email notification when your ticket is updated.Thanks!",
                "Martina P": "Hello, the last project I worked on was suspended for 2 times. I did not continue to work because the job was suspended. They did not respond to my messages and ended the contract without saying anything. They did what I said to another devoloper friend of mine. Their scores are already very low at Upwork and their constant work has been suspended. They unfairly gave me a low score and my average dropped. I made a lot of effort and we were doing business with mutual satisfaction, but at the last moment they turned a corner like this. In this case, I am unfairly victimized and if your grievances are not remedied, I will close my account and never do business on Upwork again, because I do not trust.I understand that you will never work with this client again, but why is that whole thing upwork's fault? They suspended his contract for your protection, because you would otherwise not have been paid.",
                "Andrei T": "Your best bet to offset this is to reply to the feedback you received and point out the issues you encountered with this client in a manner your future clients will understand. Stay to the point and remember it will remain as part of your profile, not the client's. It is unfortunate shady clients are still able to leave feedback after causing trouble; you likely won't be able to remove it."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Feedback-Review-not-showing-up-on-my-profile/td-p/4389": {
            "title": "Feedback/Review not showing up on my profile?",
            "post_date": "May 4, 2014  03:00:13 PM",
            "edit_date": "Oct 30, 2014  07:24:50 AM",
            "contributors": {
                "Valeria K": [
                    "/t5/user/viewprofilepage/user-id/8663",
                    "Mar 6, 2014"
                ],
                "Abu Bakar Siddik T": [
                    "/t5/user/viewprofilepage/user-id/70982",
                    "Dec 22, 2015"
                ],
                "Lena E": [
                    "/t5/user/viewprofilepage/user-id/23219",
                    "Apr 7, 2015"
                ],
                "Tiana A": [
                    "/t5/user/viewprofilepage/user-id/77693",
                    "Feb 23, 2016"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Manpreet K": [
                    "/t5/user/viewprofilepage/user-id/248525",
                    "Nov 12, 2016"
                ],
                "Delwar S": [
                    "/t5/user/viewprofilepage/user-id/2611472",
                    "Sep 17, 2018"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ]
            },
            "messages": {
                "Valeria K": "",
                "Abu Bakar Siddik T": "Hey.I am having the same problem as well.My first review is not showing up on my profile as well.",
                "Lena E": "Hi Abu,When did you complete the contract? Please note Valerias response:\"feedback takes some time to show on your profile. Additionally, the feedback shows once there is a payment made on the contract, so if it was an hourly contract that started and ended this week, feedback will show next week once the payment is processed.\"",
                "Tiana A": "Feedback by client not showing on my profile.... This is the 2nd project of mine..",
                "Vladimir G": "Hi Tiana,I see you've completed two jobs so far on Upwork and they are both displayed in your profile's Work History.",
                "Manpreet K": "Dear Sir,Recently completed my first job. Review is not showing to my profile.",
                "Delwar S": "Hi, my latest ourly project is completed. But still \"Review\" not shown in my profile. I can see \"Review\" from contract. Waiting for your help. I also attached a screen shot.Thank You.**Edited for Community Guidelines**",
                "Goran V": "HiDelwar,I've just generated your profile manuallyand your feedback is not listed on your profile. If you need further help let me know, thank you."
            },
            "moderated": true
        },
        "https://community.upwork.com/t5/Freelancers/How-to-filter-real-project-and-fake-project/td-p/861482": {
            "title": "How to filter real project and fake project?",
            "post_date": "Jan 20, 2021  10:20:00 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Melike E": [
                    "/t5/user/viewprofilepage/user-id/7074072",
                    "Dec 14, 2020"
                ]
            },
            "messages": {
                "Melike E": ""
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Is-there-any-way-to-hide-job-results-from-certain-countries/td-p/311115": {
            "title": "Is there any way to hide job results from certain countries?",
            "post_date": "Mar 3, 2017  01:32:10 AM",
            "edit_date": "Mar 3, 2017  05:17:03 AM",
            "contributors": {
                "Yevgeny S": [
                    "/t5/user/viewprofilepage/user-id/397378",
                    "Jan 14, 2017"
                ],
                "Juvy Ann P": [
                    "/t5/user/viewprofilepage/user-id/63967",
                    "Oct 29, 2015"
                ],
                "Vladimir G": [
                    "/t5/user/viewprofilepage/user-id/10819",
                    "Oct 31, 2014"
                ],
                "Reem H": [
                    "/t5/user/viewprofilepage/user-id/462658",
                    "Feb 8, 2017"
                ],
                "Lana P": [
                    "/t5/user/viewprofilepage/user-id/7200687",
                    "Jan 6, 2021"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Anthony H": [
                    "/t5/user/viewprofilepage/user-id/7299614",
                    "Jan 20, 2021"
                ],
                "Alexander K": [
                    "/t5/user/viewprofilepage/user-id/203594",
                    "Oct 11, 2016"
                ]
            },
            "messages": {
                "Yevgeny S": "I know that I can choose specific countries to filter my job list, however what I really need is to dash out jobs from clients from certain countries instead.I tried to include the name of the country in the Exclude these words field, however this also filters job postings, that have something like \"Please don't apply if you are from XXX\" (which I don't need to filter). Any ideas?",
                "Juvy Ann P": "It looks like there is a need for you to submit proposals to clients of specific geographical location (assuming that what job posts state is accurate). However, you seem to unable to solve the problem using country names as keywords. Have you tried the Boolean search strategy? I am not sure how job posts are indexed here or what algorithm may match your specific search query but that's just my suggestion, Yevgeny.",
                "Vladimir G": "HiYevgeny,We don't currently have a filter that would sort job posts based on clients' location.",
                "Reem H": "",
                "Lana P": "do you plan to develop a filter to exclude specific locations?",
                "Andrea G": "HiLana,Thank you for sharing your thoughts with us. There isn't a filter to exclude a location at the moment, we'll make sure to share your feedback with the team. In the meantime, we suggest you try several search combinations and a variety of filters to find the projects you're looking for. The searches accept logic operators like AND and OR. The Advanced Searchoption will perform complex logic for you.Thanks!",
                "Anthony H": "I'd also like this filter option added please.",
                "Alexander K": "I agree it is terrible that I have to spend time to REMOVE all offers for the countries that I have no interest in working with. In each posting, I get 80 offers from a specific country that is completely uninteresting for me. Hope they listen to their users and add this simple feature ASAP"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Unpaid-Training/td-p/861254": {
            "title": "Unpaid Training",
            "post_date": "Jan 20, 2021  12:49:43 AM",
            "edit_date": "Jan 20, 2021  01:11:50 AM",
            "contributors": {
                "Martina P": [
                    "/t5/user/viewprofilepage/user-id/2317801",
                    "Jul 11, 2018"
                ],
                "Chlarise L": [
                    "/t5/user/viewprofilepage/user-id/7283812",
                    "Jan 18, 2021"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Jennifer R": [
                    "/t5/user/viewprofilepage/user-id/1151430",
                    "Sep 15, 2017"
                ],
                "Will L": [
                    "/t5/user/viewprofilepage/user-id/40642",
                    "Jul 9, 2015"
                ]
            },
            "messages": {
                "Martina P": "First, no interview outside of upwork before hire. Not allowed.Second, I would not entertain this training nonsense. This is not employment. Ask yourself why they don't hire people who already have what they need. There are millions of freelancers to chose from.I don't know what their game is, probably getting work for free. I find it very suspicious that you didn't even apply. (If you are in the US, then it's the fake check cashing scam.)Tell them you are happy to do the training after you are hired on an hourly contract with your usual rate. You will never hear from them again.",
                "Chlarise L": "",
                "Petra R": "It is an hourly contract? Just use the tracker while working/training.Why would you assume that it's not paid? Did the client say so?",
                "Jennifer R": "There are two things to keep in mind:1. Manual time is not protected and the client can refuse to pay for it. Better use the app all the time.2. Make sure his payment method is verified or again the time is not protected even if you use the app.",
                "Will L": "Hi, Chlarise.Far too many clients on Upwork do not know the details of how Upwork works. Your client may be one of them, so if either his payment method is not approved or TimeTracker is not yet available, tell the client, as diplomatically as possible, that you've just noticed the problem(s) and he needs to address this as soon as possible.In my experience, getting a payment method approved by Upwork is not a long process, so the approval should be in place within a couple of days. But the client needs to start the process immediately, if he hasn't already.Under Upwork's rules you don't have a valid hourly contract to do work on until Time Tracker is available for you to document your work time for a client. And if the client's payment method has not been approved by Upwork, even if you track your work time using Time Tracker it is not covered by Upwork's excellent hourly payment protection. (This should not be allowed, but it is.)So, you shouldn't do any work on an hourly contract until you can use Time Tracker to keep track of your work time and Upwork confirms the client's payment method is approved.If things are going well and your training really is about training and is not about doing work the client can use without being paid for it, then your best option, if the client has given you no reason to distrust him, may be to keep close track of your manual time and add it to Time Tracker as soon as TimeTracker is available to you, then switch to tracking all work time using Time Tracker properly. When you add the manual time Time Tracker, tell the client so he isn't surprised when he sees it in his Upwork invoice. I'd also send him a daily accounting of my manual work time, so he knows what to expect.As others here have said, all work time you add manually on any project is not covered by Upwork's excellent hourly protection. By definition, you do not know and have no reason to trust this new client will pay you, so do anything possible to avoid using additional manual time during the earliest days of your work with him.Good luck!"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/I-sent-Upwork-s-direct-contract-to-a-client-and-it-s-asking-for/td-p/861435": {
            "title": "I sent Upwork's direct contract to a client and it's asking for his identity verification",
            "post_date": "Jan 20, 2021  08:26:36 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Sandesh S": [
                    "/t5/user/viewprofilepage/user-id/4134049",
                    "Aug 5, 2019"
                ],
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ]
            },
            "messages": {
                "Sandesh S": "I sent Upwork's direct contract to a client and it's asking for his identity verification. This was the first time I experienced this.Why is Upwork asking for identity verification?",
                "Petra R": "Why is Upwork asking for identity verification?Security"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Your-account-has-been-suspended-Please-contact-customer-support/td-p/829391": {
            "title": "Your account has been suspended. Please contact customer support.",
            "post_date": "Nov 3, 2020  02:50:29 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Avery O": [
                    "/t5/user/viewprofilepage/user-id/67295",
                    "Nov 23, 2015"
                ],
                "Viacheslav T": [
                    "/t5/user/viewprofilepage/user-id/6061834",
                    "Jul 8, 2020"
                ],
                "Roxy R": [
                    "/t5/user/viewprofilepage/user-id/4535023",
                    "Oct 26, 2019"
                ],
                "Andrea G": [
                    "/t5/user/viewprofilepage/user-id/6053355",
                    "Jul 7, 2020"
                ],
                "Christopher M": [
                    "/t5/user/viewprofilepage/user-id/3384124",
                    "Feb 28, 2019"
                ],
                "Aleksandar D": [
                    "/t5/user/viewprofilepage/user-id/3488933",
                    "Mar 23, 2019"
                ]
            },
            "messages": {
                "Avery O": "Hi Viacheslav,I apologize for the delay in our response. Please know that our team is currently looking into this and we'll come back here to update you once we have more information about your account concern.I'm sorry for the inconvenience this has caused and thank you for your patience.",
                "Viacheslav T": "Thank you very much, have a wonderful day!",
                "Roxy R": "Hello sirplease accept my apology for late replay and give me the permission to rejoin..",
                "Andrea G": "HiRoxy,I checked and can see you were able to reply to your support ticket with our team. Please allow some time for our team to review and they will update you directly via ticket.Thanks!",
                "Christopher M": "Hi,i have also submitted my documents as well as the utility bill and i have not heard any response yet.Kindy fast track the process.Regards,Chris.",
                "Aleksandar D": "Hi Christopher,I followed up with the team handling your case and you can expect an update very soon.Thank you."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Unread-Message-Count-to-36-Since-Yesterday-but-All-Messages-are/td-p/858890": {
            "title": "Unread Message Count to 36 Since Yesterday, but All Messages are Read",
            "post_date": "Jan 14, 2021  10:05:15 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Muhammad Arslan J": [
                    "/t5/user/viewprofilepage/user-id/3232080",
                    "Jan 28, 2019"
                ],
                "Bojan S": [
                    "/t5/user/viewprofilepage/user-id/1830380",
                    "Mar 9, 2018"
                ]
            },
            "messages": {
                "Muhammad Arslan J": "Hi, I am having a problem with upwork Web Based Application & Mobile application.All my messages are read, but I am getting an unread message count of 36 since yesterday.I tried to look for a section to report the bug, but I am not finding it, so posting it here.",
                "Bojan S": "HiMuhammad Arslan,Could you please clear your cache and cookies or log in with another browser to check if you`re still experiencing the same issue? Let us know if the issue persists. Thank you."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Contract-on-hold-what-should-I-do/td-p/547278": {
            "title": "Contract on hold, what should I do?",
            "post_date": "Dec 28, 2018  01:13:37 AM",
            "edit_date": "Dec 28, 2018  02:40:00 AM",
            "contributors": {
                "Petra R": [
                    "/t5/user/viewprofilepage/user-id/3535",
                    "Aug 3, 2011"
                ],
                "Francesca G": [
                    "/t5/user/viewprofilepage/user-id/63876",
                    "Oct 28, 2015"
                ],
                "Roshan Q": [
                    "/t5/user/viewprofilepage/user-id/1626107",
                    "Jan 17, 2018"
                ]
            },
            "messages": {
                "Petra R": "Goodmorning everyone and thank you for your attention,this morning I received an email from Upwork: one of my contracts has been put on hold: \"We have noticed some possible issues with your contract with xxx\", this the message. I already readed something about on upw forum, but I still have some questions:1) at least, will I be paid or there is the risk to loose my payment?2) In case I loose my payment, is there something I can do with the client? The contract has hourly payment but with manual methodMore often than not such holds are resolved fairly quickly, but there is nothing you can do, the client needs to fix it.The most common issue is that the client did not pay last week's hours (payment method declined) which means last week's hours were not paid (NOTE: That may not be the problem in your case, but it is the most common reason) and if that is the case, the fact that your time was manual would mean that you are not protected for any hours logged last week and this week.",
                "Francesca G": "Thank you for your answer. I'm a bit astonished because the last payment of my client is in review now (review that ends today), so I thought Upwork has already checked the client payment method almost two weeks ago, even because in this two week I could have worked for him.Or maybe I'm wrong and the payment actually in review will be sended to me as usual?",
                "Roshan Q": "Hi,I just want to add one thing which is more important than payment. It is your success score.As per the guidelines from upwork, if your contract is on hold for more than 2-3 weeks without response from your client, you should end it from your side else it will have negative impact on your score.I have already suffered from this for one contract and it affected my score negatively.Hope this will help.Thanks"
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Reversal-of-Payment-to-Payoneer-Account/td-p/861402": {
            "title": "Reversal of Payment to Payoneer Account",
            "post_date": "Jan 20, 2021  06:48:56 AM",
            "edit_date": "Unedited",
            "contributors": {
                "Afolabi O": [
                    "/t5/user/viewprofilepage/user-id/7297921",
                    "Jan 20, 2021"
                ],
                "Goran V": [
                    "/t5/user/viewprofilepage/user-id/580837",
                    "Mar 24, 2017"
                ]
            },
            "messages": {
                "Afolabi O": "",
                "Goran V": "Hi Afolabi,I would like to confirm that we can't cancel a withdrawal once it's been initiated. I hope that Payoneer Customer Support will be able to assist you further. Thank you."
            },
            "moderated": false
        },
        "https://community.upwork.com/t5/Freelancers/Paying-VAT/td-p/849342": {
            "title": "Paying VAT",
            "post_date": "Dec 20, 2020  01:59:10 PM",
            "edit_date": "Dec 20, 2020  02:30:33 PM",
            "contributors": {
                "Jack K": [
                    "/t5/user/viewprofilepage/user-id/5798120",
                    "Jun 3, 2020"
                ],
                "Ruby B": [
                    "/t5/user/viewprofilepage/user-id/4918228",
                    "Jan 19, 2020"
                ],
                "Diana A": [
                    "/t5/user/viewprofilepage/user-id/96495",
                    "Jun 14, 2016"
                ],
                "Nicky B": [
                    "/t5/user/viewprofilepage/user-id/7297850",
                    "Jan 20, 2021"
                ]
            },
            "messages": {
                "Jack K": "That clears it up, thanks!",
                "Ruby B": "",
                "Diana A": "I agree, it's frusterating to come back to upwork to see that i'm gonna lose even more money with every service i give, wish there was a way to avoid this :/ i'm still paying taxes in my country as well, nothing will be left in this case man",
                "Nicky B": "Thank you all for these helpful comments. I also find this incredibly confusing (and I have been VAT registered in the UK for years)What I don't understand is why I am having to pay VAT on a service in the US?"
            },
            "moderated": false
        }
    }
}