{
    "https://community.upwork.com/t5/Freelancers/Unable-to-complete-video-verification/m-p/861088#M530906": {
        "title": "Re: Unable to complete video verification",
        "post_date": "Jan 19, 2021  05:06:58 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Muhmmad A": [
                "/t5/user/viewprofilepage/user-id/4796348",
                "Dec 21, 2019"
            ],
            "Jennifer C": [
                "/t5/user/viewprofilepage/user-id/5338934",
                "Apr 2, 2020"
            ],
            "Aleksandar D": [
                "/t5/user/viewprofilepage/user-id/3488933",
                "Mar 23, 2019"
            ],
            "Aman M": [
                "/t5/user/viewprofilepage/user-id/5283623",
                "Mar 26, 2020"
            ],
            "Goran V": [
                "/t5/user/viewprofilepage/user-id/580837",
                "Mar 24, 2017"
            ],
            "Rene K": [
                "/t5/user/viewprofilepage/user-id/9865",
                "Jul 10, 2014"
            ],
            "Virgile S": [
                "/t5/user/viewprofilepage/user-id/5528038",
                "Apr 26, 2020"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ]
        },
        "messages": {
            "Muhmmad A": "I've provided the details and everything for the first step of ID verification, but when I start visual verification, I get timed out and receive error.Constantly getting Timed Out when trying to start Visual Verification call.How to proceed to next step?Need your help...!",
            "Jennifer C": "I am having this same issue.I successfully verified my ID this morning; however, I am unable to initiate a video call to complete the process. Please advise. Thank you.",
            "Aleksandar D": "Hi Jennifer,I'm sorry for the inconvenience this has caused you. Could you please try clearing your cache and cookies or use a different browser? Let us know if the issue persists after trying that so that we can assist you further.Thank you.",
            "Aman M": "",
            "Goran V": "Hi Aman,Could you please try clearing your cache and cooked or login in with another browser to complete the process? If you`re still experiencing the same problem after this, let me know. Thank you.",
            "Rene K": "I had the same thing happening with Brave browser. Worked on Chrome.",
            "Virgile S": "Hey community! I recently have been required to complete the verification process. the ID step is already completed but I am having troubles with the video one. Can anyone help me out? I actually can see many members with the same issue! please help",
            "Joanne Marie P": "Hi Virgile,I'm sorry to hear that. Are you getting an error when trying to click on the start chat button? You may want to try using a different browser or clear your cache and cookies also. If that doesn't help, please let us know. Thank you."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Agencies/How-to-work-with-agency-Graphic-Design-field/m-p/861087": {
        "title": "How to work with agency? | Graphic Design field",
        "post_date": "Jan 19, 2021  05:03:58 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Amr Z": [
                "/t5/user/viewprofilepage/user-id/5740341",
                "May 26, 2020"
            ]
        },
        "messages": {
            "Amr Z": ""
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Clients/quot-You-ve-hit-a-max-of-connections-please-confirm-that-you/m-p/861086#M65463": {
        "title": "Re: \"You've hit a max # of connections, please confirm that you want to connect again\" pro",
        "post_date": "Jan 19, 2021  05:02:22 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Ahsan M": [
                "/t5/user/viewprofilepage/user-id/7160628",
                "Dec 31, 2020"
            ],
            "Goran V": [
                "/t5/user/viewprofilepage/user-id/580837",
                "Mar 24, 2017"
            ],
            "Muzamil H": [
                "/t5/user/viewprofilepage/user-id/7292203",
                "Jan 19, 2021"
            ],
            "Bojan S": [
                "/t5/user/viewprofilepage/user-id/1830380",
                "Mar 9, 2018"
            ],
            "Amber C": [
                "/t5/user/viewprofilepage/user-id/7156626",
                "Dec 30, 2020"
            ],
            "Gian L": [
                "/t5/user/viewprofilepage/user-id/6236791",
                "Aug 1, 2020"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ],
            "Vinay G": [
                "/t5/user/viewprofilepage/user-id/1546151",
                "Dec 26, 2017"
            ],
            "Susan B": [
                "/t5/user/viewprofilepage/user-id/6696452",
                "Oct 14, 2020"
            ]
        },
        "messages": {
            "Ahsan M": "Hi I'm also getting the same message what does it mean. I have connects",
            "Goran V": "Hi Ahsan,Please try clearing your cache and cookies or logging in with another browser. If you`re still experiencing any problems on your end, please share the text of the error you`re receiving on your end. Thank you.",
            "Muzamil H": "Same Issue. What does it mean?",
            "Bojan S": "HiMuzamil,Could you please clear your cache and cookies or log in with another browser to check if you`re still experiencing the same issue? Let us know if the issue persists. Thank you.",
            "Amber C": "",
            "Gian L": "Hello, recently I have this message on my chat app:You've hit a max # of connections, please confirm that you want to connect again. This might hinder me from getting chats from my clients. What should I do?",
            "Joanne Marie P": "Hi Gian,I’ve shared your concern with the team. One of our team members will reach out and assist you directly via a support ticket.",
            "Vinay G": "Hi JoanneI'm facing the same issue.Also, on the mobile app, whenever I open messages it's always stuck on Waiting for an internet connection and when I restart the app, it works fine, I wonder if this issue is because of the message of the maximum connection.Please check this issue as well.",
            "Susan B": "I found the same issue today on the desktop - maximum # of connections. I first encountered it when looking at active proposals - does this mean that the client never got my proposal? There were a LOT of proposals with this message in the \"messages\" section of the proposal display."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Client-ended-contract-abruptly-after-sending-him-pre-final-ver/m-p/861085": {
        "title": "Client ended contract abruptly after sending him pre-final ver of logo design",
        "post_date": "Jan 19, 2021  05:01:29 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Stefan M": [
                "/t5/user/viewprofilepage/user-id/7293554",
                "Jan 19, 2021"
            ]
        },
        "messages": {
            "Stefan M": "Hello,I contacted a client that needed a simple logo. Before he hired me a made him a draft of the logo, and he liked it and agreed to hire me. We made a contract for 50$. I did the logo and sent him a pre-final version and told him that I would do mockups and send him different color variations. He said to change a minor thing on the design and I agreed, but he simply responded that he \"doesn't need the mockups and sh**t\" and abruptly ended the contract without an explanation. He also wants a refund of 50$ even though he hasn't paid me for any milestone. What's the best thing to do and what are my options. Can I get a bad review? Is there a way for UpWork or the client to pay 50$ for the project I spent valuable time on?Thanks in advance"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Bug-editing-old-portfolio-groups/m-p/861084#M530904": {
        "title": "Re: Bug editing old portfolio groups",
        "post_date": "Jan 19, 2021  04:59:32 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Karen B J": [
                "/t5/user/viewprofilepage/user-id/7292176",
                "Jan 19, 2021"
            ],
            "Andrea G": [
                "/t5/user/viewprofilepage/user-id/6053355",
                "Jul 7, 2020"
            ]
        },
        "messages": {
            "Karen B J": "Bug report.I got a \"Something went wrong\" error.I set up this account a long time ago and it was inactive for awhile. I reactivated today and added a new portfolio group, or whatever you call it. That went fine, but when I went to edit any of my portfolio groups that I set up previously, it goes all the way through and errors out when I try to publish. That's for every one of them except the one I added today.",
            "Andrea G": "HiKaren,Could you please try clearing your cache and cookies or logging in with a different browser to see if the issue persists?Thanks!"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/ID-Verification/m-p/861083#M530903": {
        "title": "Re: ID Verification",
        "post_date": "Jan 19, 2021  04:56:52 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Andrea G": [
                "/t5/user/viewprofilepage/user-id/6053355",
                "Jul 7, 2020"
            ],
            "Muhmmad A": [
                "/t5/user/viewprofilepage/user-id/4796348",
                "Dec 21, 2019"
            ]
        },
        "messages": {
            "Andrea G": "HiMoses,I looks like our team reached out via support ticket#30721058 with instructions. If you need any further assistance please feel free to reply to your ticket directly so our team can review.Thanks!",
            "Muhmmad A": "Hi,I've been asked to verify my ID and I've been trying all day to start a call through the button, but it just keeps saying that no one is available. How can I get in contact with someone?Need your help"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Connects/m-p/861082#M530902": {
        "title": "Re: Connects",
        "post_date": "Jan 19, 2021  04:55:35 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Patrick M": [
                "/t5/user/viewprofilepage/user-id/7285273",
                "Jan 18, 2021"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ]
        },
        "messages": {
            "Patrick M": "Hi!I recently send a proposal for a project, got hired and paid. Unfortunately, I didn't receive the 10 free connects. What could be the issue? The contract ID is26031188. Thanks!",
            "Joanne Marie P": "Hi Patrick,I've escalated this to our team for further checking.One of our team members will reach out and assist you directly via a support ticket. You can access the ticket when you log in to your Upwork account and going here."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Upwork-refund-so-much-with-no-reason-Client-cheating-in-upwok/m-p/861081#M530901": {
        "title": "Re: Upwork refund so much with no reason, Client cheating in upwok? where is the hourly protection?",
        "post_date": "Jan 19, 2021  04:54:36 PM",
        "edit_date": "Jan 19, 2021  03:14:27 PM",
        "contributors": {
            "Maulana Yusup A": [
                "/t5/user/viewprofilepage/user-id/3898707",
                "Jun 18, 2019"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "Maulana Yusup A": "Hello,This is my first time and maybe this is a bad experience for me while joining the Upwork.First, I have a new contract from x Client. I check she is a Payment Method Verified, because I don't see any contract for this client.Then, I ask to Upwork Customer Support to check is it safe or not to work with her and he say \"Yes\" it safe since we have hourly protection and Upwork will guarantee the hours he said.Then I started working with the tight deadline (2 weeks) and spent much time and healthy every week.when the deadline is coming up (2 weeks in the Friday) client was happy and he says will do the Demo for the project and she say will back in 1 week, and she ended the contract (due holiday or something).I have facing not quite right in the Friday, since I'm Top Rated and usually get Faster Payment and for this Client I don't get it, I wonder and I ask to Customer Service Upwork, and he says no problem as you work good because Upwork have Hourly Protection, Ok no problem for now.I have read the Payment Protection also, I'm working with the honest. If Im cheating in Upwork I don't want to create this Topic.Because the first week I got the Payment ProtectionSecond week (I don't get payment protection) could u imagine if I cheating the hourly exactly 53 hours, how can I get 53 hours if I cheating?I ask to Customer Support 3 times!and then next week in the Wednesday I got the payment with the email from CS the client unsuccessful payment bla bla bla and Upwork cover to pay.this time I'm happy because my hours in the first week is paid.and then next week (this is the last payment, same happen the payment is not Faster on the Friday) so I need to wait to next week on Wednesday (Today).I have an emails that means xxxx much my money refunded with Upwork with no reason, with no notification to me why this happen? this is very not fair, where is the hourly protection?While Im working so hard and spent much time and healthy and Upwork get refunded so easily?If Client cheating in this platform why they are here to cheating us Freelancers?I don't understand with this, Upwork not check the Work Diary? and just get refund from Freelancer?The refund almost fully, working so hard 53 hours a week it's very very not fair!I have told Upwork before started, and why this refunded happen in the last payment and exactly in the time for paying to freelancer, why Upwork not checking the client account when the contract still running?Is the Client cheated on Upwork? very easy to cheating freelancer.I'm joined Upwork in 2019, I have never facing this problem before all contracts and clients was good. but for now I have a bad experience very very bad experience because my work is not paid and Upwork not guaranteed the hours while u working so hard and spent much time and healthy?could u imagine how much hours you can gave daily when u working 53 hours in a week for 1 client? I have 3 clients. it means I have working more than 53 hours, and this client almost make me headache and not good for health because I need to work almost 12-14 hours a day for only 1 client.Anybody can help me with this problem, Please help is outside here and there has same experience with me?",
            "Jennifer M": "There is a $2500 limit. Am I understanding you right that you got payment protection the previous week? That is why if that's true."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Does-anyone-know-how-long-it-usually-takes-for-testimonials-to/m-p/861080": {
        "title": "Does anyone know how long it usually takes for testimonials to appear?",
        "post_date": "Jan 19, 2021  04:53:35 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Kyrstin C": [
                "/t5/user/viewprofilepage/user-id/7293532",
                "Jan 19, 2021"
            ]
        },
        "messages": {
            "Kyrstin C": ""
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Upwork-gives-refund/m-p/861079#M530899": {
        "title": "Re: Upwork gives refund",
        "post_date": "Jan 19, 2021  04:53:28 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Aprilyne D": [
                "/t5/user/viewprofilepage/user-id/52831",
                "Sep 13, 2015"
            ],
            "Preston H": [
                "/t5/user/viewprofilepage/user-id/14531",
                "Nov 24, 2014"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ]
        },
        "messages": {
            "Aprilyne D": "",
            "Preston H": "It sounds like you did not qualify for Upwork Payment Protection.Do you already know what you did wrong, or do you need us to help you figure that out?",
            "Joanne Marie P": "Hi Aprilyne,I checked your account, and it looks like our team is already assisting you directly on this ticket number:30722627. I can see that you have already replied to the ticket. The agent assisting you will update your ticket to help you further."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Should-I-stop-my-tracker-in-which-segments/m-p/861078#M530898": {
        "title": "Re: Should I stop my tracker in which segments?",
        "post_date": "Jan 19, 2021  04:50:23 PM",
        "edit_date": "Jan 19, 2021  04:00:59 PM",
        "contributors": {
            "Benny S": [
                "/t5/user/viewprofilepage/user-id/6115866",
                "Jul 15, 2020"
            ],
            "Rafsun S": [
                "/t5/user/viewprofilepage/user-id/1723641",
                "Feb 10, 2018"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "Benny S": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.",
            "Rafsun S": "My opinion is to continue the tracker as long as you work on the project.Don't worry about the 10 minutes or the screenshot. Tracking time and capturing screenshots is Upwork's job. It also counts the keyboard and mouse click. So longtime gap will show less performance though I believe, it doesn't always count 100% correct.I usually stop the tracker when I need to do other small things that might need one minute plus such as smoking (as I don't smoke in my home) or going washroom. I start the tracker again when I start the project.A screenshot is useful evidence. Now, if you browse something that is non-related to the project and if the screenshot was captured on that, a hard client might be dissatisfied.",
            "Jennifer M": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.I run it until the 9 minute mark just to make sure I have activity and don't start it any time after the 3 minute mark in the segment. The screenshot is what logs the time, but if you stop the tracker without having at least 7 minutes of activity you risk losing it if you need the payment protection or if the client disputes."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/New-to-Upwork/Get-Profile-Feedback-from-Experienced-Freelancers-on-Upwork/m-p/861077#M126868": {
        "title": "Re: Get Profile Feedback from Experienced Freelancers on Upwork",
        "post_date": "Jan 19, 2021  04:46:06 PM",
        "edit_date": "Jan 19, 2021  03:14:27 PM",
        "contributors": {
            "Sergio D": [
                "/t5/user/viewprofilepage/user-id/7288096",
                "Jan 19, 2021"
            ],
            "Aditi J": [
                "/t5/user/viewprofilepage/user-id/43353",
                "Jul 28, 2015"
            ],
            "Angelica F": [
                "/t5/user/viewprofilepage/user-id/6269940",
                "Aug 6, 2020"
            ],
            "Iragena E": [
                "/t5/user/viewprofilepage/user-id/7157795",
                "Dec 30, 2020"
            ],
            "Yasir M": [
                "/t5/user/viewprofilepage/user-id/7289149",
                "Jan 19, 2021"
            ],
            "Rose S": [
                "/t5/user/viewprofilepage/user-id/3502516",
                "Mar 26, 2019"
            ],
            "Kanwaljeet M": [
                "/t5/user/viewprofilepage/user-id/7290056",
                "Jan 19, 2021"
            ],
            "Pooja J": [
                "/t5/user/viewprofilepage/user-id/7113860",
                "Dec 22, 2020"
            ]
        },
        "messages": {
            "Sergio D": "Hello great community! Might I ask some help and feedback for my profile?I am new to the website and still don't understand everything, but was able to get a job and get a review from it, but most of the time I don't get any answers from my proposals.Thanks in advance!",
            "Aditi J": "Sergio, your profile is not public. I am happy to review it if you set it up as public or provide a link.",
            "Angelica F": "",
            "Iragena E": "Hi, I would love someone to view my profile and give me feedback. I really appreciate it. Thanks.",
            "Yasir M": "Hi Upwork Community!I am an new freelancer on Upwork. I am starting with creating some newUpwork Project Catalog. I want to ask how can I rank or get my first order on my project as a new freelancer?Thank you.",
            "Rose S": "Hi, I am struggling to land my first gig. I believe I am excellent at writing. I have a few happy clients outside of this platform. I just cannot seem to score a job here. Time is running out for me because I have been around for two years without even one job. Please help.",
            "Kanwaljeet M": "its been over a year since i am on upwork however I have not been able to book any job please help",
            "Pooja J": "Greetings,Would you pls help me check my profile and provide me with honest feedback? Here is my profile link.https://www.upwork.com/freelancers/~01a2280f75c358c2f8Thank you!"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/identity-verification-video-call-not-working/m-p/861076#M530897": {
        "title": "Re: identity verification video call not working",
        "post_date": "Jan 19, 2021  04:44:54 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Goran V": [
                "/t5/user/viewprofilepage/user-id/580837",
                "Mar 24, 2017"
            ],
            "Catherine T": [
                "/t5/user/viewprofilepage/user-id/5557415",
                "Apr 29, 2020"
            ],
            "Dalmiro P": [
                "/t5/user/viewprofilepage/user-id/5999607",
                "Jun 30, 2020"
            ],
            "Sohaib Z": [
                "/t5/user/viewprofilepage/user-id/6122551",
                "Jul 16, 2020"
            ],
            "Muhmmad A": [
                "/t5/user/viewprofilepage/user-id/4796348",
                "Dec 21, 2019"
            ]
        },
        "messages": {
            "Goran V": "Hi Muhammad,One of our team members will reach out to you via ticket as soon as possible and assist you further with your verification. Thank you.",
            "Catherine T": "I'm unable to verify my identity. My start chat button is not working; it redirects me to the support home page, as well. I have tried different browsers, cleared browsing history and cookies, and tried on multiple devices. I posted in the community forum about a week ago, but have not heard back. I have a current project that I am worried about losing. Please help me resolve this ASAP. I'm not sure why there's not an actual contact number or email to get ahold of Upwork, particularly when it seems that many people have this issue. Thank you in advance.",
            "Dalmiro P": "Please I need urgent help im having the same issue as everyone. WHen I click Start chat i get redirected to Help Desk. I already opened a ticket.",
            "Sohaib Z": "I am having the same issue. Clicking on \"start chat\" button redirects me to the upwork \"support\" page.I have tried it on Chrome, (both in and outside incognito mode) and on Microsoft Edge.",
            "Muhmmad A": "I've provided the details and everything for the first step of ID verification, but when I start visual verification, I get timed out and receive error.How to proceed to next step?Need your help...!"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Upwork-gives-refund/m-p/861075#M530896": {
        "title": "Re: Upwork gives refund",
        "post_date": "Jan 19, 2021  04:39:05 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Aprilyne D": [
                "/t5/user/viewprofilepage/user-id/52831",
                "Sep 13, 2015"
            ],
            "Preston H": [
                "/t5/user/viewprofilepage/user-id/14531",
                "Nov 24, 2014"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ]
        },
        "messages": {
            "Aprilyne D": "",
            "Preston H": "It sounds like you did not qualify for Upwork Payment Protection.Do you already know what you did wrong, or do you need us to help you figure that out?",
            "Joanne Marie P": "Hi Aprilyne,I checked your account, and it looks like our team is already assisting you directly on this ticket number:30722627. I can see that you have already replied to the ticket. The agent assisting you will update your ticket to help you further."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/New-to-Upwork/Constantly-getting-Timed-Out-when-trying-to-start-Visual/m-p/861074#M126867": {
        "title": "Re: Constantly getting Timed Out when trying to start Visual Verification call.",
        "post_date": "Jan 19, 2021  04:35:39 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Ivo D": [
                "/t5/user/viewprofilepage/user-id/7234418",
                "Jan 11, 2021"
            ],
            "Andrea G": [
                "/t5/user/viewprofilepage/user-id/6053355",
                "Jul 7, 2020"
            ],
            "Kamal F": [
                "/t5/user/viewprofilepage/user-id/7234860",
                "Jan 11, 2021"
            ],
            "Johnny P": [
                "/t5/user/viewprofilepage/user-id/7250165",
                "Jan 13, 2021"
            ],
            "Heather N": [
                "/t5/user/viewprofilepage/user-id/6871674",
                "Nov 13, 2020"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ],
            "Muhmmad A": [
                "/t5/user/viewprofilepage/user-id/4796348",
                "Dec 21, 2019"
            ]
        },
        "messages": {
            "Ivo D": "Hi I have a problem,I am constantly getting timed out when performing Visual verification process.I get timed out waiting for the upwork agent to get back to me.I tried filing ticket but can't do that because some of my account features are blocked.Best regards",
            "Andrea G": "HiIvo,One of our agentswill reach out to you via support ticket in order to assist you further.Thanks!",
            "Kamal F": "Hello Upwork,I am trying to finish Step 2 of the identity verification, but everytime I try to connect with an agent it keeps saying there are none. Any ways to get this verification completed?",
            "Johnny P": "I am trying to verify my identity and I've been trying for two days now. It keeps timing out. I need to keep earning money, what should I do?",
            "Heather N": "I had the exact same issue. Long story short, I realized my browser (Chrome) was the problem. I was able to connect via Safari. Make sure your 'block popups' feature is unchecked. Not sure if this will work for you, but it's worth a shot. Best of luck!",
            "Joanne Marie P": "Hi Johnny,I'm sorry to hear that. I've informed our team about the issue you're having when trying to complete the verification process. One of our agents will reach out and update you directly to assist further.",
            "Muhmmad A": "I've provided the details and everything for the first step of ID verification, but when I start visual verification, I get timed out and receive error.How to proceed to next step?Need your help...!"
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Should-I-stop-my-tracker-in-which-segments/m-p/861073#M530895": {
        "title": "Re: Should I stop my tracker in which segments?",
        "post_date": "Jan 19, 2021  04:30:49 PM",
        "edit_date": "Jan 19, 2021  04:32:48 PM",
        "contributors": {
            "Benny S": [
                "/t5/user/viewprofilepage/user-id/6115866",
                "Jul 15, 2020"
            ],
            "Rafsun S": [
                "/t5/user/viewprofilepage/user-id/1723641",
                "Feb 10, 2018"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "Benny S": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.",
            "Rafsun S": "My opinion is to continue the tracker as long as you work on the project.Don't worry about the 10 minutes or the screenshot. Tracking time and capturing screenshots is Upwork's job. It also counts the keyboard and mouse click. So longtime gap will show less performance though I believe, it doesn't always count 100% correct.I usually stop the tracker when I need to do other small things that might need one minute plus such as smoking (as I don't smoke in my home) or going washroom. I start the tracker again when I start the project.A screenshot is useful evidence. Now, if you browse something that is non-related to the project and if the screenshot was captured on that, a hard client might be dissatisfied.",
            "Jennifer M": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.I run it until the 9 minute mark just to make sure I have activity and don't start it any time after the 3 minute mark in the segment. The screenshot is what logs the time, but if you stop the tracker without having at least 7 minutes of activity you risk losing it if you need the payment protection or if the client disputes."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Upwork-refund-so-much-with-no-reason-Client-cheating-in-upwok/m-p/861072#M530894": {
        "title": "Re: Upwork refund so much with no reason, Client cheating in upwok? where is the hourly protection?",
        "post_date": "Jan 19, 2021  04:30:43 PM",
        "edit_date": "Jan 19, 2021  04:41:06 PM",
        "contributors": {
            "Maulana Yusup A": [
                "/t5/user/viewprofilepage/user-id/3898707",
                "Jun 18, 2019"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "Maulana Yusup A": "Hello,This is my first time and maybe this is a bad experience for me while joining the Upwork.First, I have a new contract from x Client. I check she is a Payment Method Verified, because I don't see any contract for this client.Then, I ask to Upwork Customer Support to check is it safe or not to work with her and he say \"Yes\" it safe since we have hourly protection and Upwork will guarantee the hours he said.Then I started working with the tight deadline (2 weeks) and spent much time and healthy every week.when the deadline is coming up (2 weeks in the Friday) client was happy and he says will do the Demo for the project and she say will back in 1 week, and she ended the contract (due holiday or something).I have facing not quite right in the Friday, since I'm Top Rated and usually get Faster Payment and for this Client I don't get it, I wonder and I ask to Customer Service Upwork, and he says no problem as you work good because Upwork have Hourly Protection, Ok no problem for now.I have read the Payment Protection also, I'm working with the honest. If Im cheating in Upwork I don't want to create this Topic.Because the first week I got the Payment ProtectionSecond week (I don't get payment protection) could u imagine if I cheating the hourly exactly 53 hours, how can I get 53 hours if I cheating?I ask to Customer Support 3 times!and then next week in the Wednesday I got the payment with the email from CS the client unsuccessful payment bla bla bla and Upwork cover to pay.this time I'm happy because my hours in the first week is paid.and then next week (this is the last payment, same happen the payment is not Faster on the Friday) so I need to wait to next week on Wednesday (Today).I have an emails that means xxxx much my money refunded with Upwork with no reason, with no notification to me why this happen? this is very not fair, where is the hourly protection?While Im working so hard and spent much time and healthy and Upwork get refunded so easily?If Client cheating in this platform why they are here to cheating us Freelancers?I don't understand with this, Upwork not check the Work Diary? and just get refund from Freelancer?The refund almost fully, working so hard 53 hours a week it's very very not fair!I have told Upwork before started, and why this refunded happen in the last payment and exactly in the time for paying to freelancer, why Upwork not checking the client account when the contract still running?Is the Client cheated on Upwork? very easy to cheating freelancer.I'm joined Upwork in 2019, I have never facing this problem before all contracts and clients was good. but for now I have a bad experience very very bad experience because my work is not paid and Upwork not guaranteed the hours while u working so hard and spent much time and healthy?could u imagine how much hours you can gave daily when u working 53 hours in a week for 1 client? I have 3 clients. it means I have working more than 53 hours, and this client almost make me headache and not good for health because I need to work almost 12-14 hours a day for only 1 client.Anybody can help me with this problem, Please help is outside here and there has same experience with me?",
            "Jennifer M": "There is a $2500 limit. Am I understanding you right that you got payment protection the previous week? That is why if that's true."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Request-account-deactivation/m-p/861071#M530893": {
        "title": "Re: Request account deactivation",
        "post_date": "Jan 19, 2021  04:30:03 PM",
        "edit_date": "Unedited",
        "contributors": {
            "Roman T L": [
                "/t5/user/viewprofilepage/user-id/7292908",
                "Jan 19, 2021"
            ],
            "Andrea G": [
                "/t5/user/viewprofilepage/user-id/6053355",
                "Jul 7, 2020"
            ],
            "Joanne Marie P": [
                "/t5/user/viewprofilepage/user-id/1440201",
                "Nov 26, 2017"
            ]
        },
        "messages": {
            "Roman T L": "",
            "Andrea G": "HiRoman,Please know, we are not able to discuss details of another user's account with you because of privacy concerns. Users are not allowed to have more than one account regardless if the old account is closed. Please let your brother know he canreach out to us through our different support channels and we'll be happy to assist with reinstating his account.Thanks!",
            "Joanne Marie P": "Hi Roman,Please have your brother refer to the information shared with him about his account status. You may also have him reach out to us directly. Please know that we are not able to discuss any information about another freelancer's account here in the community. Thank you for your understanding."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Should-I-stop-my-tracker-in-which-segments/m-p/861070#M530892": {
        "title": "Re: Should I stop my tracker in which segments?",
        "post_date": "Jan 19, 2021  04:29:24 PM",
        "edit_date": "Jan 19, 2021  04:00:59 PM",
        "contributors": {
            "Benny S": [
                "/t5/user/viewprofilepage/user-id/6115866",
                "Jul 15, 2020"
            ],
            "Rafsun S": [
                "/t5/user/viewprofilepage/user-id/1723641",
                "Feb 10, 2018"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "Benny S": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.",
            "Rafsun S": "My opinion is to continue the tracker as long as you work on the project.Don't worry about the 10 minutes or the screenshot. Tracking time and capturing screenshots is Upwork's job. It also counts the keyboard and mouse click. So longtime gap will show less performance though I believe, it doesn't always count 100% correct.I usually stop the tracker when I need to do other small things that might need one minute plus such as smoking (as I don't smoke in my home) or going washroom. I start the tracker again when I start the project.A screenshot is useful evidence. Now, if you browse something that is non-related to the project and if the screenshot was captured on that, a hard client might be dissatisfied.",
            "Jennifer M": "I just read about a post aboutwhen I should stop my tracker?However, I still have the question:should I stop my tracker in a 10 minutes segment, or when the screenshot is taken?Due sometimes you work xx:18 hrs,so these eight minutes should be considered within the working time and not the opposite.Also, I understand that the screenshot is useful to evidence my work, but Im not sure if this affect somehow in my working times.I run it until the 9 minute mark just to make sure I have activity and don't start it any time after the 3 minute mark in the segment. The screenshot is what logs the time, but if you stop the tracker without having at least 7 minutes of activity you risk losing it if you need the payment protection or if the client disputes."
        },
        "moderated": false
    },
    "https://community.upwork.com/t5/Freelancers/Possible-Job-Scam/m-p/861069#M530891": {
        "title": "Re: Possible Job Scam",
        "post_date": "Jan 19, 2021  04:24:42 PM",
        "edit_date": "Jan 19, 2021  02:17:46 PM",
        "contributors": {
            "John S": [
                "/t5/user/viewprofilepage/user-id/7227047",
                "Jan 10, 2021"
            ],
            "Mary W": [
                "/t5/user/viewprofilepage/user-id/12679",
                "Nov 10, 2014"
            ],
            "Jennifer M": [
                "/t5/user/viewprofilepage/user-id/28061",
                "May 17, 2015"
            ]
        },
        "messages": {
            "John S": "I've applied for a job in Customer Service and was contacted by the individual responsible for the post the same day informing me of being selected for the process of hiring. The message and posting disappeared and I was contacted through Skype to do a questionnaire process in which I did and was told I got selected for the job. I did NOT give out my personal information and I have a feeling this is very sketchy. Please help immediately.",
            "Mary W": "Until you are officially hired on Upwork, you cannot connect with a potential client on Skype, Telegram, Hangouts or any other way excep through the Upwork platform. Report the job if you can find it. Maybe in your proposals? Flag the job and be more careful about communication on - and only on - the platform.Please don't apply to any more jobs until you thoroughly understand the TOS. There is a lot of information about scams - read it before you get in trouble.",
            "Jennifer M": "oooh you got graded. What grade did you get?"
        },
        "moderated": false
    }
}